["Michelle Obama visits The Colbert Report http://t.co/JZgBRgi6","Media Cynic joins Pinterest http://t.co/rCxrO4UH","SNL Cold Open: Mitt Romney wants to be known as the Cat Neutering President http://t.co/LTA0tXGL","Bo wears bunny ears in White House Easter Egg Roll announcement http://t.co/Ls1qjjkq","President and Mrs. Obama host Passover Seder dinner at White House http://t.co/UkIbmAW1","Iraq's fashion police crack down on men wearing emo style clothing http://t.co/Y4nPkDOs","RT @science: U.S. Coast Guard sinks tsunami ghost ship http://t.co/YhqDV7h2","President Obama: Women should be admitted to Augusta National http://t.co/Ll2l110M (via @golf)","CNN: Romney sweeps Wisconsin, Maryland, D.C. http://t.co/qxyMCkYh","Michelle Obama presents Taylor Swift with The Big Help Award http://t.co/NsUM5tsJ","Michelle Obama attends 2012 Kids' Choice Awards with daughters Sasha and Malia http://t.co/eyzcGfSb","Dick Cheney has a new heart http://t.co/Q5oBbWVm","Former Vice President Dick Cheney underwent heart transplant surgery today http://t.co/Ae7geXgD (via @newsalert)","Etch-A-Sketch toy catches fire following gaffe by Senior Romney Adviser http://t.co/5562H6PN (via @toys)","Romney routs Santorum in GOP primary in Illinois http://t.co/bNjvFJCC","Puerto Rico votes in Republican presidential primary http://t.co/8eHQKxtu","President Obama celebrates St. Patrick's Day with Irish cousin at Washington, D.C. pub http://t.co/4rb2Xl7o","Martin Short sings \"It's Raining Mitt!\" song for Mitt Romney http://t.co/UwGmtSF1 (via @videonacho)","Stephen Colbert: Even the Army is pulling out of Rush Limbaugh's show http://t.co/8HPmf73L","Jason Russell, co-founder for Invisible Children, detained Thursday for being drunk in public and masturbating http://t.co/EiVCCJR2","Rush Limbaugh joins Twitter. His account is @limbaugh http://t.co/2RWenzcM (via @bloggersblog)","President Obama makes 2012 NCAA Tournament Picks http://t.co/fWDr8CMu (via @sportsosphere)","Rick Santorum wins Alabama and Mississippi, Gingrich vows to stay in race http://t.co/eRkGi2NB","Santorum has early lead in Alabama http://t.co/UlKOEATZ","Close 3-way GOP race in Mississippi http://t.co/mIinEM5R","Doonesbury author Garry Trudeau defends abortion strip http://t.co/mcwKKvLZ","SNL pokes fun at Rush Limbaugh's loss of sponsors http://t.co/8LbjfJbn","Rick Santorum has won the Kansas Republican Caucus. http://t.co/WtW88Awa","Newt Gingrich vows to remain in 2012 race http://t.co/pyrjThof","Rush Limbaugh continues losing advertisers despite apology http://t.co/33jrtd7J (via @writenews)","Republican presidential candidate Mitt Romney wins five of ten states on Super Tuesday http://t.co/SZrol6fY","Wikileaks says Bin Laden not buried at sea, body was moved on CIA plane to US http://t.co/882r1TBx","SNL Skit: James Carville discusses Rush Limbaugh, Mitt Romney Starring Bill Hader http://t.co/v9Nvtydc","Mitt Romney wins Arizona, Michigan primaries http://t.co/5RKhrHv4","Sarah Palin was nominated for a Worst Actress Razzie despite playing herself in Sarah Palin: The Undefeated http://t.co/LswNsU1L","\"Satan has his sights on the United States of America\" warns Rick Santorum http://t.co/itOdICEw","Senator Charles Schumer is concerned about inhalable caffeine - says it is the new Four Loko http://t.co/vxlHy3Qd","Iran stops oil sales to British and French firms http://t.co/ulCrZEGq","SNL Skit: The Obamas on The Cosby Show http://t.co/hz32Efgt","‘Where Are The Women?’ Democrats go on offense over contraception http://t.co/0LSTJkm7","Ohio Attorney General Mike DeWine switches support from Romney to Santorum http://t.co/vqMJlZY8","Joseph Kennedy III launches campaign for congressional seat held by Barney Frank http://t.co/9Ppf0uwA","Megadeth frontman backs Rick Santorum http://t.co/3v5dLfyM","Maine Caucus results: Romney 39.2% Paul 35.7% with 83.7% of precincts reporting http://t.co/rlT1Xc4y","Ron Paul could get his best shot at a victory in Maine tomorrow http://t.co/rMWPobxO","NRA official is worried Obama will outlaw guns in 2nd term http://t.co/Zg1dreJ6","RT @science: The Magna Carta rests in special argon filled encasement at Archives Conservation lab http://t.co/TAyg8C2O","International 'militarization' in Syria growing closer, warns US official http://t.co/NRcppkbo","Rick Santorum wins Colorado, Minnesota and Missouri http://t.co/yUyB9I9O","Obama says he's getting better as time goes on. http://t.co/uFAOYuOi","SNL Skit: Newt Gingrich, Moon President starring Bobby Moynihan and Kristen Wiig http://t.co/FJ9xlXqD","Mitt Romney coasts to easy win at 2012 Nevada Caucus http://t.co/P2XGgc6d","West deplores Syria draft UN veto by Russia and China http://t.co/UWBe7RQX","Republican front-runner Mitt Romney poised for an easy Nevada win says Reuters http://t.co/Z3nxzjuc","Hyperion signs two-book deal with Massachusetts Governor Deval Patrick http://t.co/tDi8WAR5 (via @books)","You can also get political news from Media Cynic on our new Google+ page http://t.co/1XED2Ebj","Newt Gingrich did not call Mitt Romney to congratulate him. http://t.co/6pP2CSiz","Trailer for Game Change staring Julianne Moore as Sarah Palin http://t.co/XcwNcJD1","Mitt Romney Stomps Newt Gingrich in Florida http://t.co/ucjEIxQa","The Muppets hit back at Fox News http://t.co/CzrJn2UV (via @pmb)","President Obama and his dog Bo take a limo ride http://t.co/7Fz3MW1i","Mitt Romney compares Newt Gingrich to Goldilocks over his debate complaints http://t.co/MQ5QIjpw","Herman Cain endorses New Gingrich, talks \"sausage grinder\" http://t.co/vVtc63eu","Elections predictor Larry Sabato warns of Newt-Mare http://t.co/WXm8OYYN","U.S. outrage as Egypt bars Americans from leaving http://t.co/AKl6fPsz","Newt Gingrich promises Moonbase if elected. http://t.co/Hzy4cMVX","Jon Stewart explains Newt Gingrich's win in South Carolina http://t.co/5lKbq9Ik","Gingrich craves applause - threatens to skip debates if audiences can’t participate http://t.co/Wc6cblgN","Filmmaker Oliver Stone would vote for Ron Paul over Obama http://t.co/w1JUThRM","Senator Rand Paul discusses his run in with the TSA http://t.co/RXZ8Laf1","Senator John Kerry gets black eyes, swollen nose from playing ice hockey http://t.co/pZoJPI43","Ron Paul says TSA \"gropes and grabs our kids and our seniors and does nothing to keep us safe\" http://t.co/lCoBwtFL","Gov. Chris Christie: Newt Gingrich is an embarrassment to the Republican Party http://t.co/wiSu5jJh","Congresswoman Gabrielle Giffords announces her resignation on Youtube http://t.co/scEThjbX","Santorum says he is headed to Florida and \"everywhere else\" in America after third place finish in South Carolina http://t.co/24qMQfrO","Ron Paul campaign to focus on caucuses http://t.co/DNb339LF","Jon Stewart blasts Gingrich for wanting an open marriage, leaving wives who were sick http://t.co/3SsruCUb","Gingrich backed censoring the Internet in 2006 http://t.co/outJba7T #censorship","Newt Gingrich 40.2% Romney 26.7% Santorum 17.9% Paul 13.4% with 55.3% of precincts reporting in S.C. http://t.co/rlT1Xc4y","Google's election results page for the South Carolina primary can be found here - 0.0% reporting so far http://t.co/rlT1Xc4y","Newt Gingrich expected to win South Carolina despite allegations by ex-wife he asked for an open marriage http://t.co/Bz7vZJUb","The White House joins Google+ http://t.co/bfVZ9meq (via @bloggersblog)","President Obama sings part of Al Green song at fundraising event http://t.co/73m6n9SU","President Obama announce new U.S. Tourism Plan in Disneyland http://t.co/oQggag5m","Rick Santorum's Tragic Yearbook Photo http://t.co/ynJ4IcPH #ricksantorum","Newt Gingrich's second wife: Newt wanted an open marriage with me and his mistress Callista http://t.co/hFwi1ej4","New poll has Gingrich ahead of Romney in South Carolina GOP primary. http://t.co/wKE29Akt","Senator Marc Rubio withdraws support for PIPA http://t.co/KR6pVd21 (via @internet)","U.S. Secretary of State Hillary Clinton meets Kareem Abdul-Jabbar http://t.co/uW48P8mq","Google blacks out logo in SOPA protest http://t.co/yKdyjjbc (via @internet)","John Huntsman to quit GOP race, endorse Romney http://t.co/BKyijcQy","SNL: The Exit Poll starring Kristen Wiig and Daniel Radcliffe http://t.co/4y9FIraI","Conservative contenders go after frontrunner Romney http://t.co/Nj7Ze05e","Latest Newt Gingrich attack ad slams Mitt Romney for speaking French http://t.co/exWOShPN","Rick Perry's Champion ad http://t.co/ZOKmJZFD","Rick Perry hopes to revive struggling campaign in South Carolina http://t.co/rL3qPTXw","Mitt Romney declared winner of New Hampshire primary. Ron Paul in 2nd with 28.9% of precincts reported. http://t.co/oheqJR1r","Jon Stewart blasts Gingrich, Santorum's hypocrisy in attacking Romney's business background, wealth http://t.co/7oCTibgS","Mitt Romney 36.8% Ron Paul 26.3% in early lead in New Hampshire Primary with just 1% of precincts reporting http://t.co/7VriHhCW","A 25-year-old man was charged Monday with plotting a series of attacks in Florida http://t.co/FUzRwLtF","White House threw secret Alice in Wonderland bash in 2009. Tim Burton decorated. http://t.co/TcMFX2hq","Kim Jong Un drives tank in North Korea propaganda film http://t.co/cmdIT8FV (via @offbeat)","Rick Perry wants to send troops back to Iraq http://t.co/6sQIHHeX","Bluewater Productions to publish Ron Paul comic book http://t.co/p7EFKSZd (via @iwj)","John McCain mistakenly endorses Obama for president at Romney rally. http://t.co/n6orXlPR","Jon Stewart makes fun of CNN's weeble graphics used to explain the Iowa caucuses http://t.co/eMxccJQ7","Joseph Kennedy III takes steps toward run for Congress http://t.co/7K6lnS8E","First Lady Michelle Obama to guest star on iCarly http://t.co/XafIHt7G","Ron Paul says Newt Gingrich is a chickenhawk http://t.co/WIL08VMW","99.5% of precincts have slowly reported tonight but Iowa caucus still too close to call between Santorum and Romney http://t.co/oheqJR1r","Rick Perry says he's going to \"reassess\" his campaign for GOP nomination http://t.co/rm6NSCIn","Newt Gingrich calls Mitt Romney a liar http://t.co/7BKJYmEd","CBS News projects three-way race between Romney, Paul and Santorum in Iowa http://t.co/WhijzPoM","Ron Paul is most searched candidate for the past week and month on Google http://t.co/5ugLy1EP","Rick Santorum once proposed a bill to privatize the weather and force people to pay to get their weather information http://t.co/8fu5Yoaa","Paul, Romney and Santorum in near 3-way tie in latest Iowa poll. http://t.co/b0Dz8RTu","No veto. Obama signs controversial Defense authorization bill despite \"serious reservations with certain provisions.\" http://t.co/8bzLHmcc","Kelly Clarkson's album sales spike following her tweet supporting Ron Paul http://t.co/htAhdH4X","New Gingrich says Sarah Palin would be good for Vice Presidency or Energy Secretary http://t.co/7c66sBP2","Michelle Bachmann's Iowa chair defects to Ron Paul. http://t.co/8rkDWNqn","Mitt Romney: \"Big Bird is going to have advertisements, all right?\" http://t.co/1Wttyv4N","Kim Jong-il's funeral features large procession, hordes of wailing mourners http://t.co/lYrBuCcK","Ron Paul has 4 point lead over Romney in post-Christmas Iowa poll. New Gingrich slips to just 13%. http://t.co/LlfJHF9l","Rick Santorum sets bar low for Iowa: \"If I finish dead last behind the pack I'm going to pack up and go home.\" http://t.co/NcM8wQwZ","Discover magazine asks Is Newt Gingrich too fat to be president? http://t.co/Z3AxPGNX","Michelle Obama Takes Santa Tracker Calls  http://t.co/qzwuAVpT","President Obama arrives in Hawaii to begin Christmas vacation http://t.co/aEYEocyy","Teaser trailer for Game Change starring Julianne Moore as Sarah Palin http://t.co/Ytqv3bVy","The Des Moines Register endorses Romney as GOP nominee http://t.co/YNy4ZvHL","New Obamas family portrait photo taked by White House photographer Pete Souza http://t.co/pN8PiKSp","U.S. drones allowed in Iraqi skies http://t.co/XhHv6lRW","Secretary of Defense Leon Panetta lead ceremony marking formal end of Iraq War http://t.co/dSEjWJGd","SNL Skit: Donald Trump hosts a tiny GOP debate http://t.co/xHnpTvRF","Two poets withdraw from TS Eliot Prize in protest over sponsorship by investment bank http://t.co/euS13RJi (via @iwj)","Rick Perry goes all out for conservative religious voters in controversial new ad http://t.co/JnxOhq4e","Stephen Colbert announces his invitational GOP Debate on Animal Planet http://t.co/lZECzo1D","Newt Gingrich to appoint John Bolton as Secretary Of State if elected http://t.co/Iey5Z6xK","SNL Cold Open: President Obama explains the power structure in the U.S. http://t.co/G0jZfr6X","Herman Cain suspends presidential campaign http://t.co/4gG7dMhx","Unhappy snake charmer leaves all his Cobras in Indian Tax Office http://t.co/9HNVEULk (via @offbeat)","Herman Cain 'reassessing' 2012 candidacy http://t.co/eyzc82sa","President Obama takes daughters shopping at an independent bookstore http://t.co/vlXxj9et (via @writerswrite)","Jimmy Fallon apologizes to Michele Bachman For introduction song http://t.co/dFkLFsRG","Pat Robertson on Macaroni and Cheese: Is that a Black Thing? http://t.co/Jwkxj1dL","Department of Homeland Security warns of dangers of frying a turkey http://t.co/ATbaoKid (via @gourmet)","SNL Cold Open: Mitt Romney, Raw and Unleashed starring Jason Sudeikis http://t.co/sI1amQ7i","Foreign hackers targeted U.S. water plant in apparent malicious cyber attack http://t.co/Em2g2HHG (via @howtoweb)","Occupy Wall Street camp broken up by police in NYC, 5,000 books thrown out http://t.co/VfVONLcR (via @writerswrite)","Saturday Night Live skewers Rick Perry's debate flubs http://t.co/opHxYeQc","Italian Prime Minister Silvio Berlusconi finally resigns, Italy rejoices http://t.co/UhEL6x3f","Congress members took part in insider trading says Abramoff http://t.co/5mkwKhqj (via @businessnews)","National Emergency Alert System Test Fails in Many Areas http://t.co/DNsMGI5v","U.S. government to run nationwide test of Emergency Alert System (EAS) today at 2 pm est http://t.co/MTvoszN0","Sharon Bialek accuses Herman Cain of groping her in 1997 http://t.co/OfYFwnwa","Saturday Night Live takes aim at Rick Perry's rambling New Hampshire speech http://t.co/PrjbocAG","RT: @science: White House says the U.S. government has had no contact with extraterrestrials. http://t.co/p9edt9D1","President Obama tops Forbes' ranking of world's most powerful people http://t.co/snmIMFHY","Hacker group Anonymous threatens Mexican drug cartel with exposure http://t.co/XlQaomfj","Herman Cain denies sexual harassment charges, claims no knowledge of cash settlement. http://t.co/Nh1Bb1ky","Statue of Liberty celebrates 125th birthday, closes for renovations for one year http://t.co/DRi4cv1n","President and First Lady hand out candy at White House http://t.co/x8dyp8FQ","White House hosting Halloween party. Kids will get M&Ms, cookies and dried fruit http://t.co/qOiMVXfw","Suicide bomber kills 13 Americans in Afghanistan http://t.co/IPKe2LHU","Republican presidential candidate Jon Huntsman addresses Chinese people in fluent Mandarin http://t.co/f7H6Jvh5","Rick Santorum cheers death of Iranian nuclear scientists. http://t.co/ztcmSx3y","Joe the Plumber runs for Congress. Says he's doesn't want power or to be a congressman. He says he is angry. http://t.co/NJ6sY5tW","President Obama buys two large white pumpkins for White House http://t.co/lJJWtYLs","Saudi Crown Prince Sultan bin Abdulaziz Al-Saud dies http://t.co/GK8rKQRC","Infographic: American forces in Afghanistan and Iraq http://t.co/n4khjorj","Herman Cain wins straw poll at Western Republican Leadership Conference http://t.co/B4k7pzo1","Diplomatic Gaffe: Female Australian Prime Minister bows instead of curtsying to Queen Elizabeth http://t.co/ZObo2kq6","Gaddafi dead or captured, reports claim http://t.co/FTRLqWzF (via @newsalert)","Sarah Palin says Newt Gingrich would clobber Barack Obama in any debate http://t.co/QgIomxiT","Hillary Clinton: 'It's Time for Others to Step Up' http://t.co/Ipqld9r8","SNL Skit: Republican Presidential candidates at the local Marriot Hotel http://t.co/V0HIhfX4","SNL Skit: Mayor Bloomberg discusses the Occupy Wall Street http://t.co/LUsBn4Sl","To isolate Iran, U.S. presses inspectors on nuclear data http://t.co/8vpe8TiD","Colin Powell writing book about leadership and life lessons http://t.co/WkpKcMvg","Rupert Murdoch heckled by people dressed as Sesame Street characters http://t.co/JTsmh290","Chicken restaurant in China is President Obama's likeness in its logo http://t.co/K5tdrvtm (via @offbeat)","Herman Cain, Mitt Romney tie in new Rasmussen Poll http://t.co/KQRXxKy8","Video: Michelle Obama does jumping jacks on White House lawn http://t.co/c8BSe6Nn","\"Joe the Plumber\" announces congressional bid http://t.co/BH209LwR he's not a licensed plumber, his name is Sam http://t.co/vggLUAAm","Kanye West visits expanding Occupy Wall Street protests with Russell Simmons http://t.co/bASVLz6T","Al-Qaeda questions legality of U.S. killing of citizen Anwar al-Awlaki http://t.co/jALYIChp","California bans minors from using tanning beds. http://t.co/kYKMUqpk (via @health)","SNL Skit: Chris Christie explains why he can't run for President -- Yet http://t.co/MMrDs7vQ","Liberian President Ellen Johnson Sirleaf talks winning the Nobel Peace Prize http://t.co/boy9Jh2h","Joe Biden criticizes Bank of America for introducing new debit card fee http://t.co/1z7sf2xv","Houston Businessman Keith Drummond enters 2012 presidential race http://t.co/7E8ohdTk","Vladimir Putin's chief spokesman reveals that Putin's treasure dive was staged. http://t.co/rVVxusrM","President Obama issues statement on the passing of Steve Jobs http://t.co/u2eyopoL","Sarah Palin will not run for president. http://t.co/FQbVNzGR","New Jersey Governor Chris Christie says he is not running http://t.co/Miymza8u","Washpo: Chris Christie not running for president in 2012 http://t.co/oF2LKam5","Hank Williams Jr.'s song yanked from Monday Night Football after he insults Obama, Boehner http://t.co/9r0xGpqT","Mexico court upholds Baja California abortion stance http://t.co/5TH3mFCa","Rick Perry and the curious case of 'Niggerhead' ranch http://t.co/aHnfFP6p","NYTimes: Christie team assessing how fast a 2012 campaign could be mounted http://t.co/oVtjmfex","Michelle Obama was caught on camera shopping at the Target in Alexandria, Virginia. http://t.co/QBOuiJMX","New Jersey Governor Chris Christie vetoes Jersey Shore tax credit http://t.co/99K3oYRX","King Abdullah of Saudi Arabia grants women the right to vote, serve on Shura Council http://t.co/NO15Xqjx","SNL Skit: Republican debate between 2012 Presidential candidates http://t.co/q9iVnllK","Cain wins upset victory in Florida presidential straw poll http://t.co/fQsDviKX","Video: President Obama and former President Bill Clinton go golfing at Andrews Air Force Base. http://t.co/jshyCnp8 (via @golf)","Putin to return as Russian president - he and president Dmitry Medvedev switching jobs http://t.co/YUv8UGgb","Knopf to publish new book by Bill Clinton called Back to Work http://t.co/m5WWEpPS (via @books)","American Embassy reopens in Libya http://t.co/LlsRdkFB","Pentagon ends Don't Ask, Don't Tell: gays may serve openly in Military http://t.co/YHkV5AR6","Ex-Afghanistan president Burhanuddin Rabbani killed by turban bomb http://t.co/IZcIGZHD","Photo shoot for Levi Johnston's new book, Deer in the Headlights, about Sarah Palin & being in the media spotlight http://t.co/EmCDrJfM","Dick Cheney talks wife Lynne, five presidents in In My Time video http://t.co/VVKuGG5t","Mayor Bloomberg warns of Cairo-like riots in the streets of NYC if economy doesn't create more jobs http://t.co/niabNL5v (via @workerswork)","Flint's Glen Rice had steamy one-night stand with Sarah Palin according to new book http://t.co/kAXFWoOI (via @celebritygossip)","Debate Shocker: Audience cheers and laughs at idea of letting uninsured die if they can't pay. http://t.co/THGewtt (via @health)","Mitt Romney and Rick Perry talk poker at GOP debate http://t.co/SpFo2NY","President and Mrs. Obama, President and Mrs. Bush tour 9/11 Memorial http://t.co/CRu79yR","Video: Paul Simon performs The Sound of Silence at 9/11 Memorial http://t.co/wDuNTWQ","BBC examines the 9/11 conspiracy theories http://t.co/eAkmuyD","Telegraph says the 9/11 conspiracy theories aren't as irrational as you might think http://t.co/ZBBAHrN","9/11 ‘Truthers’ to tone protests down, for a day http://t.co/fti5G2o","ABC and CBS cover 9-11 conspiracy theories http://t.co/ei06Gfz http://t.co/pn0NCkx","Video: Former Presidents Bush and Clinton praise passengers of Flight 93 http://t.co/QKO0cab","Looters reportedly stole Gadhafi's weapons, including surface-to-air missiles http://t.co/z3Vpkun","Homeland Security Chief: Someday you won't have to remove your shoes at the airport http://t.co/mG6M1E9 (via @traveladvice)","Ron Paul ad calls Rick Perry a Texas Cheerleader for Al Gore http://t.co/2a4ap2n","Politico: Decision time for GOP elites http://t.co/u5ieZsS","RT @writerswrite Postmaster General: Post Office will shut down by Winter if Congress doesn't bail it out http://t.co/s6zVDZa","Dick Cheney dons a Darth Vader costume for Tonight Show appearance http://t.co/DOoOAoZ","Sarah Palin says America is facing a relentless raging storm http://t.co/BcsqEkG","First Lady Michelle Obama covers Essence magazine http://t.co/xkuKXHB","Gaddafi turns into sand on Time magazine cover http://t.co/sRO8RYd (via @writenews)","Jimmy Kimmel Live: Rick Perry Campaign Ad http://t.co/4LkoLC2 (via @jokes)","Report: Obama’s uncle arrested for drunk driving In Framingham http://t.co/IY2fAsw","Obama's disapproval rating climbs to 55% in latest Gallup poll. http://t.co/mvmgHd3","Dick Cheney claims his new memoir will have heads exploding all over Washington http://t.co/fq8Gbi9","Al-Qaida's No. 2, Atiyah Abd al-Rahman, reportedly killed in Pakistan http://t.co/4hSyKVH","President Obama cuts short family vacation due to Hurricane Irene http://t.co/HtwcNW1","President Obama says Hurricane Irene expected to be a historic hurricane http://t.co/t1BkE8T (via @hurricanes)","Dedication ceremony for the MLK Jr. memorial postponed due to Hurricane Irene http://t.co/qBYfniW","Muammar Qaddafi's Secret Crush: Rebels discover Qaddafi's secret photo album devoted to Condoleezza Rice http://t.co/5ptk3UO","British government won't seek additional powers to shut down social media sites. http://t.co/tI35ph1 (via @bloggersblog)","Cracks found in Washington Monument after Tuesday's earthquake - closed indefinitely http://t.co/hsuykmF","National Cathedral in Washington D.C. sustains significant damage from earthquake http://t.co/vP4trAU","Four novels on President Obama's Martha's Vineyard vacation reading list http://t.co/ooxtMq9 (via @writerswrite)","Obama says Gaddafi rule collapsing, supports rebels http://t.co/vcfGPET","Photo: President Obama gets saluted by little girl on July 4th http://t.co/y4dwkhk","Bill Clinton talks to Sanjay Gupta about his heart surgery, becoming a vegan http://t.co/fjqqtQx (via @health)","Video: Christine O'Donnell walks off set of Piers Morgan interview over gay marriage question http://t.co/8EWh0Ys","The White House joins Foursquare http://t.co/taVJbju","Michele Bachmann wins Iowa Straw Poll http://t.co/2aVZWdY","Video: Stephen Colbert recreates Paul Revere's ride, as described by Sarah Palin http://t.co/cCdb1fU","Texas Governor Rick Perry officially announces presidential bid http://t.co/53pG2Lu","Video: Sarah Palin visits Iowa State Fair, says she saw butter cow sculpture, tried butter-on-a-stick http://t.co/4ORecNz","Russian Prime Minister Vladimir Putin dives for ancient treasure. http://bit.ly/nEkMrE","Prime Minister Cameron says government may shut down social media during riots http://bit.ly/n8aE12","Mayor forced to shut off water supply in Kemp, Texas due to drought, residents suffering http://bit.ly/puYeUE","Levi Johnston's sister says Sarah Palin would have a mental breakdown if elected president. http://nyp.st/n6gyW5","Fox Headline: Obama's Hip-Hop BBQ Didn't Create Jobs http://bit.ly/o7gsiS","Jay-Z among celebs attending Obama's 50th-birthday party http://politi.co/p530EG","New ruling by HHS: Health Insurance plans must cover birth control without co-pays http://bit.ly/ndMBWZ (via @health)","Video: Rep. Gabrielle Giffords makes surprise return to House Floor for Debt Ceiling Vote http://bit.ly/n7YObT","Photo: Michelle Obama greets Children at NAS Oceana Summer Camp http://bit.ly/nfVsWF","Barack Obama loses 34,000 Twitter followers after Debt Crisis Tweets http://bit.ly/mOyzyB (via @bloggersblog)","Rick Perry's entry would shake up 2012 GOP field http://yhoo.it/qa6JIO","President Obama meets Dalai Lama in the Map Room http://bit.ly/qzfwtq","RT @internet Pentagon to treat Internet as operational domain of war http://reut.rs/oV90bH","Betty Ford Dies at the Age of 93 http://bit.ly/qbhx4Z","U.S.: Terrorists may surgically implant bombs http://bit.ly/r8KZwV","U.S.: Terrorists may surgically implant bombs http://bit.ly/r8KZwV (via @newsalert)","The White House is prepared to keep as many as 10,000 U.S. troops in Iraq after the end of the year http://lat.ms/paejVd","Ronald Reagan honored with statue in London http://bit.ly/nJBq8w","Female writer comes forward and accuses Dominique Strauss-Kahn of rape attempt http://bit.ly/mLBojI","President Obama to answer questions at Twitter Townhall http://bit.ly/kKTgx0","John Kerry: \"I would have been a good President. Maybe even a great one. How about that?\" http://bit.ly/ldQDSj","Michele Bachmann's Story of America by Jimmy Kimmel http://bit.ly/lz76I3","Sarah Palin in Iowa for debut of her film, The Undefeated http://bit.ly/kdgw3q","Former Illinois Governor Rod Blagojevich convicted of corruption: Faces maximum 300 years in Jail http://bit.ly/mccnUZ","Michelle Obama visits village in Botswana, is offered Deep Fried Fat Cakes and French Fries http://bit.ly/m76CtY","Photo: Michelle Obama addresses Young Women Leaders Forum in Soweto, South Africa http://bit.ly/knQ2CV","Glenn Beck tells Rick Santorum: 'I Could Kiss You In The Mouth' http://huff.to/l3z5HZ","44% of Americans say economy worse under Obama http://huff.to/liAKJ6","President Obama quiets crying baby http://bit.ly/k7djmO","Texas Gov. Rick Perry adds anti-groping bill to special session http://bit.ly/mNBFSl (via @traveladvice)","President Barack Obama starts using his Twitter for 2012 campaign http://bit.ly/lMTbcz (via @bloggersblog)","Golf Summit: President Obama, John Boehner, Joe Biden & John Kasich golf at Joint Base Andrews' golf course http://bit.ly/lYMgCa (via @golf)","Video: Rep. Anthony Weiner resigns from Congress, gets heckled http://bit.ly/jieXY9","Rep. Anthony Weiner reportedly weighing resignation following release of gym photos. http://bit.ly/iAAvkr","Rep. Weiner took numerous photos of himself, including partial nude photos, at the House Members Gym http://bit.ly/lMnRxA","Anthony Weiner to seek professional treatment - ill ask for a \"short leave of absence\" from Congress http://bit.ly/mJvuye (via @newsalert)","Top democrats say Anthony Weiner should resign http://huff.to/m52RQI #weinergate","Anthony Weiner admits contact with girl, 17 - denies anything inappropriate took place. http://politi.co/mRWrJV","Rick Santorum to run for President http://bit.ly/l3apBT","Politico: More sexually suggestive photos of Rep. Anthony Weiner surfaced Monday, including a shirtless photo http://politi.co/jKldCN","Video: Sarah Palin compounds Paul Revere error, adds more historical inaccuracies to tale http://bit.ly/mvCZ2C","Romney reaffirms stance that global warming is occurring and that humans are contributing to it http://bo.st/lVi6zY","President Obama eats at Rudy's Hot Dog in Toledo, Ohio http://bit.ly/lP6IzI","John Edwards: I Did Wrong, But I Did Not Break the Law http://bit.ly/jErVZF","John Edwards Indicted on Six Felony Counts http://bit.ly/j3MZtN","Video: Republican Mitt Romney opens bid for president. Says nation is in peril. http://bit.ly/mGJIhq","Video: Jon Stewart demands to see Trump's birth certificate after New York Pizza Fiasco http://bit.ly/il7vaX","Rep. Anthony Weiner says his Twitter account was hacked but he's not sure if the man in lewd photo is him or not http://bit.ly/iYYxez","Donald Trump and Sarah Palin have a dinner date in Manhattan http://bit.ly/m9fyHf","Video: Sarah Palin dons black leather and rides a Harley with daughter Willow at Motorcycle Rally http://bit.ly/lwE0eP","Sarah Palin to launch National Bus Tour http://bit.ly/mUHbGg","$500,000 Shrimp on a Treadmill study dubbed wasteful spending by Sen. Coburn (R-OK) http://bit.ly/jMcuS3 (via @science)","Barack Obama’s signature is totally a cartoon baby Tyrannosaurus playing with a ball of yarn. http://bit.ly/kfYUxV (via @offbeat)","Video: President and Mrs. Obama attend State Dinner at Buckingham Palace http://bit.ly/jrQHs5","President and Mrs. Obama give thoughtful, appropriate gifts to Queen Elizabeth http://bit.ly/ineWzg","Video: President and Mrs. Obama get formal welcome at Buckingham Palace http://bit.ly/ijP7sv","President Obama has no idea what year it is http://bit.ly/iG3ucJ","Prime Minister Vladimir Putin has decided to run for the presidency next year http://bit.ly/kJ1nLK","John Lithgow performs Newt Gingrich press release http://bit.ly/itAJ9w","Nesting robins return to the White House http://bit.ly/iMfHVK","French President's father confirms Carla Bruni-Sarkozy is pregnant http://bit.ly/jVDJPv","GOP presidential candidate Newt Gingrich hit with glittery confetti at book signing. http://huff.to/mTvJMI","SNL Cold Open: Barack Obama's new campaign slogan:  Kill bin Laden http://bit.ly/jKnUVc","Texas House of Representatives passes bill making TSA groping a felony http://bit.ly/lHetMW","Report: Porn found in Osama bin Laden’s hideout http://bit.ly/lwXYQ9","White House: No more photo re-enactments http://yhoo.it/kfmRlS","CBS News creates animation to illustrate Osama bin Laden raid http://bit.ly/mjbreK","Osama bin Laden used thumb drives and couriers to send his email http://bit.ly/mBrQ8q","Newt Gingrich running for president http://politi.co/jxu3xy","Arnold Schwarzenegger, Maria Shriver announce separation http://lat.ms/mhTud8","Sarah Palin's daughter, Bristol, moves in w baby & two single men, Kyle & Chris Massey, for reality show. http://bit.ly/lSHoy8","Obama talks about Osama Bin Laden mission -  longest 40 minutes of his life http://bit.ly/kA8aaS","Kuma Games recreates U.S. Osama bin Laden raid - lets gamers fight bin Laden and gather intelligence http://bit.ly/jvj47g (via @gamersgame)","U.S. Congressman Aaron Schock reveals abs on Men's Fitness cover http://bit.ly/kNDHh2","SNL Skit: Republican debate of undeclared 2012 presidential candidates http://bit.ly/lUg8Kc","Video: Osama bin Laden watches himself on television http://bit.ly/jx13nS","RT @writerswrite: Minnesota House Majority Leader Matt Dean hates author Neil Gaiman http://bit.ly/lt6rhB","Senator Brown fooled by fake dead Osama photo http://bit.ly/iYQt7t","Dead Man at Osama bin Laden compound appears to have had a water gun. http://bit.ly/iBj9vM","Obama won't release dead Osama pics. http://bit.ly/lXMEv4","Osama bin Laden unarmed during assault on Pakistan hideout http://bit.ly/lWpqdh","Panetta: Public likely to see OBL picture http://ti.me/ixbsga","Osama Bin Laden reportedly gave children bunny rabbits in Abbottabad. http://bit.ly/l6twPS","Osama bin Laden raid yields trove of computer data http://politi.co/mn1f3t (via @computers)","RT @newsalert U.S. intelligence officials believe a final Osama bin Laden propaganda tape is coming. http://bit.ly/kqEGMC","Photo: President Obama, Joe Biden, Hillary Clinton observe update on Osama mission in the Situation Room at White House http://bit.ly/lWbiEg","Mansion where Osama Bin Ladin was living in Pakistan is on fire http://bit.ly/ifMGQA","RT @newsalert Official: Osama bin Laden is dead. U.S. has his body. http://on.msnbc.com/jEKgKv","White House says Obama to make late-night statement Sunday; subject not announced http://wapo.st/iun3aA","Carnival barkers slam Obama's 'sideshow' remark http://bit.ly/jbDplo","Video: President Obama's monologue at White House Correspondents Association Dinner http://bit.ly/ifhQqq","Egypt intends to open Gaza border permanently http://bit.ly/meEfJg","Donald Trump drops F-Bomb during GOP-sponsored rally http://bit.ly/mBZcGz","President Obama releases long-form birth certificate http://bit.ly/fv81I0","President Obama reads Where the Wild Things Are at the 2011 White House Easter Egg Roll http://bit.ly/fpCv6T","Michelle Obama and Jill Biden stop by Sesame Street http://bit.ly/g5EI3j","President Obama conducts invisible meeting on oval office patio http://bit.ly/h52zJv","Donald Trump: I'm a bigger business man than Romney - says Romney is just a \"small business guy\" http://bit.ly/eh2GEa","Obama seeks Internet breakthrough that's as cool as walking on the Moon. http://bit.ly/dWF2tU (via @bloggersblog)","President Obama donated $100,000 to scandal plagued Central Asia Institute (CAI). http://bit.ly/gplOR0","New terror warning system replaces color coded terror alert http://bit.ly/hmkrky Alerts also on Twitter, @NTASAlerts","Gasy Busey endorses Donald Trump for President in 2012 http://bit.ly/ifZP8y","Obamas earned $1.7 Million in 2010 - most of the income came from President Obama's book sales. http://bit.ly/g7KEIC","Former Sarah Palin aide writing tell-all book http://yhoo.it/fdEhiY","RT @gadgets Rep. Jesse Jackson Jr. blames the iPad for killing jobs http://bit.ly/hCIe69","Video: Vladimir Putin plays ice hockey http://bit.ly/hRPlpy","Professor claims Sarah Palin did not give birth to baby Trig http://bit.ly/hf0kJL","Obama hits low point in Gallup poll -- 41% http://usat.ly/f0NseN","Obama proposes $4 trillion in deficit reduction over 12 years http://bit.ly/hgudE4","SNL Skit: James Carville discusses budget deal, being raised by eels http://bit.ly/dHWEcB","Deal reached to avoid government shutdown http://bit.ly/dOeKjC","Shutdown Near, No Sign of Compromise http://nyti.ms/hQq18J","RT @bloggersblog Report: Homeland Security to use Twitter, Facebook for Terror Alerts http://bit.ly/gpgqbY","Obama golf pal arrested in Honolulu prostitution sting http://bit.ly/fmcFwW","Libya's Crown Prince watching revolution From exile in London http://bit.ly/fCFlOu","Fox News Channel drops Glenn Beck's afternoon talk show after plunge in ratings. http://yhoo.it/hbERQW","Relatives of 9/11 victims angry at plans to house remains at bottom of Museum http://bit.ly/iczzFL","Jesse Ventura would consider running with Ron Paul. http://abcn.ws/fX0WPy","Video: Zombie Protest in Madison, Wisconsin http://bit.ly/gvf24T","Ex-mujahedeen help lead Libyan rebels http://on.wsj.com/eeVpOy","Video: British Muslim beauty queen harassed, threatened http://bit.ly/eZOapc","NRSC creates fake Obama 2012 Campaign Ad http://bit.ly/gSx8sD","President Obama asked if he has his own computer http://bit.ly/ek3eVV","Valerie Plame plans to write spy novels http://bit.ly/gy3BX5","RT @writerswrite Former President Clinton to write preface for spy novel. http://bit.ly/gln50b","All four of President Obama's final four picks for the NCAA men's basketball tournament failed to make it to the final four.","President Obama locked out of Oval Office http://bit.ly/fkkWD5","RT @newsalert A US Warplane has Crash Landed in Libya http://bbc.in/fvK4NB","Army braces for Afghan backlash after release of 3 graphic photos http://bit.ly/gAG1o0","Pawlenty announces presidential exploratory committee http://bit.ly/eVtg9w","Gaddafi refers to Obama as \"To my Dear Obama, our son\" in letter. http://bit.ly/fHLec6","Some liberal democrats in uproar over Libya action http://politi.co/fKdJCP","Farrakhan blasts President Obama for calling for Qaddafi to step down. Farrakhan: \"Who the hell do you think you are?\"  http://bit.ly/ezhHn0","Reuters: U.N. Security Council authorizes no-fly zone over Libya, \"all necessary measures\" to protect civilians","U.S. Military intensifies relief efforts in Japan, despite radiation threats. http://bit.ly/h93tNw","Navy: 17 Americans treated for contamination after flying through radioactive plume from nuclear plant in Japan http://nyti.ms/ekc1Ai","Libyan government handlers take CNN's Nic Robertson and other journalists on tour of re-captured areas http://bit.ly/hGgzhQ","Gen. Wesley Clark says Libya doesn't meet the test for U.S. military action http://wapo.st/fJBugk","Arab League backs Libya no-fly zone http://bbc.in/geT9j3","Saudi prince questions ban on women driving http://bit.ly/e7JfW8","Women harassed, attacked in Tahrir Square in Egypt during International Women’s Day protests http://bit.ly/froM4B","Obama to birthers: 'I was born in Hawaii. ... I can't change those facts.' http://usat.ly/ePWYxB","Muammar Gaddafi tells the BBC he is loved by all his people http://bbc.in/gn2QHZ","San Francisco's big push for low-flow toilets has created a multimillion-dollar plumbing problem. http://bit.ly/f6wKxP","A 20-year-old Saudi living in Texas charged with attempted use of a weapon of mass destruction.  http://bbc.in/hwubIR","Gaddafi blames Osama Bin Laden for protests http://bbc.in/h9czx6","Colonel Qaddafi had an idea to solve the Israeli-Palestinian conflict with a single new state called Isratine. http://nyti.ms/fxRaqB","Secretary of State Hillary Clinton: U.S. condemns violence in Libya against protesters http://bit.ly/hzSKj2","Russian President Dmitry Medvedev predicts \"fires for decades and the spread of extremism\" http://yhoo.it/f2e1lE","Former Defense Secretary Donald Rumsfeld says Osama Bin Laden-like figure ran off like a gazelle in Tora Bora region http://bit.ly/exxCGZ","New York congressman Chris Lee resigns amid topless photo scandal. http://bit.ly/dPqHIw","President Obama hosting \"neutral\" Super Bowl party http://bit.ly/hVsIXB","Sarah Palin warns Obama's policies have U.S. on road to ruin http://reut.rs/eGcbk8","Barbara Bush, the 29-year-old daughter of former President George W. Bush, supports gay marriage. http://bit.ly/hGBd6V","Federal judge says key part of health care reform unconstitutional http://bit.ly/hN9bNN","White House Photo: President Barack Obama talks on phone with President Hosni Mubarak of Egypt http://bit.ly/e8lnYA","Joe Biden thinks The Onion’s spoofs of him are hilarious. http://yhoo.it/fubvNv","Jay Carney named White House press secretary http://bit.ly/iefPss","Video: Tim Gunn rates the fashions at the State of the Union address http://bit.ly/hChwq4 (via @fashion)","Illinois Appellate Court rules Rahm Emanuel not Chicago resident, ineligible to run for mayor http://bit.ly/eWuVC0","Video: Stephen Colbert blasts Rush Limbaugh for Chinese impersonation http://bit.ly/eAZAmm","New Hampshire Republican Party Committee Straw Poll: Mitt Romney 35% Ron Paul 11% Tim Pawlenty 8% http://abcn.ws/hy96Jg","Michelle Obama wears Alexander McQueen gown, Kimberly McDonald Earrings to White House State Dinner http://bit.ly/dLK3jZ","NMA News animates China's president Hu Jintao's state visit http://bit.ly/fQZeK8","Congresswoman Gabrielle Giffords able to smile, give husband neck rub http://bit.ly/efcvxs","Cheney: Obama has learned that Bush policies were righ http://bit.ly/gtzZcC","Ron Reagan says his father had early symptoms of Alzheimer's in White House http://bit.ly/gwmwYS","Update: Rush Limbaugh's straight shooter Tucson billboard was taken down on Monday. http://gaw.kr/h7kMA9","Rush Limbaugh's straight shooter billboard currently hanging in Tucson. http://bit.ly/eSt4k9","White House photos of President Obama responding to Arizona shooting http://bit.ly/g7vvm5","Some bloggers noting shot congresswoman was in Sarah Palin's 'crosshairs' map. http://gaw.kr/g5fCAf","Rep. Gabrielle Giffords was shot in the head by a gunman at a public event in Tucson on Saturday. http://n.pr/i1W3oQ","Report: Kennedys miniseries pulled From History Channel because of political pressure http://bit.ly/ekRlKZ","New issue of the National Enquirer says John Edwards has proposed to Rielle Hunter. http://bit.ly/hKaJom","Package 'Flare-Ups' reported at 2 state buildings in Maryland http://bit.ly/e80ea4","Elizabeth Edwards' will makes no mention of John Edwards http://bit.ly/gAifqQ","Awkward party encounter: Hillary Clinton runs into Hugo Chavez at Brazil inauguration http://bit.ly/hTnpB4","RT @celebritygossip: Group against ground zero mosque launches Bieber boycott. http://bit.ly/gidXC1","SNL Skit: Democrats' Christmas Wishes http://bit.ly/hgaBIQ","Study finds Fox News has the most misinformed viewers. http://bit.ly/gciDGr","Schwarzenegger would consider role in Obama administration http://usat.ly/dQ0enR","Jimmy Fallon pokes fun at future Speaker of the House John Boehner and his propensity to burst into tears http://bit.ly/e5p6lB","Video: Sarah Palin visits Haiti http://bit.ly/fGMLQ2","Video: Khloe Kardashian says airport security is like being raped. http://bit.ly/fyp3M4","Elizabeth Edwards dies of cancer at 61 http://bit.ly/fdfT2R","DHS launches “If You See Something, Say Something” campaign at Walmart stores http://bit.ly/igVtKy","Obama pardons 9 people http://yhoo.it/gmi4Kx","US deploys 'game-changer' weapon to Afghanistan http://yhoo.it/fRMvhZ","Video: President Obama nurses split lip after basketball mishap http://bit.ly/hHdhEn","Former House Majority Leader Tom DeLay convicted of money laundering, vows appeal http://bit.ly/ietc1C","Video: President Obama Pardons a Turkey http://bit.ly/e45enu","Obama's job approval sinks to 39% http://lat.ms/fsrXO2","RT @travelnews TSA Administrator John Pistole refuses to halt intrusive physical checks on passengers at U.S. airports. http://bit.ly/bHbB2o","Political Fashion Update: Sarah Palin wears tank top on Fox News http://bit.ly/9B5QqD","Slimmed down Dick Cheney introduces President Bush at groundbreaking ceremony in Dallas. http://bit.ly/cq1JHm","RT @celebritygossip Bill Clinton joins cast of The Hangover 2 http://bit.ly/ccsylu","Video: Three year old girl terrorized by TSA at airport security checkpoint. http://bit.ly/d4Laea","Video: Wolf Blitzer shows off dance moves at Soul Train Awards http://bit.ly/c8nbX6","Video: President Bush kicks off book tour at Borders in Dallas. http://bit.ly/9ZxAZ3","Keith Olbermann suspended over political donations http://bit.ly/c2nqhO","Republicans are project to gain a majority in the House. http://bit.ly/8ZpWRp","U.S. alert focuses on cargo after suspicious packages found overseas http://bit.ly/b9il2r","Video: Jon Stewart explains the Juan Williams NPR firing http://bit.ly/9kjxD9","Video: Hillary Clinton speaks out to bullied children and teens. http://bit.ly/96E1NM","Bass Player becomes YouTube sensation after Meg Whitman's accidental twitter endorsement http://bit.ly/9Bgkec","WikiLeaks set to release 500,000 Iraq documents http://bit.ly/cKECfU","President Obama will be a guest on the Discovery Channel's show Mythbusters http://bit.ly/9dldhv","U.S. vows to go after recreational marijuana users if California legalizes pot on November 2nd http://bit.ly/dy4cW5","Video: Condoleezza Rice answers 10 questions for Time. http://bit.ly/b9AJEp","On Friday, President Obama is scheduled to sit down in the Oval Office with former Secretary of State Condoleezza Rice. http://bit.ly/a4ZkLe","Video: Whoopi Goldberg and Joy Behar walk off The View after fight with Bill O'Reilly http://bit.ly/ctmIH2","Since Dick Cheney shot him, Harry Whittington's aim has been to move on http://wapo.st/aKjZN3","Jesse Ventura says former Alaska governor Sarah Palin is a quitter. http://bit.ly/9ZBtnS","Video: Naomi Watts talks about playing outed ex-CIA spy Valerie Plame in new movie http://bit.ly/bXVKpZ","Book thrown at President Obama during rally. There was also a streaker at the same rally. http://bit.ly/b2q1K6","Christine O'Donnell \"I'm not a witch. I'm nothing you've heard. I'm you.\" http://bit.ly/aK89FQ","Video: Outrage over Climate Change film showing exploding schoolchildren. http://bit.ly/cwbAb7","US may issue travel warning for Americans in Europe http://bbc.in/9zrBCl (via @traveladvice)","Sir Michael Caine 'predicted 9/11 in novel' http://bbc.in/cSiCPe","First World War officially ends http://bit.ly/b4YI7O","David Axelrod will be leaving White House next year to work on president's re-election campaign http://bit.ly/9IGZBG","US Senate blocks debate on gay military policy repeal http://bbc.in/9Efz0I","Obama Economic adviser Larry Summers will resign at the end of this year.","Donald Rumsfeld's memoir will be called Known and Unknown.  http://bit.ly/bdZ6xq (via @books)","Video: Lady Gaga speaks at rally to repeal Don't Ask Don't Tell http://bit.ly/bHRTiB","White House official denies Tea Party-focused ad campaign http://bit.ly/9uNgAv","Christine O'Donnell: 'I Dabbled Into Witchcraft' http://bit.ly/anqrO9","Photo: Kayaker-in-Chief - President Obama kayaks while spending time with friends at a beach in Edgartown http://bit.ly/dCKRHA","CBS News/New York Times Poll: Obama's approval rating 45% http://bit.ly/aHOd7r","White House says Michelle Obama never described her role in the White House as \"hell.\" http://bit.ly/bBaR70","President Obama writes children's book - the book, Of Thee I Sing, will be illustrated by Loren Long. http://bit.ly/ctqfqF (via @books)","Tea Party favorite Christine O'Donnell defeats Mike Castle for the Republican Senate nomination in Delaware Tuesday http://fxn.ws/dcnEDh","Senate Majority Leader Harry Reid responds to Lady Gaga about the repeal of Don't Ask Don't Tell http://bit.ly/cWhn6q","White House renovation will cost $376 million and take four years. http://bit.ly/cDd5Gj","Arnold Schwarzenegger can't see Russia from plane over Anchorage http://bit.ly/aDwlhb","RT @books Simon & Schuster to publish Bob Woodward's book Obama's War on September 27 http://bit.ly/c55P4I","Florida minister cancels planned burning of Qurans on 9/11 http://yhoo.it/apVDYZ","White House names Asian carp czar. http://bit.ly/9OHliX","Kelsey Grammer becomes public face of new right-wing U.S. tv network http://bit.ly/b1GJVK (via @celebritygossip)","Condoleeza Rice says she hung up on George Bush in the aftermath of 9/11. http://bit.ly/cwPUsX","Obama to call for $50 billion spending on Public Works http://nyti.ms/dlUtqE","Obama's new Oval office rug historically inaccurate, MLK Quote actually said by somebody else http://bit.ly/bTdMj0","Obama Rug Fail: Oval Office rug gets history wrong http://bit.ly/d6ovQp","The Oval Office gets a makeover http://bit.ly/dg9gie","Obama hails end to US combat operations in Iraq http://bbc.in/c4SGfz","RT @newsalert Afghanistan bomb attacks kill twenty-one US soldiers in 48 hours http://bit.ly/9Lx1y2","Scott Brown shrugs off Palin attack. http://bit.ly/diIDkR","Glenn Beck holds rally on anniversary of King's I Have a Dream Speech http://bit.ly/cut2jB","Iran unveils unmanned bomber, Ahmadinejad calls it 'Ambassador Of Death' http://huff.to/9Ar1fX","Kids get to play president and make decisions at interactive Ronald Reagan Presidential Library http://bit.ly/cGRyk6","Australian election \"too close to call.\" http://bit.ly/bmfuRY","Trailer for Fair Game, which tells the true story of outed CIA operative Valerie Plame. Stars Naomi Watts and Sean Penn http://bit.ly/a7Tam3","Fifteen Palinisms from new book of Palinisms http://huff.to/aE1HJO","RT @epeep AAARRR :D ! the Oregon Pirate Party has filed paperwork to become an official political party in oregon http://bit.ly/dvJFUz","Blagojevich guilty on one count of 24 - lying to an FBI agent. http://bit.ly/bxXg7i","EA's Medal of Honor under fire for letting players be the Taliban http://bit.ly/as4L91 (via @gamersgame)","Harry Reid thinks Ground Zero NY mosque \"should be built someplace else.\" http://bit.ly/b3d3e1","Controversy swells as Obama supports Ground Zero mosque http://yhoo.it/9PQn3W","President Obama and daughter Sasha go for a swim http://bit.ly/dqDz84","Will Obama go swimming in the Gulf of Mexico? http://bit.ly/9pwVFu","South Carolina Democrat Alvin Greene charged today with showing pornography to a college student. http://bit.ly/cojjyb","Jennifer Aniston responds to Bill O'Reilly's accusation she's destroying American society. http://bit.ly/bQLsZ4","Ben Quayle (son of Dan Quayle) wants to knock the Hell out of Washington D.C. http://bit.ly/a700yz","Storm topples White House fence http://bit.ly/cLbuxu","Press Secretary Gibbs not leaving job over remarks on liberals - Gibbs said \"professional left\" should be drug tested http://yhoo.it/9Ehh9","RT @celebritygossip Variety says Levi Johnston will run for mayor of Wasilla, Alaska -reality show will follow campaign http://bit.ly/bCHc7M","11 books predicting the collapse of the U.S. middle class http://huff.to/drWfVV","President Barack Obama may ease travel restrictions to Cuba http://bit.ly/dciEvo","New Orleans Saints visit the White House http://bit.ly/9bR0VU","Michelle Obama meets the King and Queen of Spain http://bit.ly/clt3rp","John Boehner jumps on the repeal-the-14th-Amendment bandwagon http://bit.ly/a7XQew","Spanish police close public beach for Michelle Obama's £250,000 Spanish holiday http://bit.ly/aBkae2","Video: Hillary and Bill Clinton arrive at Chelsea's rehearsal dinner http://bit.ly/cJYp1t","Casualties in Afghanistan continue to climb http://bit.ly/duASKm","July the deadliest month of Afghan war for US http://yhoo.it/cRJKEA","Video: Barack Obama talks Lindsay, Snooki, the Bieber on The View http://bit.ly/altEoS","Obama flip-flops on whether or not he knows Snooki http://bit.ly/cKbVtJ","Dr. Jill Biden to guest star on Army Wives http://bit.ly/bsDziF","WikiLeaks 'Afghan War Diary' provides ground-level account of Afghanistan War http://huff.to/9uKEAa","A Russian milestone: 1st black elected to office http://yhoo.it/c0Yc0E","11% of Americans say they have a great deal or quite a lot of confidence in Congress. http://bit.ly/cDzzt7","National Enquirer says two more massage therapists claim they were abused by former VP Al Gore http://bit.ly/a1qjeW","BP photoshops photo of crisis command center http://bit.ly/b4vrNF","Glenn Beck says he could go blind in a year http://yhoo.it/cag0Da","Clinton on key Afghan mission as US war fears grow http://yhoo.it/9iKjkc","Andrew Sorkin writing screenplay for John Edwards movie http://bit.ly/9eHzip","RT @newsalert Five US soldiers killed in two separate attacks in Afghanistan - 12 Nato troops killed in 24 hours. http://bit.ly/9LWoY0","Knopf to publish Supreme Court Justice Sonia Sotomayor's memoir. http://bit.ly/9OkklT (via @books)","Zondervan publishing Sarah Palin biography for children. http://bit.ly/bTFvoi","Judge cuts fees by 90% in RIAA download case  - Obama admin wanted college kid to pay $675,000 for downloading 30 songs http://bit.ly/aSUdIl","Hallmark CEO concerned Postal Service's plans to increase rates & eliminate Saturday mail could lead to 3-day delivery http://bit.ly/bc9VML","RT @internet NSA denies it plans to spy on US public and private networks http://bit.ly/azCxaG","Voters over 50 are leaning increasingly Republican, according to recent polling. http://bit.ly/9UTE3J","White House Fourth of July Photo: President and First Lady watch fireworks over National Mall http://bit.ly/cxbAUd","Republican National Committee chairman Michael Steele says Afghanistan is \"a war of Obama's choosing\" http://yhoo.it/ckLt0I","Crucial Confirmation Question: Is Elena Kagan Team Edward or Team Jacob? http://bit.ly/a21kss","Bill Clinton says Blow up the Oil Well http://bit.ly/cJFJnw","Sen. Robert Byrd, longest-serving member of Congress, has died at 92 http://bit.ly/anhMDg","Australia has first woman PM as Julia Gillard replaces Rudd http://bit.ly/adIqEV","RT @celebritygossip National Enquirer says Al Gore accused of sexually attacking a masseuse in Portland, Oregon http://bit.ly/ciEa7D","President Obama tells fly at press conference to \"Get Out of Here\" http://bit.ly/abimJG","Federal judge overturns government ban on deep water drilling in Gulf of Mexico http://bit.ly/c83dWg","Telegraph says Rahm Emanuel expected to quit White House http://bit.ly/dCV7nH White House says report 'Ludicrous' http://bit.ly/dikz0i","Joe Lieberman's bill would give President Obama an Internet Kill Switch http://bit.ly/di3yaz","Discover of massive Afghanistan lithium deposit could alter nation's economy http://bit.ly/c5Sqp7","Saudi Arabia gives Israel clear skies to attack Iranian nuclear sites http://bit.ly/af2sSl","President Obama to write forward for Nelson Mandela's upcoming book, Conversations with Myself http://bit.ly/dox6Ti","Keith Olbermann interviewed Alvin Greene, the mysterious winner of the South Carolina Democratic Senate primary http://bit.ly/aFe2Dq","Hugo Chavez sings song about Hillary Clinton http://bit.ly/aGngOd","Carly Fiorina dishes about Barbara Boxer's hair in open-mike gaffe http://yhoo.it/dydvlk","Helen Thomas retires http://politi.co/cQdsSC","U.S. Secretary of State Hillary Clinton predicts Iran will pull a \"stunt\" within the next few days. http://yhoo.it/cg79ou","Meet Ilham Anas, an Indonesian President Obama Impersonator http://bit.ly/b3mdkq","Report: Elton John paid $1 million to play at Rush Limbaugh's wedding tonight at the Breakers http://bit.ly/bLjk8c (via @celebritygossip)","RT @gourmet: Michelle Obama addressed hundreds of Chefs at the White House yesterday to launch the Chefs Move to Schools program. http:/ ...","Sarah Palin blames environmentalists for Gulf oil disaster http://huff.to/9NFVd4","Pregnant women in northern Italy are to be offered $5,500 not to have abortions. http://bit.ly/aQshMK","Al and Tipper Gore to separate after 40 years of marriage. http://politi.co/ahnsXp","Israeli PM Benjamin Netanyahu regrets deaths as troops storm aid ships http://bit.ly/bMb1v6","Senior White House official says BP oil spill is the worst environmental disaster the US has faced http://bit.ly/aA3xs2","Video: BP accused of faking cleanup for President Obama's Photo Op http://bit.ly/94tUgz","Sarah Palin builds fence to keep out book writing neighbor http://bit.ly/bjObEQ","Yemeni cleric advocates killing US civilians http://yhoo.it/bJunZQ","The White House has a mole http://bit.ly/doR0D3","Senior House Democrat says senators should fully question Elena Kagan to make sure she supports abortion rights. http://yhoo.it/duVDsT","First Dog Bo disclosed as $1,600 gift on President's financial disclosure form http://bit.ly/b63Hkk","President Obama and his smokin' little body go out for Duff's Famous Chicken Wings http://bit.ly/a24t8x","Sarah Palin thinks \"mama grizzles\" will punish Washington in November's midterm elections. http://bit.ly/bry84L","Obama vows end to ‘Cozy’ oversight of oil industry http://nyti.ms/aBZv0g","Laura Bush: Gay couples should have same rights as everyone else, abortion should remain legal. http://bit.ly/aQ6ifs","Kagan in ’97 urged Clinton to ban late abortions http://bit.ly/9IbltT","Sarah Palin: U.S. Law should be 'based on the God of the Bible and the Ten Commandments' http://huff.to/bq6ePN","SNL Skit: Times Square bomber gives a press conference http://bit.ly/a5H1Pg","President Obama says he doesn't know how to use iPods and iPads and Xboxes and PlayStations http://bit.ly/aWmnx3","South Africa police hope USA loses in first round of World Cup so Obama won't come - due to security headache http://bit.ly/bu2fNe","A book by Bob Woodward about the Obama administration will arrive in bookstores in September. http://bit.ly/bwmlyh","Sam the Official: Samuel Wurzelbacher aka \"Joe the Plumber,\" is now an elected official in Ohio's Lucas County. http://bit.ly/9tIbbJ","Palin on oil spill: We must continue to drill, baby, drill http://bit.ly/bsbDTl","U.S. Rep. Gene Taylor expects expects spill to break up naturally - says oil patches look like chocolate milk http://bit.ly/9HdzzO","President Obama: BP will pay Oil Spill Bill http://bit.ly/d26b78","Obama lands on Gulf Coast to view oil slick http://bit.ly/cAEqzA","Video: President Obama zings Jay Leno at White House Correspondents Dinner  http://bit.ly/aLEbBZ","Gulf of Mexico oil spill: Once again, US military gets the call http://bit.ly/9TmzQx","President Obama said SWAT teams were being dispatched to the Gulf to investigate oil rigs  http://bit.ly/9268fo","Laura Bush book suggests she and George W. Bush were possibly poisoned at German summit: http://bit.ly/cGb4HW","Creepy Obama action figure http://bit.ly/dBksKn","President Obama said SWAT teams were being dispatched to the Gulf to investigate oil rigs  http://bit.ly/9268fo","Laura Bush book suggests she and George W. Bush were possibly poisoned at German summit: http://bit.ly/cGb4HW","Creepy Obama action figure http://bit.ly/dBksKn","George W. Bush's memoir, Decision Points, to be released November 9th. National book tour planned. http://bit.ly/c8CFdi","VP Joe Biden sees the economy creating between 250,000 and 500,000 new jobs within the next couple months. http://bit.ly/c9byb5","Sarah Palin e-mail hack trial starts today http://bit.ly/aHyMwN","Senator Schumer vows to stop airlines from charging for carry on luggage - Spirit wants to charge $45 per carry on bag http://bit.ly/bn2lQn","SNL Video: Tina Fey plays Sarah Palin launching own TV Network  http://bit.ly/aHxL2O","Obama has plans for Asian-American judge Goodwin Liu, and GOP isn't happy http://bit.ly/bSW4Z5","President Barack Obama reads Green Eggs and Ham  http://bit.ly/cCOSji","President Obama takes on former NBA player & CBS Sports college basketball commentator Clark Kellogg in a game of POTUS http://bit.ly/c0cEKS","President Obama's first pitch - very high and very outside http://bit.ly/cceiuC","2010 White House Easter Egg Roll will be livestreamed on WhiteHouse.gov on Monday. http://bit.ly/abQYMv","Supreme Court Justice John Paul Stevens says he \"will surely\" retire while President Obama is still in office http://bit.ly/cFYR5i","Fox News called LL Cool J and Toby Keith \"guests\" on new Sarah Palin show, but show just uses old interview footage. http://bit.ly/bW8wwL","Drill, baby, drill. Obama to allow oil drilling off Virginia coast http://bit.ly/dgf73n","53 Glenn Beck fans get cars towed after students set up a fake \"event parking\" signs in a tow-away lot. http://bit.ly/b5LbAz","RNC spending includes $2,000 for \"meals\" at Voyeur West Hollywood, nightclub with topless dancers in bondage outfits. http://bit.ly/d2PjaJ","RT @bloggersblog Justin Bieber passes Barack Obama to become Most Listed Twitter User http://bit.ly/41tbA","AP says Republicans were for Obama's requirement that Americans get health insurance before they were against it. http://bit.ly/9bIWlc","RT @bloggersblog Justin Bieber likely to pass Barack Obama as the Most Listed Twitterer http://bit.ly/9e5Q2s","Discovery Communications buys Sarah Palin's Alaska - 8 part documentary series produced by Mark Burnett (Survivor).  http://bit.ly/axzHId","CNN's Jeanne Moos talks Joe Biden's health bill F-Bomb  http://bit.ly/aRovDh","Poll: 24 percent of Republicans (14 percent overall) say that Obama \"may be the Antichrist.\" http://bit.ly/dc7h6K","Hillary Clinton calls on Israel to make \"difficult but necessary choices\" if it wants peace agreement with Palestinians http://bit.ly/bQPzzv","President Obama told Fox News he is sure Tiger Woods is still going to be a terrific golfer. http://bit.ly/cmxg8w","CNN hires right-wing blogger Erick Erickson http://bit.ly/bwXsLI","RT @celebritygossip: John Edwards' mistress Rielle Hunter poses with children's toys, wearing only a shirt, for GQ photoshoot. http://bi ...","American al-Qaida suspect detained in Yemen, who recently tried to escape, once worked at six U.S. nuclear power plants http://bit.ly/c5UdZJ","RT @books Senator Scott Brown lands deal to publish memoirs http://bit.ly/9y8GDe","Michelle Obama raced Icelandic kids' fitness guru Sportacus in a foot race. http://bit.ly/bno56c","US administration to block vote on Turkey 'genocide' http://bit.ly/97RnjT","Want to overthrow the US government? Just fill out this 'subversive agent' form and pay a $5 fee http://bit.ly/aMdPKM","RT @jokes: President Obama caught lip-syncing speech. http://bit.ly/cylEUc","President Obama declared Fit For Duty - but advised to  continue smoking cessation efforts.  http://bit.ly/b30znR","The U.S. Patriot Act was renewed yesterday with no new civil liberties protections http://bit.ly/9cuj1g","U.S. to spend $1 billion on new Embassy in London  http://bit.ly/9EVPOh","Meg Stapleton, a senior adviser and spokeswoman for Sarah Palin, has resigned.  http://bit.ly/alQlqL","Cheney tests showed evidence of mild heart attack http://bit.ly/beQON9","Ron Paul wins Presidential Straw Poll at Conservative Political Action Conference http://bit.ly/bEq5Db","FBI concludes that Army scientist Bruce Ivins acted alone in the 2001 anthrax mailing - critics don't buy it http://bit.ly/beVHKr","Former Secretary of State Alexander Haig in critical condition in hospital (video) http://bit.ly/bXy26Z","RT @celebritygossip LMFAO's Sky Blu claims Mitt Romney started the plane altercation between the two of them. http://bit.ly/a3HDkf","A History of President Obama feigning interest in mundane things http://bit.ly/9CAZKd","Dalai Lama tosses snow at the press. Tells Press not to ask him silly questions.  http://bit.ly/c9Cwxk","Sarah Palin and Bristol Palin slam the \"heartless jerks\" at Family Guy over Down's syndrome character. http://bit.ly/axhZAE","NJ Dem  Sen. Frank Lautenberg fell at his home Monday night and was taken by ambulance to a hospital as a precaution. http://bit.ly/artggW","Mitt Romney was allegedly physically threatened by a violent passenger on an Air Canada flight leaving Vancouver http://bit.ly/cSVKZq","Joe the Plumber on John McCain: \"I don't owe him shit. He really screwed my life up, is how I look at it.\"  http://bit.ly/9sWLTZ","Sen. Evan Bayh, a centrist Democrat from Indiana, does not plan to run for re-election. http://bit.ly/bKTFII","RT @fantasysf Palestinian protesters pose as Na'vi from Avatar http://bit.ly/a5jQip","Bill Clinton undergoes stent procedure after suffering chest pains  http://bit.ly/cuYeAd","RT @newsalert Bill Clinton in New York hospital after experiencing chest pains according to ABC News via CNN http://bit.ly/aOswf0","Laughter at White House Press Briefings has fallen from 179 laughs per month to around 89 laughs per month. http://bit.ly/9wsAQS","White House Press Secretary Robert Gibbs poked fun at Sarah Palin's handwritten reminders. http://bit.ly/cwl9L6","George W. Bush \"Miss Me Yet?\" billboard in Minnesota. http://bit.ly/cLqP7Z","Democratic Rep. John Murtha of Pennsylvania died on Monday at the age of 77 http://bit.ly/8XSWBg","U.S. Government spend $2.5 million on Super Bowl ads to boost census http://bit.ly/9ph9MR","Western diplomats are pushing for new UN sanctions against Iran. http://bit.ly/91OeJQ","Republican Senator Scott Brown of Massachusetts says he supports abortion rights - disagrees with his party's position http://bit.ly/9FQscN","Rush Limbaugh danced to Lady Gaga at the Miss America pageant. http://bit.ly/aXL7J1","RT @sportsosphere The Obama administration may take action on the Bowl Championship Series in college football. http://bit.ly/9J5uCp","RT @globalwarming Osama bin Laden blasts U.S. and other industrialized countries for global warming in audiotape. http://bit.ly/cO0irE","Weatherproof is removing its Times Square billboard that shows President Obama wearing a Weatherproof jacket. http://bit.ly/bH49QG","Authorities seize grenade launcher, weapons cache from Virginia man at motel. Had map of US military base. http://bit.ly/607gyr","Chemical Ali' has been executed In Iraq http://bit.ly/6RSVDY","Sarah Palin shocks Oprah with new hairdo, says she is keeping the door open on her political future. http://bit.ly/50GM4y","Britain's terrorist threat level raised from “substantial” to “severe” http://bit.ly/631BBQ","John Edwards finally admits he is father of Frances Quinn Hunter. Heads to Haiti to look heroic. http://bit.ly/7x01nP","Newly elected Senator Scott Brown tells world his daughters are available  http://bit.ly/4FtQka","White House launches iPhone/iPod Touch App  http://bit.ly/8JFJn4","Wax Michelle Obama unveiled at Madame Tussauds  http://bit.ly/8zLyB6","GOP's Scott Brown wins Mass. Senate seat in epic upset http://bit.ly/4LxYkJ","Analyst predicts 'comfortable win' for Brown in Massachusetts http://bit.ly/6JcFe6","Former President Bill Clinton arrived in Haiti today.  He says progress is being made in the Haiti recovery effort. http://bit.ly/6M6dLY","FBI used Spanish lawmaker's photo for aged Osama bin Laden poster http://bit.ly/8Nhpop","President Obama has former Presidents Clinton and Bush establish the Clinton Bush Haiti Fund clintonbushhaitifund.org http://bit.ly/8ctGDJ","Limbaugh says he meant what he said about Obama trying to score political points off the earthquake in Haiti.  http://bit.ly/5YIate","US sending 10,000 troops to earthquake hit Haiti http://bit.ly/6PbO95","Video: Haitian ambassador slams Pat Roberton's pact with the Devil comments  http://bit.ly/91VWSa","US to take charge in Haiti - six ships, 5,500 troops on the way.  http://bit.ly/8PZjaW","Republican rakes in $1.3M in race for Kennedy Seat http://bit.ly/6s7hUC","John McCain on claims of his campaign's lax vetting of Palin: \"I wouldn't know.\" http://bit.ly/7HgT1n","Radical Yemeni cleric, Sheik Abdul-Majid al-Zindani, warns of foreign occupation by U.S. http://bit.ly/5dnzyr","Some fear abortion ruling could spur violence - suspect will be allowed to argue voluntary manslaughter in murder trial http://bit.ly/6aosMj","Former Alaska Gov. Sarah Palin signs a deal with Fox News to appear as a contributor  http://bit.ly/4yzXDR","Harry Reid apologizes for his 'no Negro dialect' comment http://bit.ly/638Yb7","Lost fans are outraged that President Obama might move the State of the Union address to February 2nd. http://bit.ly/6p5Yxz","President Obama says \"Buck stops with me\" and \"We are war against Al Qaeda.\" http://bit.ly/6XqZYD","Taliban brainwashes kids with visions of virgins - series of images released http://bit.ly/8l5tgV","Not anthrax - letters prompted 7 anthrax scares at Alabama courthouses, offices of senators and congressmen http://bit.ly/4QDeXR","Obama effigy spotted hanging from a building in Jimmy Carter's hometown in Georgia. Secret Service investigating. http://bit.ly/6JMIxy","Obama criticized for delay in public remarks about plane bombing attempt but Bush took 6 days to respond to shoe bomber http://bit.ly/4HmaKU","Karl Rove gets divorce in Texas after 24 years of marriage, said family spokeswoman Dana Perino. Rove's second divorce http://bit.ly/5Hy7qU","CNN Security Analyst Peter Bergen draws connections between August attack on Saudi prince and the Northwest plot. http://bit.ly/4FHQeI","President Obama vows to 'keep up the pressure' on the terrorists following botched attempt to blow up a U.S. airliner. http://bit.ly/5Hcnu5","Ambulance rushes Obama from golf game; he cites 'personal matter' http://bit.ly/6vaRKY","New Sarah Palin Controversy: Visorgate  http://bit.ly/7hRsS4","Insurgents in Iraq have hacked into live video feeds from unmanned American drone aircraft http://bit.ly/7RJ127","Disgraced former Democratic vice pres. nominee John Edwards is in more legal hot water. He's also gaining weight. http://bit.ly/5KmdWy","Obama Administration to restore missing Bush emails http://bit.ly/6OoPxS","Italian Premier Silvio Berlusconi was punched in the face at a rally on Sunday.  (video) http://bit.ly/4JNvaP","Blogger: US air strikes kill 'exactly 30' enemies every time http://bit.ly/5zaTGZ","Jon Stewart pokes fun at Glenn Beck's relationship with the gold industry and Goldline http://bit.ly/7bsL55","Barack Obama defends the waging of \"morally justified\" war as he collects the Nobel Peace Prize http://bit.ly/8wpQrV","Wikileaks website posts what it says are half a million text messages from 9/11 http://bit.ly/6tQUZ4","President Obama pardons the Thanksgiving Turkey - the turkey gets to go to Disneyland now. http://bit.ly/6W0gsz","Crowd gets angry when Sarah Palin stops signing books (video) - fans waited in the cold for hours for wristbands http://bit.ly/5ebLfq","President Obama's job-approval rating slips below 50% in the Gallup Tracking Poll for the first time http://bit.ly/5RZwcy","Harry Reid revives the Botax  http://bit.ly/6cdvlo","Lou Dobbs said on Thursday he is considering a possible run for the White House or U.S. Senate. http://bit.ly/3bIZ87","Fox News displays old campaign footage to claim Palin is getting ‘huge crowds’ at her book signings. http://bit.ly/2vQRgr","Video: Stephen Colbert skateboards with members of Congress  http://bit.ly/2XMu2K","Sarah Palin blasts Newsweek cover as \"sexist\" on her Facebook page. http://bit.ly/45DSbF","Most listed Twitterer President Obama http://bit.ly/41tbA says he has never actually tweeted http://bit.ly/2oRhBc","Former NYC Mayor Rudy Giuliani tells John King that putting 9/11 terror suspects on trial in NYC is unnecessary risk http://bit.ly/FlvYf","Feds seek to seize 4 mosques and a skyscraper over suspected Iran link http://bit.ly/1yvStR","CNN political reporter and State of the Union host John King gets Lou Dobbs time slot. http://bit.ly/4d2iXB","Sarah Palin's Book Tour Kicks Off November 18 - book tour will focus on small towns unlike most book tours.  http://bit.ly/3ePwQi","Huckabee leads Republican prospects in new USA Today/Gallup poll http://bit.ly/4bwoMW","Gibbs says Gitmo detainees don't have H1N1 vaccine yet but doesn't say they won't get it before U.S. citizens. http://bit.ly/3kwTvv","Barack Obama tops list of most listed Twitterers. White House is #43. NPR Politics is #93 http://bit.ly/41tbA","Gitmo detainees are getting the swine flu vaccine before many Americans.  http://bit.ly/4E45zu","Barack Obama is the most listed Twitterer. bit.ly/1wNGOQ","Levi Johnston: Sarah Palin calls down's syndrome son retarded http://bit.ly/jtDg","Michelle Obama poses with White House Interns in Glamour http://bit.ly/3sRfvG larger photo: http://j.mp/3sh2OW","Obama dissolves the US Constitution and bans guns which starts a revolution in an online game. http://bit.ly/3wI9eP *http://usofearth.com","White House declares swine flu emergency . http://bit.ly/KZ57N","Annie Leibovitz takes First Family's Official Photo - First Dog Bo misses out. http://bit.ly/1ZXP9N","Rep. Greg Walden, a Republican from Oregon, is the first member of Congress to get swine flu. http://bit.ly/2up5zM","Poll finds fewer than half of Americans agree with the president on issues important to them http://bit.ly/4AJIUS","Obama administration to order pay cuts for top US executives at big bailout companies http://bit.ly/NMkI2","First Lady Michelle Obama hula hoops - managed 142 swivels of the hula hoop before she lost control. http://bit.ly/1N2ATw","House next to President Obama's home in Chicago up for sale. Real estate agent thinks it will fetch an \"Obama premium\" http://bit.ly/fPIq9","CNN poll finds 52% of Americans think that the war in Afghanistan is turning into another Vietnam. http://bit.ly/3Jzv4M","David Axelrod said Sunday that much of the programming on the Fox News Channel is \"not really news.\" http://bit.ly/qK40j","Kraft finds success in Russia selling Communist Hero Cookies. http://bit.ly/2swM0Z","Senator John Kerry says U.S. should wait until the Afghanistan election has been decided before sending more troops  http://bit.ly/zRkoH","The Maldives' cabinet held an underwater meeting today to raise awareness about global warming. http://bit.ly/1LLWlj","Rasmussen poll finds Huckabee out in front: GOP 2012: Huckabee 29% Romney 24% Palin 18% http://bit.ly/415gNu","Obama keeps winning things - President Obama Rolling Stone cover wins \"Cover of the Year\" http://bit.ly/11HCp6","Jailbreak Toys launches Michelle Obama doll that comes with 3 different outfits the First Lady has worn http://bit.ly/1dU9GS (corrected url)","The U.S. military in Afghanistan bans pictures of troops killed in the war. http://bit.ly/1YHk2G","Señor Obama salsas one-on-one with Thalia. First Lady ignores him when he returns to his seat. http://bit.ly/18ChGI","Many puzzled by U.S. President Barack Obama's Nobel Peace Prize win. http://bit.ly/67QtP","Obama is gathering his national security team for another Afghanistan strategy session 8 years after the war began http://bit.ly/3w2pDi","100s of insurgents involved in complex attack on remote outposts that killed 8 troops and 20 Afghan security troops http://bit.ly/16BGP5","Former Secretary of State Madeleine Albright explains her pin collection to Katie Couric. http://bit.ly/18zdD8","An Afghan policeman on patrol with U.S. soldiers opened fire and killed two soldiers before fleeing. http://bit.ly/HQuAE","Todd Palin has quit his oil field job on the North Slope http://bit.ly/q4yq3","Rio de Janeiro wins 2016 Olympics vote - Chicago dropped in first round despite push by Obama and Oprah. http://bit.ly/14Mllz","The United States will withdraw about 4,000 troops from Iraq by the end of October leaving 120,000 troops remaining. http://bit.ly/1MfSRb","The Appellate Division of the New York State Supreme Court has dismissed Dan Rather's claims against CBS. http://bit.ly/Z1r2p","Photo: President Obama takes a Jump Shot  http://bit.ly/3qD8W0","Sarah Palin's book will hit stores Nov 17th. The book will be called Going Rogue: An American Life. http://bit.ly/Fauw8","President Obama to travel to Denmark to make an in-person pitch for Chicago's bid to host the 2016 Summer Olympics. http://bit.ly/QXlmq","The Secret Service is investigating a Facebook poll that asked, \"Should Obama be killed?\" http://bit.ly/ceoob","Attorney says the OKC bombing tapes appear to have been edited http://bit.ly/39xufA","Birthers now have a late-night infomercial http://bit.ly/15kP5j","Justice Ruth Bader Ginsburg was taken to the Washington Hospital Center this evening - statement from Supreme Court: http://bit.ly/OxAOH","Video: Tom DeLay dances the Cha Cha Cha to \"Wild Thing\" http://bit.ly/2q4umq","Top Ten Reasons President Obama appeared on the Letterman Show  http://bit.ly/10ZkSQ","President Obama says he would be \"happy to look at\" a newspaper bailout bill. http://bit.ly/EXY6W","U.S. general calls for more troops in Afghanistan - says more troops needed in next year otherwise war will likely fail. http://bit.ly/uOFzd","New York Governor Paterson says he's still running in spite of reports that claim Obama asked him to drop out. http://bit.ly/13FOTM","Ten things we learned about George W. Bush from his ex-speechwriter http://bit.ly/w7gEh","Republican lawmakers are upset because President Obama is snubbing Fox News. http://bit.ly/1qTwj1","Video clip of President Obama calling Kanye West a jackass for his behavior at the VMAs. http://bit.ly/l0vz5","More Patriot Act says Obama: Obama administration supports extending three Patriot Act provisions expiring this year http://bit.ly/aZHj0","ABC News says it was wrong for its employees to tweet that President Obama called Kanye West a \"jackass\" http://bit.ly/YHdMt","Former House Majority Leader Tom Delay @TomDelay tweeted that he injured himself during DWTS rehearsals. http://bit.ly/1D6BaU","TMZ has posted audio of President Obama calling Kanye West a jackass. http://bit.ly/8I1Re","Several mortars or rockets were fired into the Green Zone in Baghdad during Joe Biden's visit. http://bit.ly/2nZE1l","George W. Bush was critical of Sarah Palin says former speechwriter Matt Latimer in book. http://bit.ly/T6xSo","ABC reporter Terry Moran tweeted last night that President Obama called Kanye West a Jackass - tweet was later removed http://bit.ly/18CPe0","Rep. Joe Wilson says he won't apologize again for yelling President Obama lied during the president's speech last week http://bit.ly/21bqT","Patriotic 9/11 cake disasters including a Twin Towers cupcake cake and a \"Never Foget\" typo cake. http://bit.ly/MltI","Rep. Joe Wilson apologized for yelling \"You Lie!\" at President Obama during his healthcare speech. http://bit.ly/YeF4l","President Obama blasts Xbox use in speech to students - told students not to spend every waking hour \"with that Xbox\" http://bit.ly/3PSUOQ","Obama is asking Congress to raise the debt ceiling. http://bit.ly/3lVWv","Van Jones, President Obama's Special Advisor for Green Jobs, resigns, claims \"vicious smear campaign\" http://bit.ly/e9Fx8","White House officials say a government health insurance option is negotiable http://bit.ly/NKLoy","Dinner for five with Sarah Palin being auctioned on eBay. Bidding starts at $25,000. http://bit.ly/119aOD","Esquire investigates whether H1N1's potentially huge death toll (30,000 to 90,000 young ppl) could be  Obama's Katrina http://j.mp/iHoqS","President Obama says swine flu vaccine will be voluntary but the government will \"strongly recommend\" people get it. http://bit.ly/izp3J","George W. Bush's daughter Jenna Bush Hager to become a special correspondent to NBC's Today Show. http://bit.ly/Xtpf6","Alarming bill would give president emergency control of the Internet. http://bit.ly/a2Z4r","Kansas congresswoman says her remark about fellow Republicans seeking a \"great white hope\" was not about Obama  http://bit.ly/1oWJ0J","Mystery: Who asked Flickr to delete the Obama Joker image? It wasn't Time or DC Comics. http://bit.ly/2fpJPI","South Carolina Gov. Mark Sanford won't be \"railroaded\" out of office and plans to finish his term. http://bit.ly/CywF5","RIP: Senator Edward Kennedy, 77, dies http://bit.ly/2Ea2gl","Guardian claims Barack Obama is on the brink of deal for Middle East peace talks. http://bit.ly/r30PA","The release date for the new Ted Kennedy memoir, True Compass, has been moved up to September 14 http://bit.ly/KlUG5","President Obama's reading list for his Martha's Vineyard trip. http://bit.ly/qL6Zm","White House advisers say H1N1 swine flu could kill 90,000 people this year and hospitalize 1.8 million. http://bit.ly/19YGmB","Washington Post op-ed frowns on Obama administration's enthusiasm for high-speed rail http://bit.ly/YPEtu","Dick Cheney has Russian Matrushka dolls of himself, Bush Sr., and Colin Powell on display in his home http://bit.ly/JXPUi","L.A. Times analyzes conservatives verse liberals on Twitter. http://bit.ly/HVN9L","Elizabeth Edwards opens Red Window furniture store in North Carolina http://bit.ly/9o0Ft","Obama Family headed to Martha's Vineyard - some criticizing president for rental price tag of $35-$50k a week.  http://bit.ly/18MFf2","President Obama calls the elaborate Libyan homecoming for the freed Lockerbie bomber \"highly objectionable.\" http://bit.ly/aXGG7","Tom Ridge says he was pushed to raise the security alert on the eve of President Bush's re-election. http://bit.ly/aZQ2o","Sen. Kennedy asks Massachusetts leaders to change state law to allow a speedy replacement process. http://bit.ly/6MmJw","President Obama's job approval rating is at 51% according to Gallup. http://bit.ly/lS4ZF","White House spokesman Robert Gibbs insists the Obama administration is not backing off a public option. http://bit.ly/kyq8","As advertisers abandon Glen Beck, will Fox pull his plug? List of sponsors pulling plug is growing. http://bit.ly/15n6jm","CNN says Sarah Palin's Twitter account is now @SarahPalinUSA http://bit.ly/17Lhdr","Huge advertisers, such as Geico and P&G, pull spots from Glenn Beck's Fox News show http://bit.ly/6cHmy","John Edwards may be close to admitting he is the father of Rielle Hunter's child. http://bit.ly/sjqmx","Jon Huntsman (R) resigns as Utah governor to become U.S. ambassador to China. http://bit.ly/19REti","Rod Blagojevich now an Elvis Impersonator?  http://bit.ly/bKGTw","Russian Prime Minister Vladimir Putin put on quite the macho show of athleticism for the cameras this week. http://bit.ly/x1HSP","GOP Sen. John McCain plans to vote against Sotomayor for Supreme Court  http://bit.ly/3N6B67","Vladimir Putin dives to bottom of deep lake in Siberia in mini-submarine. http://bit.ly/93sed","Sarah Palin Facebook statement by spokesperson Meg Stapleton says divorce rumor false. http://bit.ly/bDjNv","AlaskaReport saus that Todd Palin and former Alaska governor Sarah Palin are to divorce.  http://bit.ly/8e5eK","Sarah Palin's tweet silence is driving her fans crazy. http://bit.ly/HDqx2","Beer Summit takes place at White House, Joe Biden goes too  http://bit.ly/133NO4","Obama Blows It: No American Beers served at Beer Summit http://bit.ly/Ne0MJ","William Shatner reads Sarah Palin's farewell speech as a poem. http://bit.ly/BK1iH","70 coalition troop deaths so far in July this month in Afghanistan - highest monthly total since war began. http://bit.ly/Te90X","Fox News poll finds best job for Sarah Palin is homemaker. http://bit.ly/jhYJe","Mommy Tuck Tax: Senate Finance Committee discusses 10% excise tax on cosmetic surgery. http://bit.ly/7C8wC","Republican Kentucky Sen. Jim Bunning has announced he will not seek re-election. http://bit.ly/OXDNJ","House Speaker Nancy Pelosi doesn't care that she is unpopular. “No, I don’t care,” Pelosi says. http://bit.ly/a8zbC","French President Nicolas Sarkozy's collapsed while jogging Sunday - he is recovering at a military hospital (ap video) http://bit.ly/HzHcL","President Obama says he should have chosen his words more carefully when he said police \"acted stupidly\" http://bit.ly/w4GxF","Cambridge police commissioner says department is \"deeply pained\" by Obama's statement that  officers \"acted stupidly\" http://bit.ly/ce7Wg","President Barack Obama says police acted \"stupidly\" in the arrest of prominent black scholar Henry Louis Gates Jr.  http://bit.ly/9N3HO","Bono feels bad for dodging a President Bush hug attempt in 2006. http://bit.ly/moBtN","Lady Gaga's hit song \"Just Dance\" made into fairly awful sounding political song called \"Just Tax\" http://bit.ly/KRLaz","Hilary Clinton is concerned about military cooperation between North Korea and Myanmar http://bit.ly/sYwxJ","President Obama defends wearing \"mom jeans\" to the All-Star game. http://bit.ly/Xbt4e","Cherie Blair, the wife of former British Prime Minister Tony Blair is recovering from the H1N1 swine flu virus. http://bit.ly/xGJ2W","An escort who was hired by Eliot Spitzer claims to have worked with another married governor. http://bit.ly/2RCb4","The Taliban has released a video of an American soldier who went missing in June.  http://bit.ly/wuQ16","Sarah Palin is promising to fire off some \"less PC\" tweets once she resigns as Alaska Governor.  http://bit.ly/QOVOr","The estranged wife of former U.S. Rep. Chip Pickering claims in a lawsuit that the Mississippi Republican had an affair http://bit.ly/igFCs","President Obama criticized for wearing \"mom jeans\" at the All-Star game. http://bit.ly/BhqWC","Meghan McCain: \"Joe the Plumber -- you can quote me -- is a dumbass. He should stick to plumbing.\" http://bit.ly/1pyjRJ","President Obama throws out first pitch at All-Star game. http://bit.ly/2Fpv0k","Levi Johnston says that fame went to Sarah Palin's head. http://bit.ly/7PErl","Sarah Palin says she plans to jump back into national politics after she leaves office. http://bit.ly/PyEsH","Investigative journalist Peter Lance talks about why no one was blamed or fired in the aftermath of 9/11 http://bit.ly/s1Jm2","Article says the Bush administration authorized secret surveillance activities that still have not been made public. http://bit.ly/xtC4r","Video clears President Obama of girl watching at G-8 summit. Sarkozy not cleared. http://bit.ly/feNqi","Levi Johnston says Sarah Palin is resigning early as Alaska governor because of concerns over money. http://bit.ly/MnDkG","The White House garden has harvested the first honey made by the official White House bees. http://bit.ly/YUmFA","Alec Baldwin told Playboy magazine that he is seriously considering running for Congress.  http://bit.ly/9OYuB","Fox News contributor Liz Trotta skewers Sarah Palin. Calls Palin \"inarticulate and undereducated.\" http://bit.ly/uZRNL","Al Sharpton claims that Michael Jackson helped make Barack Obama president. http://bit.ly/v3cg6","Sarah Palin says politically speaking, \"if I die, I die. So be it.\" http://bit.ly/8eMM0","The book Patrick Fitzgerald doesn't want you to read. http://bit.ly/GODKy","7 more American troops have been killed in Afghanistan where a major U.S. offensive is underway. http://bit.ly/q4nUV","RT: @newsalert Russia to allow 4,500 US military flights into its airspace to supply Afghanistan http://bit.ly/7TjN5","Pres.Obama loves the pie made by WH Pastry Chef Bill Yosses but dislikes the Shine Police that constantly powder him http://bit.ly/VdbGv","Sarah Palin says she is expressing gratitude and smacking down lies simultaneously with her Happy July 4th letter. http://bit.ly/ynEUs","Hot Air has a poll on whether Sarah Palin can still continue in national politics - most there seem to think she can. http://bit.ly/9NKmL","Paul Begala: Palin's announcement had \"all the depth and gravitas of a 13-year-old's review of the Jonas Brothers' album\" http://is.gd/1nvuj","Alaskan Lt. Gov. Sean Parnell says Sarah Palin is Alaska's \"greatest gift\" to the United States. http://bit.ly/5vyqw","Video:Sarah Palin says she is resigning so Alaskans won't be stuck with a lame duck governor. http://bit.ly/bhxN1","Update: Sarah Palin's resignation before end of her term is shocking. Hard to run for Pres after bailing out on ur state http://bit.ly/cwCeE","Sarah Palin has resigned. It's a big surprise because she was expected to finish her term and resign next year. http://bit.ly/cwCeE","RT @newsalert MSNBC Breaking News: Sarah Palin to resign as Alaska governor, NBC affiliate KTUU reports http://www.msnbc.msn.com","Alask Gov Sarah Palin reportedly violated \"flag code\" in Runner's World photo shoot. http://bit.ly/F0qVP","Sarah Palin has a feature in Runner's World: article http://bit.ly/16LDQA photo shoot: http://bit.ly/p5Sbi","Disgraced politician John Edwards is about to get hit with a tell all book by his former aide, Andrew Young.  http://bit.ly/18ykoF","Republican Norm Coleman has conceded to Democrat Al Franken in Minnesota's Senate race http://bit.ly/SLv13","The U.S. military says four U.S. soldiers were killed in combat in Baghdad on Monday. http://bit.ly/iZLzZ","Supreme Court has refused to allow victims of the Sept. 11 attacks to pursue lawsuits against Saudi Arabia  http://bit.ly/LB0rw","John Edwards aide says there is a sex tape of Rielle Hunter \"getting political\" with John Edwards. http://bit.ly/SdKyW","Joe the Plumber suggests hanging U.S. Senator - he wants to know why Senator Chris Dodd hasn't been \"strung up\" yet. http://bit.ly/92W5e","Poppy fields to stay: White House gives up on efforts to eradicate Afghanistan's opium. http://bit.ly/nd0v0","Obama administration has decided to give Somali government groups guns and training http://bit.ly/bqOYw","$550 billion defense bill draws veto threat from President Obama - bill contains $ for fighter jets he doesn't want. http://bit.ly/28eBW","RT: @books Dick Cheney to write memoir for Simon & Schuster. Reportedly paid about $2 million. http://bit.ly/7si6D","Governor Mark Sanford: The affair started \"innocently...as these things often do.\" http://bit.ly/Px8V7","Gov. Mark Sanford admitted Wednesday that he secretly flew to Argentina to visit woman he'd been having an affair with http://bit.ly/16rB7B","South Carolina Governor resurfaces after a mystery trip to Argentina http://bit.ly/dLBXo","President Obama warns that the economy will get worse and unemployment will climb over 10%. http://bit.ly/ATqJq","JibJab's Barack Obama superhero short  animation. http://bit.ly/zrOyJ","John Hodgman proclaims Obama the First Nerd President  http://bit.ly/fQnYA","Tony Hawk skateboards in the White House  http://bit.ly/Uj8Cc","President Barack Obama's job approval rating fell to 58% in Gallup Poll Daily tracking from June 16-18 -- a new low  http://bit.ly/hgzcN","Disney World's Hall of Presidents to unveil animatronic Obama on July 4th  http://bit.ly/U3jHY","John Edwards - who has been out of the spotlight since his affair - says he is \"working quietly\" against poverty. http://is.gd/15CJ0","Some say Obama's decision to grant some benefits to same-sex partners of federal employees is \"too little, too late\" http://bit.ly/4Cjei5","Affair: Sen. John Ensign (R) Nevada admitted Tuesday he had extramarital affair with former member of his campaign staff http://bit.ly/cf0ov","Obama administration blocks list of visitor to the White House - Bush administration also blocked visitor list. http://bit.ly/K5RhP","President Obama says iranian voters should be heard but diplomacy with iran should continue. http://bit.ly/14BV30","The Barock is a real river rock with Barack Obama's face on it. http://bit.ly/16EEvg","Eliot Spitzer doesn't see a comeback in his future. \"My obituary's written,\" he says. http://bit.ly/19G9kp","President Obama writes girl a note for missing school. http://bit.ly/117R2y","Laura Bush on Sotomayor: \"I think she sounds like a winner and a good nominee\" http://bit.ly/sCsUX","Food Safety: US food taster checked President Obama's food before it was served at French restaurant Sunday. bit.ly/jiWXc","Hillary Clinton says President Obama \"absolutely\" able to handle a 3am phone call. http://bit.ly/euxPG","Study: people who squirm at the sight of bugs or are grossed out by blood are more likely to be conservatives. http://bit.ly/RtRjg","Sarah Palin choses co-writer for memoirs: Lynn Vincent who writes for conservative Christian publication, World magazine http://bit.ly/sCTKo","Gift of bling for President Obama - receives ornate gold necklace from King Abdullah. http://bit.ly/VkYvc","President Obama tours the Pyramids after speech at University of Cairo. http://bit.ly/23YkIl","Gay groups grow impatient with Barack Obama http://bit.ly/L7GC3","President Obama receives a Chia Obama as a gift. http://bit.ly/sWAki","Australia's last World War One soldier dies at age of 110. http://bit.ly/dAZsF","Pat Tillman's mother says Lt. Gen. Stanley McChrystal is lying about her son's death. http://bit.ly/TUAHX","Al-Qaeda deputy leader Ayman al-Zawahiri  says Obama's \"bloody messages\" won't be concealed by \"polished words.\" http://bit.ly/TWDWd","Nancy Reagan assists Barack Obama in signing Ronald Reagan Centennial Commission Act. http://bit.ly/5MgHS","Former Vice President Dick Cheney comes out in support of gay marriage. http://bit.ly/GNUAp","Taxpayers footing the bill for Congressional personal expenses - including expensive cars, tvs and cameras. http://bit.ly/JiR2O","President Obama learns of the existence of the National Geospatial Intelligence Agency at burger joint. http://bit.ly/fofG7","Prince Harry visited Ground Zero in NYC during his US visit. http://bit.ly/THRJV","Sarah Palin tweets that she will appear on Colbert Report. Reveals show's secret location in her tweet. http://bit.ly/AKCRV","RT: @birdflu U.S. official in Normandy to prepare President Obama's upcoming visit has been hospitalized with swine flu http://bit.ly/plqSE","A reporter for a small newspaper was forcibly removed from a press area near Air Force One. http://bit.ly/qDByi","Secretary of State Hillary Clinton met with Iranian-American journalist Roxana Saberi today.  http://bit.ly/y6VLk","Tucker Carlson plans to launch news website to serve as a right-leaning alternative to the Huffington Post. http://is.gd/Hx5b","Obama to name Sotomayor as Supreme Court pick http://bit.ly/MT9dP","Conservative radio host gets waterboarded and lasts 7% before saying it is \"absolutely torture.\" http://bit.ly/16sikU","George Bush says \"it's a liberating feeling\" to be out of the White House. http://bit.ly/DoF5v","Jon Stewart explains the British Parliament Expense Scandal. http://bit.ly/CAxKc","Photos of former President George and Laura Bush's home in Dallas, Texas. http://bit.ly/nUi8z","Dick Cheney's approval rating soars 8% - A poll found 37% now have a favorable opinion of the former VP. http://bit.ly/12bF3Q","Iraq War related coalition soldier deaths appear to be creeping up again. http://icasualties.org/Iraq/index.aspx","Gallup poll of Republicans: 7% find polygamy morally acceptable and 6% find affairs morally acceptable. Poll results: http://bit.ly/gVgbk","US Defense Secretary Robert Gates on Wednesday confirmed that Iran appears to have conducted a successful missile test. http://bit.ly/YFfxV","Federal Election Commission dismisses complaint about the $180,000 in designer clothes the RNC bought for Sarah Palin. http://bit.ly/18aFhJ","Bush-Cheney 2012? http://bit.ly/7RvDN","Cute Photo: President Obama meets staffer's son  http://bit.ly/nkAmh","Harry Reid says Sen. Kennedy’s brain cancer is in remission and he is expected back in the Senate in June. http://bit.ly/yjcGi","Donald Rumsfeld's secret war memos to President Bush mixed war images with inspirational Bible quotes. http://bit.ly/zB5fB","Former GOP presidential candidate Alan Keyes arrested at Notre Dame during protest of Obama's commencement speech. http://bit.ly/166HtK","President Obama wears Chicago White Sox jacket and jean as he cheers his daughters on at their soccer games http://bit.ly/GRzd9 (url fixed)","Notre Dame president getting criticism from Catholic leaders, students and alumni for inviting President Obama. http://is.gd/AcGx","Speaker Pelosi accuses CIA of misleading her about its use of waterboarding during Bush administration http://is.gd/zVJS","Stephen Colbert recommends the Republicans rebrand themselves with a new logo - the cockroach. http://bit.ly/wxxi7","Alaska Governor Sarah Palin lands book deal with HarperCollins - refuses to disclose how much she was paid. http://bit.ly/fVKXg","GOP has appalling gender gap in House and Senate - just 10% are women. Dems not a lot better at 23%. http://bit.ly/17zb9y","Oops - Gordon Brown's makeup kit and instructions left in taxi. http://bit.ly/HWPcz","Cheney: The GOP’s better off with Rush Limbaugh than Colin Powell. http://bit.ly/r7iNE","WMxdesign used an image editing program to put clown makeup on the faces of prominent conservatives. http://bit.ly/bybld","Mike Huckabee says the GOP is at risk of becoming \"irrelevant as the Whigs.\" http://bit.ly/TDXZT","Alaska Governor Sarah Palin phoned Miss California Carrie Prejean to offer support. This was before the topless photos. http://is.gd/xZHD","Elisabeth Hasselbeck says Joe the Plumber is an ignoramus. \"Joe the Plumber is not invited anywhere around me.\" http://bit.ly/109fhm","Joe the Plumber reportedly quitting the GOP because he's so outraged by GOP overspending. http://is.gd/xwcY","The White House now plans to release a photo from the odd and controversial New York City flyover http://bit.ly/Npr9a","The Maine Legislature has approved a bill that would make the state the fifth to allow gay marriage. http://bit.ly/17XzDW","Joe the Plumber says he would never let any of his gay friends anywhere near his children. http://tr.im/kvwd","Sen. Arlen Specter says Republicans could have prevented Jack Kemp's death. http://bit.ly/180bNx","Date night for Barack, Michelle and a horde of photographers. http://bit.ly/9IKKq","Public's growing acceptance of gay marriage has Democrats sensing opportunity & some Republicans re-evaluating opposition http://tr.im/kkL6","The White House has launched MySpace, Twitter and Facebook accounts.  http://bit.ly/qre6S","Enquirer says Gov. Sarah Palin's daughter Bristol is trying to cut ex-baby daddy Levi out of her and baby's life. http://bit.ly/EtfsX","Justice David H. Souter said to be leaving the Supreme Court in June. http://bit.ly/PfXwP","Alaska Governor Sarah Palin joins Twitter - has six updates since yesterday. @AKGovSarahPalin","House caves to banking lobby, refuses Interest Rate Cap on credit cards. http://bit.ly/54m6a","RT @health CDCs Anne Schuchat tells Sen McCain that if everything goes great we could have swine flu vaccine by September http://bit.ly/jtDg","Obama's Chief of Staff Rahm Emanuel makes People's most beautiful list. http://bit.ly/SobTB","Republican Sen. Arlen Specter has decided to switch parties and become a Democrat. http://bit.ly/wxV4N","Barack Obama - People faint at my speeches all the time - as someone faints in the crowd. http://bit.ly/RofR0","Family of archaeologist who met Pres. Obama and then later died, say Felipe had a heart attack and not the swine flu. http://tr.im/jRfN","The GOP reportedly stripped flu pandemic preparedness from stimulus. http://bit.ly/10ie8I","H5N1 blog says Michelle Malkin and Hot Air blog totally wrong and ignorant to blame swine flu on immigration problem. http://bit.ly/10U7ON","White House to hold special briefing about swine flu today at 1230pm EDT http://bit.ly/10B2Xk","During his trip to Mexico, President Obama shook hands with an archaeologist who died from Swine flu the following day http://bit.ly/11ajmL","Poll finds toughest match-up for Barack Obama in 2012 is Huckabee. http://bit.ly/sSPkH","President Obama has had to put said his goal of permanently reinstating a ban on assault weapons.  http://bit.ly/10P1sE","Country star Toby Keith is cool with President Obama as Commander-in-Chief. http://bit.ly/fteo","Obama administration to release Bush-era detainee photos on May 28th. http://tr.im/jzMH","Obama on credit cards: \"the days of any time, any reason rate hikes and late fee traps have to end.\"  http://bit.ly/EO1lz","Two top Democratic senators call on Federal Reserve to freeze interest rate hikes on consumer credit card balances http://bit.ly/VEHEz","Meghan McCain tells Karl Rove and Dick Cheney to \"go away\" on The View. http://bit.ly/rRufX","Secretary Clinton on Dick Cheney: \"I Don't Consider Him A Particularly Reliable Source Of Information\" http://bit.ly/RwI7i","May issue of The Washingtonian magazine.to feature shirtless Obama on cover. http://tr.im/jmIz","Meghan McCain: \"Karl Rove follows me on Twitter. That’s creepy.\" http://bit.ly/7sSoj","Miss USA pageant gets political as gossip blogger Perez Hilton asks Miss California about gay marriage. http://bit.ly/ZkkSw","Meghan McCain says \"old school Republicans\" are \"scared shitless\" of the changing landscape. http://bit.ly/cYVbY","\"Open Veins of Latin America\" book becomes bestseller after Hugo Chavez gives it to President Obama. http://tr.im/j9MF","Alaska Gov Sarah Palin criticizes President Obama for his support of abortion rights and embryonic stem-cell research. http://bit.ly/4lpZ","HBO already has a film in the works on the 2008 presidential election. http://tr.im/j0IB","Russia ends its decade-long \"counter-terrorism operation\" against separatist rebels in Chechnya. http://bit.ly/sdS6p","Ron Paul calls on on Congress to consider using letters of marque and reprisal to solve Somali pirate problem. http://bit.ly/8LQ4","Obama vows to simplify tax code: \"\"a simpler tax code that rewards work and the pursuit of the American dream.\" http://tr.im/iTnN","Alan Bersin is expected to be named to a new Southwest border czar position. http://is.gd/svUf","Easter Egg Roll live stream on whitehouse.gov http://www.whitehouse.gov/live/","City councilman Michal Grzes of Ponzan, Poland is furious there is a gay elephant at the zoo. http://tr.im/iH6Z","Evangelical leaders are bewildered  by Rev. Rick Warren's apparent turnaround on gay marriage. http://tr.im/iDFu","Post-White House Life for George and Laura bush is pretty droll - eating take-out, bike riding, yoga, writing books. http://tr.im/iDEB","Hillary Clinton and President Obama have a meeting on the playground. http://bit.ly/qDUMT","President Obama seeks $83.4 billion to fund Iraq and Afghanistan wars. http://tr.im/iwyI","The White House is denying that the president bowed to King Abdullah of Saudi Arabia http://tr.im/itgi It looks like a bow http://tr.im/itgn","Levi Johnston says his family is not white trash. Says Palins won't let him Take Tripp out alone. http://tr.im/itg9","Judge dismisses corruption conviction of former Alaska Sen. Ted Stevens, opens criminal investigation of prosecutors http://tr.im/io29","Sarah Palin's daughter Bristol has a new boyfriend: Johnny Chandler, an old high school boyfriend. http://bit.ly/X394v via @celebritygossip","President Obama stops by Baghdad. Says significant progress has been made but lots of work yet to be done. http://tr.im/inCV","Barack Obama says US will proceed with a missile defence system as long as the threat from Iran persists. http://tr.im/iiOi","A strange product called Chia Obama is being pulled from the shelves of some Walgreens stores. http://bit.ly/PtQ4T","North Korea has defied international warnings and gone ahead with a controversial rocket launch. http://tr.im/ihfn","Laid-off banker finds work as Obama. http://tr.im/igaV","Pakistani Taliban militant leader Baituallah Mehsud claims responsibility for the attack on a U.S. immigration center. http://tr.im/ifSq","Sarah Palin livid over Levi Johnston's appearance on the Tyra Banks show. http://bit.ly/1aNth1","Pesident Obama tells Bank CEOs “My administration is the only thing between you and the pitchforks.” http://bit.ly/3gvIlC","Barack Obama's full bow to Saudi King is a diplomatic faux pas. All that is required is a polite handshake. http://tr.im/iaGn","Federal prosecutors have indicted former Illinois Gov. Rod Blagojevich on corruption charges. http://tr.im/iaD7","President Obama bows to Saudi King - about 55 seconds in on the video clip. http://tr.im/iaAJ","Bipartisan group of Senators introduced a bill on Tuesday that would end a five-decade ban on travel to Cuba. http://tr.im/i4Gz","Seymour Hersh says Richard Cheney left a \"stay behind\" in Obama's government. http://tr.im/i4FC","Vanity Fair believes these statements are Rush Limbaugh's 10 dumbest remarks http://tr.im/i4cc","President Obama says failure of the auto industry is not the fault of its workers but a “failure of leadership” http://tr.im/hZna","Fox News' Bill O'Reilly won't watch any Sean Penn movies. http://tr.im/hZl8","The New York Times has a story on Glenn Beck called Fox News’s Mad, Apocalyptic, Tearful Rising Star. http://tr.im/hZkr","President Barack Obama says he will consult with Pakistan's leaders before pursuing terrorist hideouts in that country. http://tr.im/hXNe","Some ppl who wanted the new WTC tower to be called Freedom Tower think the name, One World Trade Center, is unpatriotic. http://tr.im/hWfE","Last week Joe The Plumber told a crowd of conservatives that he was horny. http://tr.im/hVTt","High Wrinkle TV: High Def Is Not Kind to Politicians http://tr.im/hReP","Former presidential hopeful Fred Thompson wants some of Obama's policies to fail. http://tr.im/hR8H","The Obamas Get to Know Washington - they stay out later and go out more than the Bushes did. http://tr.im/hR4n","Barack Obama's elder half-brother has been hospitalized in Kenya amid an outbreak of cholera. http://tr.im/hQoe","Former DNC chief Howard Dean is going to become a regular CNBC contributor. http://tr.im/hIG5","A campaign first - making the announcement you are running for Congress on Twitter. http://tr.im/hHBz @Adriel4Congress","Obama the candidate vs. Obama the president - AP says president has backpedaled on array of issues. http://tr.im/hFtC","Rash of foreign Obama products offend: Russian ice cream bar, Japanese cell phone ad and Obama-Fingers http://tr.im/hE3g","Gov. Sarah Palin owes more than a half million dollars to an Anchorage law firm. She may create a fund to pay the bills. http://tr.im/hDLY","Alaska and Florida consider bans on bestiality - among 15 states where the practice is not explicitly illegal. http://tr.im/hDzm","Veggie Tales With Michelle Obama - groundbreaking for a new White House kitchen garden on the South Lawn. http://tr.im/hCdA","Special Olympics bowling phenom Kolan McConiughey challenges President Obama to a game. http://tr.im/hC5s","President Obama released taped message to the Iranian people late Thursday urging a new beginning in diplomatic relations http://tr.im/hAhi","White House says President Obama did not mean to offend with his Special Olympics remark on Jay Leno. http://tr.im/hAgb","should focus on, probably more than the brackets\" http://tr.im/hyxa","Duke's Mike Krzyzewski says, \"economy is something that [the president] should focus on, probably more than the brackets\" http://tr.im/hyxa","Osama Bin Laden has called for the overthrow of Somalia's president. http://tr.im/hypN","Speaker Pelosi's Capitol Cat Cam - Speaker criticized for overdoing it with a rick roll. http://tr.im/hwJP","President Obama's Final Four picks: Louisville, North Carolina, Pittsburgh, and Memphis. http://tr.im/hwDG","The White House fountain was dyed green today in honor of St. Patrick's Day - a first for the White House grounds. http://tr.im/huGJ","Former President Ronald Reagan once met Vladimir Putin in May 1988 during a visit to Moscow. http://tr.im/hrUe","Meghan McCain tells critics: 'Kiss my fat ass' http://tr.im/hrnA","Spiegel has a gallery of Obama products that includes Obama Fingers (chicken fingers) http://tr.im/hqpr","Former VP Dick Cheney defends Bush and warns that Obama's policies 'raise the risk' of U.S. terror attack. http://tr.im/hozP","@wefollow #politics #politicalnews #media","The Obama administration is banning downer cows (cows so sick they cant stand up) from entering the food supply. http://bit.ly/tnLF5","Te US will no longer hold terror suspects as \"enemy combatants\", the US Justice Department has announced. http://tr.im/hlru","Irish Americans want President Obama to embrace his great-great-great-grandfather Falmouth Kearney.http://tr.im/hgvf","Nancy Regan praised President Obama today for lifting ban on federal funding for embryonic stem cell research. http://tr.im/hbW5","Barack Obama says he was 'too tired' to give proper welcome to Gordon Brown last week. http://tr.im/h7Yf","Hillary Clinton and the Temptation of Belgian Chocolates. http://tr.im/h7Y7","NYTimes publishes interview with President Obama. Obama says U.S. is not winning the war in Afghanistan. http://tr.im/h7tT","Stimulus Logo: The Obama administration has launched a logo to go along with the stimulus package.  http://bit.ly/TQGFh","The Obamas' First Diplomatic Gaffe: British feel snubbed by the Obamas' lame gifts. http://tr.im/h5H1","CNN's Jack Cafferty has a crush on Michelle Obama. http://tr.im/gYEy","Obama releases Bush anti-terror memos revealing search-and-seizure powers and destruction of CIA interrogation tapes. http://tr.im/gWKF","Conservative activists name Mitt Romney the winner of a poll for best 2012 GOP presidential candidate.  http://bit.ly/o6AmC","First Lady Michelle Obama's Official Portrait was taken today in the Blue Room by photographer Joyce N. Boghosian. http://tr.im/gQKN","Little interest in Samuel \"Joe the Plumber\" Wurzelbacher's new book says the Washington Post. http://tr.im/gPzT","Families of America’s war dead will now be allowed to decide if media can photograph the homecomings of their loved ones. http://tr.im/gPkt","Polls finds 68 percent of Americans approve of Obama's job performance to date. http://tr.im/gImX","Obama likely third pick for Commerce secretary is said to be former Wash. Governor Gary Locke. http://tr.im/gI52","Former President George W. Bush visits hardware store in Dallas that offered him a job. http://bit.ly/FALYk","Brazilian carnival queen Viviane Castro parades with an image depicting President Barack Obama painted on her left leg http://bit.ly/11bDqC","Obama administration is trying to kill a lawsuit that seeks to recover millions of missing Bush administration emails. http://tr.im/gEuL","White House spokesman Robert Gibbs says administration believes privately held banking system is the correct way to go. http://is.gd/khg9","President Obama goes shopping in Canada - Canada trip was his first official foreign visit as the U.S. president http://tr.im/gCkO.","Breaking news headline on MSBC.com says President Barack Obama has approved an initial troop increase in Afghanistan.","David Axelrod says to expect a stem cell executive order from Barack Obama soon. http://bit.ly/oXSiA","Senator Gregg's statement on his withdrawal for consideration of U.S. Commerce Secretary. http://tr.im/fztk","A movie about former Vice Presidential candidate Sarah Palin is reportedly in the works. http://tr.im/fukk","First Lady Michelle Obama graces the March cover of Vogue. http://bit.ly/rbhAd","Separated at Birth: Tim Geithner and the Keebler Elf says Vanity Fair. http://tr.im/fnjc","U.S. Supreme Court Justice Ruth Bader Ginsburg has been hospitalized for cancer surgery. http://bit.ly/1SFhdV","Former VP Dick Cheney warns: high probability terrorists will attempt a catastrophic nuclear or bio attack in coming years http://is.gd/imft","Tom Daschle has withdrawn his nomination to be Health and Human Services secretary in the Obama administration. http://bit.ly/V5ZU","Whitehouse.gov is being updated more frequently with regular blog posts. Still some problems with  photographs/slideshows http://is.gd/hVDi","Michelle Malkin attacks Obama on Oval Office thermostat. Axelrod says Obama keeps it warm enough to \"grow orchids\" http://tr.im/dvcb","Aretha's hat may be headed to the Smithsonian - but only if Aretha is willing to part with it. http://twurl.nl/kamwts","Michelle Obama to decorate Girls Rooms in White House with items from Pottery Barn and Anthropologie. http://bit.ly/32vm6q","CNN says the GOP has elected Michael Steele as RNC Chairman.","Stimulus bill passes in house but Republicans were unanimous in opposition despite Obama's pleas for bipartisan support. http://tr.im/debe","Mad Magazine has Barack Obama looking stressed out on its latest cover. http://tr.im/d8v8","SarahPac: Sarah Palin's Official PAC website is online. http://www.sarahpac.com","Afghan roadside bombs hit a record in 2008 - 45% increase compared with 2007. http://tr.im/cxja","Sarah Palin's red Naughty Monkey shoes are up for sale on eBay. Current bid is $1,200. http://tr.im/cvvs eBay listing: http://is.gd/hkaD","Realage.com founder Dr. Michael Roizan says presidents age at least 2 years for every 1 year in office because of stress. http://tr.im/cmw2","Micro Sculpture: Obama Family in the Eye of a Needle    http://tr.im/cc9l","USA Today has a new blog tracking Obama presidency http://is.gd/gZE1 - like most sites it's updated far more frequently than whitehouse.gov","President Obama was possibly wearing bulletproof suit made by Columbian designer Miguel Caballero on Inauguration day. http://bit.ly/1hcJiJ","New whitehouse.gov website failed to post a single new photo or blog entry today. http://whitehouse.gov","Why Caroline Kennedy withdrew from Senate consideration. http://tr.im/bvd8","Washingon Post says new whitehouse.gov website won't ever be updating the pool reports section. http://tr.im/btde","Whitehouse.gov may be slow to update but the State Department's blog is updating - they have posted Hillary's arrival. http://is.gd/gQPL","Video of President Barack Obama's first ride on Air Force One - Obama's first flight was taken before the inauguration http://bit.ly/2hD6Bu","This explains partially why there aren't many updates on whitehouse.gov and no pool reports yet. http://tr.im/brby","New Whitehouse.gov website slow off the mark with pool photos. http://whitehouse.gov/pool/","President Barack Obama retook the oath of office at the White House today http://is.gd/gMbT - following yesterday's flub http://tr.im/bk05","National Enquirer claims publishing insiders are telling them President Bush's memoir is going to contain bombshells. http://bit.ly/3w1ZAH","New York Times says Caroline Kennedy has withdrawn from consideration for the vacant Senate seat in New York. http://is.gd/gM1W","Hillary confirmed: The U.S. Senate approved the nomination of Hillary Clinton as Secretary of State by a vote of 94-2. http://tr.im/bide","CNN says Ted Kennedy has collapsed at the Inaugural luncheon and paramedics have arrived on the scene. http://cnn.com","Here's a list of websites offering live online Inauguration coverage - most major news sites will have live streams. http://bit.ly/tgxi","Change.gov to change to Whitehouse.gov tomorrow at exactly 1 minute after noon EST. http://is.gd/guuV","Barack Obama is planning to meet with top military leaders on Wednesday to discuss the war in Iraq. http://is.gd/gkSy","Even the portable toilets in Washington D.C. have a patriotic theme. http://bit.ly/17VwM","CNN is posting updates from Obama's whistle-stop trip into D.C. by train. http://is.gd/gfJW","Legoland California has recreated the Obama Inauguration in lego form. http://bit.ly/u8Z7","A list of some products Barack Obama uses - BlackBerry, Nike sportswear, honest tea, planters trail mix, Fran's chocolates http://is.gd/gc1n","Karl Rove says honeymoon doesn't last long in the White House and it's easier to campaign than govern in WSJ op-ed. http://is.gd/g0ua","Some Democrats want Obama administration to launch Bush criminal probe and Sept. 11-style commission with subpoena power. http://bit.ly/so8z","Obama's Treasury Secretary-designate Timothy Geithner failed to pay some taxes says AP story. http://is.gd/fLtd","Political historians say the pressure is on Barack Obama to deliver a great inaugural speech. http://bit.ly/Lfo4","Dr. Julie Gerberding has resigned as director of the CDC at Obama's request. Deputy to step in temporarily. http://bit.ly/440W","After impeachment, Illinois Gov. Blagojevich says: \"I will be properly exonerated\" says vote \"wasn't a surprise\" http://bit.ly/11zNv","Cheney warns against impulsive action in Iraq. Cheney: \"An irresponsible withdrawal now is exactly the wrong medicine\"  http://tr.im/3dtt","Zillow estimates the White House would be worth over $300 million were it a home that could actually be bought and sold. http://tr.im/38fo","Barack Obama has yet to concede his BlackBerry. Obama says, \"They’re going to pry it out of my hands.\" http://tr.im/38ft","Joe the Plumber says he is heading to Israel as a war correspondent for Pajamas TV: http://pjtv.com http://bit.ly/1kVt","Barack Obama meets with three former presidents and President Bush for a historic lunch. http://bit.ly/XxKS Slideshow: http://tr.im/348h","Barack Obama as layman restaurant critic in 2001  talked about his love for Johnny Cakes at Chicago's Dixie Kitchen. http://bit.ly/jwxU","President-elect Barack Obama has offered the  surgeon general job to neurosurgeon and CNN correspondent Dr. Sanjay Gupta http://bit.ly/1Rad","AP says President-elect Barack Obama has chosen former Clinton White House chief of staff Leon Panetta to run the CIA. http://bit.ly/R19Y","Bill Richardson withdraws as Obama's Commerce nominee because of the ongoing CDR Financial Products investigations. http://bit.ly/H5wb","Sun-Times says Blagojevich expected to name former state Comptroller and Attorney General Roland Burris to Obama's seat. http://bit.ly/yG4c","Domain renewal lapse costs Bush Library $35,000. http://bit.ly/1nK6","The chairman of the US Joint Chiefs of Staff says up to 30,000 extra troops could be sent to Afghanistan in 2009. http://bit.ly/mpND","Rumor: Oprah Winfrey is buying a $50 million home in Washington, D.C. to be nearer to the White House and Barack Obama http://bit.ly/IHAz","Mark Felt, the former FBI official who revealed himself to be Deep Throat, has died at age 95. http://bit.ly/IJY7","Iraqi journalist who threw his shoes at George Bush has publicly apologized & asked Iraqi prime minister to forgive him. http://bit.ly/vJj","CNN says Barack Obama is expected to soon name Illinois GOP Rep. Ray LaHood as his transportation secretary pick.","Evangelical preacher Rick Warren to give Obama's inaugural invocation. Aretha Franklin & Yo-Yo Ma will be performing. http://bit.ly/14ne5","Time has a photo essay of Barack Obama from when he was a college student and posed for some photos.  http://bit.ly/nVEQ","A Wealthy Saudi has offered 10 million dollars for one of the shoes thrown at President Bush. http://bit.ly/q9lD","The bowling industry is proposing a White House Lane makeover - they hope Obama makes the upgrade when he takes office. http://bit.ly/V2HRm","Barack Obama and Joe Biden will take the train to DC inauguration. http://bit.ly/GZXr","New York Times says Caroline Kennedy will seek Senate seat being vacated by Hillary Clinton.  http://bit.ly/iDnh","Brother of shoe throwing Iraqi journalist explains his brother's anger. Claims shoe throwing incident was not planned. http://bit.ly/iBXU","New D.C. store - carrying tons of Barack Obama merchandise - opens just in time to capitalize on the Inauguration. http://bit.ly/10X67","Two shoes were thrown at President Bush during a news conference in Iraq. Bush has fast reflexes. http://bit.ly/zM1u","Sarah Palin was the fastest rising global search query in 2008 according to Google's 2008 Zeitgeist. http://bit.ly/12xEn","Joe the Plumber \"appalled\" by John McCain but says that Sarah Palin is \"absolutely the real deal.\" http://bit.ly/ig6E","Illinois Gov. Rod Blagojevich released on $4,500 bail following his arrest on federal corruption charges. http://bit.ly/12gaF","Politico says liberals are \"growing increasingly nervous – and some just flat-out angry\" about Obama's cabinet picks.  http://tr.im/20iw","Barack Obama admits to falling off the wagon a few times in his bid to quit smoking. http://tr.im/20iu","Baby Boomers cafe in Des Moines, Iowa gets chocolate chunk cookie sales boost - Obama family loves the cookies. http://bit.ly/e4qA","Barack Obama unveils 21st Century New Deal - plan to repair bridges, roads, schools & make nation more energy efficient. http://bit.ly/Fst1","AP says Caroline Kennedy is interested in Hillary Clinton's NY Senate seat. http://bit.ly/5fIe","ZuneGate: Barack Obama Spotted Using a Zune - Apple fanboys in shock. http://bit.ly/PyyQ","Jeb Bush is said to be pondering a Senate run now that incumbent Republican Mel Martinez has retired. http://bit.ly/qmKi","Update on the Impeach Bush ornament - White House will not accept it. http://tinyurl.com/5bpgwe","Impeach Bush ornament accepted for hanging on the official White House Christmas tree. http://bit.ly/DMys","A bipartisan panel warns a biological attack is likely by 2013 - recommends Obama administration prepare for germ warfare http://bit.ly/uywa","AP says Barack Obama will keep Defense Secretary Robert Gates in that job for at least a year. http://bit.ly/tziC","Associated Press says Obama's tax hike for the rich may be delayed. http://bit.ly/199v","PETA blogs about Sarah Palin's recent interview conducted with turkeys being slaughtered in the background. http://bit.ly/153WK","CNN breaking news: \"Barack Obama is on track to nominate Hillary Clinton as secretary of state after Thanksgiving, transition aides say.\"","Attorney General Michael Mukasey collapsed during a speech Thursday night and was taken to a hospital. http://bit.ly/72yY","CNN reports that John McCain won the state of Missouri. Final electoral vote count is 365 for Obama and 173 for McCain. http://bit.ly/pWgT","Chicago Sun-Times auctions Fine Art Prints of Nov. 5th Obama victory edition on Ebay http://bit.ly/bIkN","The  California Supreme Court has agreed to review legal challenges to Prop. 8 http://bit.ly/s4Ji","Ted Stevens was declared the loser in Alaska on Tuesday night after a two-week-long process of counting. http://bit.ly/EFda","The Guardian says Hillary Clinton to accept Obama's offer of Secretary of State job. http://bit.ly/LVsN","South Carolina Sen. Jim DeMint (R) accuses John McCain of betraying conservative principles in his bid for White House http://bit.ly/Hxfl","Bluewater Productions has a new Michelle Obama comic book - part of their \"Female Force\" series.  http://bit.ly/5FHg","Sarah Palin photographed lounging poolside in her short shorts. Photos: http://twurl.nl/qbfm6b Story: http://bit.ly/6Afi","Obama to give weekly YouTube addresses. The videos will also be posted on change.gov. http://is.gd/7tgW","Democratic official confirms Hillary Clinton met with Barack Obama Thursday to discuss her role in the new administration http://bit.ly/1mLi","President-elect Barack Obama announced that he will be resigning his Senate seat as of Sunday. http://twurl.nl/2y76yl","Republican Sen. Ted Stevens now trailing by 3 votes in Alaska Senate race. http://twurl.nl/5nxz5g","Inauguration Tickets are Red Hot - selling for as much as $40,000. http://twurl.nl/os06xd","WashPo story says Obama will enter White House with the opportunity to create the first truly \"wired\" presidency. http://twurl.nl/f7ggi6","Video of the Obamas arriving at the White House for their meetings with the President and First Lady Laura Bush http://is.gd/6Wh8","President Bush and President-elect Obama to meet for private Oval Office meeting - expected to discuss economy, Iraq http://twurl.nl/mfm68j","Agenda disappears from Obama's change.gov website. http://twurl.nl/4qvwtk","Barack Obama: The 50 facts you might not know from The Telegraph http://twurl.nl/vnghb0","Obama's transition advisers compile list of about 200 Bush admin actions and executive orders that could be undone http://twurl.nl/8hhvil","First Lady Laura Bush telephoned Michelle Obama yesterday to personally invite her to the White House. http://is.gd/6yPI","Fox News checks Obama's \"real age\" and finds he is 49 years & 8 months old. Obama's biological age is 47 years & 3 months http://is.gd/6yFG","Robert Gibbs, an aide to Obama on his campaign & in his Senate office, will be named White House press secretary. http://is.gd/6uKC","McCain aides are claiming Palin was unaware of the countries involved in NAFTA and believed Africa to be a single nation. http://is.gd/6sBI","Sewage plant in San Francisco will not be named after  George W. Bush. Lost by a 70-30 ratio http://is.gd/6qSp via Hot Air http://is.gd/6s5V","McCain aide characterized Sarah Palin's shopping spree as \"Wasilla hillbillies looting Neiman Marcus from coast to coast\" http://is.gd/6rVR","Barack Obama has announced a transition team http://is.gd/6qGX - a website for the transition at change.gov will go live later today.","Barack Obama Etch a Sketch drawing by artist Tim George - he sketches all the presidents http://twurl.nl/8dz228","Rahm Emanuel has accepted the post of Obama's Chief of Staff. http://twurl.nl/iz33ke Wikipedia entry for Emanuel: http://is.gd/6qFD","AP is reporting that McCain has phoned Obama to concede the election.","Fox News just called California for Obama giving him enough electoral votes to be president elect. CNN, other networks calling the same.","Fox News is reporting that Obama won Virginia http://twitter.com/FOX40/status/990838677","NBC News projects Obama to win Iowa and McCain to win Utah and Texas. http://is.gd/6imx","@Schmittyapolis The networks use demographic data analysis from prior elections plus exit poll data to make these early projections.","CNN has now also called Ohio for Barack Obama.","Fox News has called Ohio for Barack Obama.","@James_Eiden All the networks have already called PA now - it must have looked obvious on their exit polling.","NBC has called Georgia and Alabama for McCain. http://www.msnbc.msn.com","CNN has now also called Pennsylvania for Obama. http://bit.ly/4xA2FS","Florida exit polls show Obama winning Hispanics by 10% - Bush won Hispanics in Florida by 12 points in 2004. http://is.gd/6mEP","CNN does have New Hampshire colored blue now. http://tinyurl.com/5ro3gz","ABC has called New Hampshire for Barack Obama. http://tinyurl.com/5oarzf CNN has not yet called that state or Pennsylvania.","MSNBC has already called Pennsylvania for Obama http://www.msnbc.msn.com/id/27531033/ - CNN has not yet","CNN projects Obama wins New Jersey, Illinois, Connecticut. McCain takes South Carolina, Oklahoma, Tennessee.","CNN has put South Carolina in the win column for John McCain. His EV count is now at 16.","Virginia election results are now starting to come in. http://bit.ly/3vq1SN","CNN has called Kentucky for John McCain and Vermont for Obama. http://www.cnn.com/ELECTION/2008/results/president/","Early results show a close race in Kentucky with 9% of precincts counted. McCain is expected to win KY. http://bit.ly/3qYbz3","Polls indicated the race in Indiana would be very close.  McCain had a slight edge in Pollster's average: http://tinyurl.com/4h9mh4","That last link didn't work because of the # in CNN's URL.  Here's a better link to CNN results page for Indiana: http://bit.ly/1SOAHH","Results from Indiana and Kentucky starting to come in - Link to CNN's results page for IN: http://is.gd/6m7J KY: http://is.gd/6m82","Barack Obama is winning the online If the World Could Vote poll at http://iftheworldcouldvote.com","The New York Times Caucus blog has an ongoing post about long lines, lawsuits and glitches. http://is.gd/6jUy","Videos of Barack and Michele Obama and John and Cindy McCain voting earlier today. http://is.gd/6lhT","Sarah Palin's medical records released. Her doctor says she's \"in excellent health and has had no major medical problems\" http://is.gd/6kci","Karl Rove's final electoral map 2008 prediction shows a 338-200 Obama electoral vote victory over McCain. http://rove.com/election","Obama defeated McCain 15 to 6 in Dixville Notch, NH. Hart's Location, NH reported 17 for Obama, 10 for McCain and 2 for write-in Ron Paul.","McCain 510 Electoral Votes, Obama 28 … How the Electoral Map looked exactly 2 years ago according to SurveyUSA http://twurl.nl/jiuumc","29,123,228 people have voted early so far according to the United States Elections Project. http://twurl.nl/d6y5xe","California GOP files FEC Complaint over Obama visit to Grandmother - ill-timed press release from the RNC today http://is.gd/6fjG","Senator Barack Obama's grandmother Madelyn Dunham - who Obama called \"Toot\" - dies at age 86. http://is.gd/6fhg","538 on final polls \"While there is arguable evidence of a small tightening, there is no evidence of a dramatic tightening\" http://is.gd/6cur","This site will bring back some memories for those who have been following this election since the primaries http://thisfuckingelection.com","Some blogs discussing January interview where Obama talks about his plans to implement cap-and-trade policy on coal plants http://is.gd/5BRW","CNN article says Montana is still in play. http://ping.fm/8mk1r","Opening clip from SNL - Sen. McCain and Gov. Palin (Tiny Fey) address the Nation on QVC http://ping.fm/PJipZ","Sarah Palin pranked by radio station with caller pretending to be Nicholas Sarkozy. BBC: http://twurl.nl/dogxsq YouTube: http://is.gd/5wrJ","College newspapers back Barack Obama 63 to 1. http://twurl.nl/k77w1s","Starbucks to offer a free 12-ounce drip coffee Tuesday on Election Day. http://twurl.nl/e68wjd","Barack Obama says he didn't know his Aunt was living in the United States illegally. http://twurl.nl/e365gb","Cabbage Patch dolls created for the candidates are up for auction on eBay for charity. Palin's doll has the highest bids. http://is.gd/5kv8","Bloomberg.com: McCain goes into last days of race a \"bigger underdog than any victorious candidate in a modern election\" http://is.gd/5k0M","ABC says senior government officials tell them the intelligence community expects a message from Osama bin Laden. http://twurl.nl/c7s4kk","Confusion surrounds a Joe the Plumber \"no show\" at a McCain rally. McCain called out for Joe but he wasn't there. http://twurl.nl/63cnyv","Elizabeth Vargas asked Sarah Palin about 2012. Palin said she's confident things will go their way on Nov 4th. http://twurl.nl/up2bg3","Obama has spent more on ads & had the big 30-minute slot. The issue covered the most in political ads has been taxes http://twurl.nl/vbkvb0","FiveThirtyEight analyzes undecided voter data http://twurl.nl/0ri40d Dick Morris thinks undecideds will break for McCain http://is.gd/57YT","Washington Post has an article about Obama's campaign allowing donors to use largely untraceable prepaid credit cards http://twurl.nl/xbql7x","Meanwhile, Paris Hilton is running for president - she promises to create a department called the Fashion Police. http://twurl.nl/tg5dbl","A John McCain adviser says Gov. Sarah Palin is a \"whack job.\" http://twurl.nl/coq28q","McCain's campaign wants L.A. Times to release video of a party for a Palestinian activist that Obama attended in 2003 http://twurl.nl/0l3naq","Sarah Palin has been touting \"Tito the Builder\" on the campaign trail and his story as an immigrant from Colombia. http://twurl.nl/7jmu2d","Pew’s latest nationwide survey of 1,325 registered voters shows Obama with a big lead among people who voted early. http://twurl.nl/1s2dfp","The latest Rasmussen Reports telephone survey in the state of Arizona finds Senator McCain leading just 51% to 46%. http://twurl.nl/g5xf38","The bi-monthly New Mexico Sun News runs the headline \"Obama Wins!\" - it's a liberal leaning alternative newspaper http://twurl.nl/5884jt","Alaska Sen. Ted Stevens convicted of lying about home renovations & gifts he received from wealthy oil contractor. http://twurl.nl/8q27l5","Senator John McCain insists his campaign is \"doing fine\" despite polls that show him trailing. http://ping.fm/Xmh8J","There are reports on rising tensions between Palin and McCain camps. There's also reports Palin's off the reservation http://twurl.nl/pn2htn","Ashley Todd has confessed to making up the story about being attacked and having a \"B\" carved into her face. http://ping.fm/sfH6B","ABC story looks at 8 battleground states - Ohio, Florida, Virginia, Colorado, Nevada, Missouri, Indiana and North Carolina http://is.gd/4IpI","Barack Obama's Invesco field event expenses - which includes the \"Barackopolis\" - said to be $5.3 million. http://twurl.nl/85n02i","Montana State University-Billings poll has Obama ahead of McCain 44% to 40% in Montana - margin of error is + or - 5% http://twurl.nl/e6udcn","Footage released by the French national audiovisual archive shows young POW John McCain being interrogated in 1968. http://twurl.nl/xe0ynq","Rep. Michele Bachmann says she made a mistatement when she said that Barack Obama \"may have anti-American views\" http://twurl.nl/qoeo8e","McCain buys last-minute air time in Indiana. http://is.gd/4zSJ Most polls do show McCain ahead in Indiana. http://is.gd/4A3Z","Furor over RNC Clothes Shopping Bills for Sarah Palin - $150,000 spent outfitting Sarah Palin and her family. http://twurl.nl/7mwq7m","Candidate Cookies: latest technology allows bakers to bake sugar cookies with photo quality candidate pictures and logos http://is.gd/4wBf","Latest NBC News/Wall Street Journal poll of registered voters has Obama up by 10% over McCain. http://is.gd/4vRQ","CNN's John King says McCain camp giving up on Colorado but betting on a comeback in Pennsylvania. Video clip: http://twurl.nl/0ge187","Google CEO Eric Schmidt will campaign this week for Barack Obama. Schmidt says Google itself is \"officially neutral\" http://twurl.nl/e5u2fq","Editor & Publisher says Obama leads McCain in newspaper endorsements 115 to 38. http://twurl.nl/tnt6p3","Colin Powell endorses Obama: \"He has both style and substance. I think he is a transformational figure\" http://twurl.nl/fnq2eu","Political merchandise gets zanier as Election Day draws closer - condoms, action figures,  gargoyles, comics, etc http://twurl.nl/x4e280","NYTimes article and graphic says Joe Wurzelbacher (Joe the Plumber) would get biggest tax cut under McCain's plan http://twurl.nl/rhb8e6","Scrap the squigglys says FiveThirtyEight http://twurl.nl/y2bia4 - but they might not go away if they gave CNN good ratings.","Glenn Beck is leaving CNN for Fox News. He will host a 5pm show beginning in the Spring. http://twurl.nl/tseudi","The BBC has a profile on Joe Wurzelbacher (Joe the Plumber) who was mentioned in last night's debate. http://twurl.nl/1fgkzu","How important are those squiggly lines on CNN showing the real-time reactions of a focus group of undecided voters? http://twurl.nl/bjbkml","Early results from Canada's third general election in four years show a victory for the ruling Conservatives. http://twurl.nl/rb446r","Sarah Palin dropped the puck at the Philadelphia Flyers hockey game and was booed by the crowd. http://twurl.nl/n6o7po","Sarah Palin critized Obama on abortion at a rally in Pennsylvania. http://twurl.nl/x1y3ic","Ad Age says Barack Obama's campaign has aired 25,000 commercials in the last four days. http://ping.fm/A7MID","From Hot Air: McCain booed after telling crowd to be respectful to Obama. http://twurl.nl/uraw2y","Anchorage Daily News story says Legislative Council voted 12-0 in favor of releasing the Troopergate report. http://twurl.nl/chfa4b","State investigator report says Palin abused her power as Alaska gov. by trying to get her ex-brother-in-law fired. http://twurl.nl/ol3rcb","John McCain makes gaff - calls Americans \"My Fellow Prisoners\" http://ping.fm/jpXYV","President Bush speaks on the economic crisis: \"We can solve this crisis and we will\" http://twurl.nl/vkf401","Senator Joe Biden has had enough of Sarah Palin trying to lecture him on patriotism. http://twurl.nl/kb06uc","Lawmaker's son, 20-year-old UT student David Kernell, indicted in hacking of Sarah Palin's Yahoo email account.  http://twurl.nl/51hihd","Gallup Poll Daily tracking report shows Obama with a 52% to 41% lead over McCain. Biggest lead so far for this poll. http://twurl.nl/dhs305","Sarah Palin news: Banned by Madonna  http://is.gd/3Gel Slammed by Bardo http://is.gd/3Gee Palin also handled a heckler http://is.gd/3Fmg","One of the rules for tonight's debate is that questions had to be submitted prior to the debate over the Internet. http://twurl.nl/u1v8ek","Primary Colors author Joe Klein writes article about Sarah Palin for Time magazine called \"Embarracuda\" http://twurl.nl/yuhp4u","At the Times, Kristol brings up Jeremiah Wright http://twurl.nl/3h0huo and Paul Krugman attacks McCain on healthcare http://twurl.nl/35i7fe","Spirit Halloween uses candidate mask sales to predict winner of presidential race - Obama currently has the lead. http://twurl.nl/8glj3s","@AliAkbar It does look like Obama will win Minnesota but there have been some closer polls recently: http://tinyurl.com/67ramz","Star-Tribune Minnesota Poll shows Obama leaping ahead of McCain. Minnesota is one of the crucial battleground states http://twurl.nl/kd0jn4","Mystery famous person lauds Sarah Palin's debate performance in web advertisement. http://twurl.nl/aw63q7","Governor Sarah Palin says that Katie Couric \"annoyed\" her. http://twurl.nl/w4tjq3","Transcript of the debate between Joe Biden and Sarah Palin. http://twurl.nl/6lfyvv","Politico is reporting that John McCain is pulling out of Michigan and stopping tv ads in the state. http://twurl.nl/3ygtkb","Psychic predicts no November election, riots, martial law and President Bush carrying out his term indefinitely. http://twurl.nl/n1mn8l","Graphic map of who voted no on the bailout bill. http://twurl.nl/hexsg5","Saveur looks at what some politicians including McCain and Obama eat for breakfast http://is.gd/3iEi via SB http://twurl.nl/ub2qxr","Mayor Funderburk says he was \"just curious\" when he forwarded a chain email suggesting Barack Obama is the antichrist http://twurl.nl/53llwp","Sarah Palin is in \"debate camp\" in Sedona, Arizona preparing for Thursday night's vice presidential debate. http://twurl.nl/oerpwb","Fareed Zakaria on Palin \"McCain says that he always puts country first. In this important case, that is simply not true\" http://is.gd/3duE","Obama moves to a 50% to 42% lead in Gallup's daily tracking poll. http://twurl.nl/gx5y4d","Transcript of last night's presidential debate: http://twurl.nl/h42n7r","CBS News & Knowledge Networks poll of about 500 uncommitted voters suggests Barack Obama won tonight's debate. http://twurl.nl/ee7s5o","All Eyes on the First Presidential Debate - any candidate making an economy-related gaffe will regret it. http://twurl.nl/hwtqkd","Congrats to Senator John McCain who apparently has already won tonight's debate. ;-) http://twurl.nl/6amauf","Debate Uncertain: it's still unclear if John McCain and Barack Obama will meet Friday for their scheduled 1st debate http://twurl.nl/r6gki1","Republican vp candidate Sarah Palin warns U.S. could be headed for another Great Depression if Congress doesn't act. http://twurl.nl/f4wpst","CNN's Campbell Brown says free Sarah Palin: &quot;end this chauvinistic treatment of her now. Allow her to show her stuff&quot; http://twurl.nl/7bfy0g","ABC's Political Radar blog is saying a senior Obama campaign official told them, &quot;The debate is on.&quot; http://ping.fm/WtStN","John McCain suspends campaigning to focus on the  &quot;historic&quot; economic crisis - wants this Friday's debate postponed http://twu ...","All the Candidates' Cars: http://twurl.nl/atqdjb The Obama's own a Ford Escape hybrid. The McCain's have 13 cars - photos http://is.gd/2Wxg","New CNN Poll shows GOP taking the brunt of the blame for Wall Street's problems and the Obama campaign is benefiting. http://twurl.nl/qwyemy","Gov. Sarah Palin refers to the McCain-Palin administration as the \"Palin and McCain administration.\" http://twurl.nl/dkqzzr","Gallup's Daily tracking poll now shows Barack Obama with a 4 point lead. Obama was down 5 points earlier this month. http://twurl.nl/unnjd4","McCain camp seeks investigation into Sarah Palin's hacked emails http://twurl.nl/mwy048 Wikileaks: (slow loading) http://ping.fm/N0lnN","Six politicians in Brazil have officially renamed themselves Barack Obama. http://twurl.nl/am4o8u","McCain adviser who was waving a Blackberry around said \"You're looking at the miracle that John McCain helped create\" http://twurl.nl/pqtgk5","Sarah Palin had a private tanning bed installed at the Alaskan governor's mansion. http://twurl.nl/wj4vht","The Dow plunged 500+ points today http://twurl.nl/fpa8gb Obama was quick to blame the financial crisis on Bush's policies http://is.gd/2FWn","The Times tracked down Palin's hairdresser in Wasilla, and conducted an in-depth interview about Palin's hairstyle. http://twurl.nl/k0it1d","Jon Friedman at Marketwatch says the Sarah Palin phenomenon is doomed once the media gets bored of her. http://twurl.nl/p7k8g4","GOP's Sarah Palin bounce has eroded Obama's electoral college lead. http://twurl.nl/y127ut See also: http://electoral-vote.com","Barack Obama has canceled plans to appear on Saturday Night Live tonight due to Hurricane Ike. http://twurl.nl/sfqieh","Sarah Palin softens stance on global warming but still favors drilling in the Arctic National Refuge. http://twurl.nl/6cptpc","Tina Fey may play Sarah Palin on Saturday Night Live - said to be in talks with SNL producer Lorne Michaels. http://twurl.nl/bm8evh","Bob Barr and Mike Huckabee joke that  Sarah Palin was not vetted by John McCain. http://twurl.nl/gkkjve","Actress Jessica Alba endures bondage in get out the vote effort. http://twurl.nl/1eaju6","National Enquirer story claims Sarah Palin's children Track and Bristol are hard partiers and drug users. http://twurl.nl/gzi4ee","Republicans have launched a \"Palin Truth Squad\" to defend John McCain's vp pick from perceived falsehoods. http://twurl.nl/gc0l4a","Sen. Joe Biden says if Sarah Palin becomes the first female vice president it will be a \"backward step for women\" http://twurl.nl/rymw52","Russell Brand's VMA routine http://twurl.nl/qp7t6c at has been attacked by conservative bloggers. Brand called Bush a \"retarded cowboy\"","Sarah Palin confused by Fannie Mae and Freddie Mac - claimed they were \"too expensive to the taxpayers.\" http://twurl.nl/pwx288","Some are mad for Sarah Palin's glasses - they are made of titanium and designed by Japanese designer Kazuo Kawasaki. http://twurl.nl/olprwc","NBC removes Olbermann & Chris Matthews as election night anchors. David Gregory will become the political anchor http://twurl.nl/5mdbfx","VP candidate Sarah Palin has offered her first tv interview to ABC News - will be held in Alaska in the coming week. http://twurl.nl/0k65l7","Palin dodges Sunday talk shows. McCain aide says they won't do TV news shows if they don't think they will help them http://twurl.nl/1mf6hv","Sarah Palin attended five colleges in six years before graduating from the University of Idaho in 1987. http://twurl.nl/tsx25x","Sarah Palin biography quickly becomes a bestseller. http://twurl.nl/tvdybl","Cindy McCain's wardrobe expenses attacked - cost estimated to be between $299,100 and $313,100. http://twurl.nl/tzwldc","The text of Senator John McCain's GOP convention speech. http://twurl.nl/u0zixq","Latest Daily Show looked at conundrum Karl Rove and other GOP insiders face with McCain's selection of Sarah Palin. http://twurl.nl/ahl3rr","Barack Obama raised $8 million after the Sarah Palin speech. McCain has brought in $10 million+ since choosing Palin http://twurl.nl/ykmi4w","Kia commercial mimics Obama brand - Kia ad running in Texas uses an Obama look-alike and the Obama campaign logo. http://twurl.nl/a0vlr1","Times Online's headline about Palin's GOP convention speech: \"She's like a moose going after a cabbage\" http://twurl.nl/cw2w4p","Quotes from Palin's GOP convention speech. She jabs at media and Obama; bills herself as an outsider and hockey mom. http://twurl.nl/wyhuc0","McCain camp threatens to sue National Enquirer over Sarah Palin story that included allegations of marital infidelity http://twurl.nl/lep3wb","Conservative columnist Peggy Noonan caught on tape disparaging John McCain's selection of Alaska Governor Sarah Palin http://twurl.nl/zaaos4","Who Is Sarah Palin? http://twurl.nl/nnf2bf","Weekly Standard says Fred Thompson will defend  Palin vp pick in speech tonight the GOP characterizes as \"red meat\" http://twurl.nl/ae22ga","Democratic candidate Barack Obama an inspiration to many artists. http://twurl.nl/yiuhsv via @crafts","A sailor killed in Afghanistan on Saturday was the 500th U.S. service member to die since that war began in 2001. http://twurl.nl/0m22at","NYTimes says recent disclosures about Palin raise questions about how thoroughly McCain had examined her background. http://twurl.nl/mzrrtc","CNN reports that Gov. Sarah Palin just announced that her 17-year-old daughter Bristol is pregnant and will be marrying the father.","Russian President Vladimir Putin has reportedly saved a TV crew from a tiger. http://twurl.nl/sxg6zg","GOP changing the convention http://twurl.nl/lmq86z and Bush, Cheney will not be attending because of Hurricane Gustav @hurricanes","Links for Sarah Palin. Wikipedia: http://twurl.nl/7p5b8c On the Issues: http://is.gd/22sj Official site: http://gov.state.ak.us","John McCain has chosen Alaska Governor Sarah Palin for his running mate. http://twurl.nl/kgomyu","Jon Stewart poked fun at the hostility between MSNBC anchors on the Daily Show. http://twurl.nl/r05ra4","The GOP is mocking Obama's stage on Invesco field. McCain camp memo referred to the stage as the \"Temple of Obama\" http://twurl.nl/s5u1ca","Convention bounce for Barack Obama - leads McCain by 6% in Gallup's daily tracking poll. http://twurl.nl/yn5jkj","Between Hillary's speech last night and Bill's speech tonight, the Obama campaign should be thrilled. Bill's speech: http://twurl.nl/2h8r6j","US News blog says Romney won't be McCain's VP pick. Lieberman, Kay Bailey Hutchinson, Meg Whitman still in the mix. http://twurl.nl/43y7sf","AP has the text of Hillary Clinton's DNC speech: http://twurl.nl/ombrrq \"No way. No how. No McCain.\"","Gallup Poll not showing a Biden VP-pick bounce for Obama. McCain has moved ahead 2% in the Gallup tracking poll. http://twurl.nl/rlt2zu","Michelle Obama gives a great performance - mentions Hillary, says she loves America. Barack appeared via videofeed.  http://twurl.nl/q8atv5","Democrats streaming the DNC live - go to  http://democrats.org - then click on the link that says video.","Politico says retired General Colin Powell is one of the potential running mates John McCain has considered. http://twurl.nl/y375oc","Barack Obama's 3:00 a.m. text message a last swipe at Hillary Clinton? http://twurl.nl/yceb3q","It is looking good for Biden (despite the Bayh stickers) - Secret service said to be on the way to Biden's house. http://twurl.nl/qmqvrn","Bob Woodward's next book, The War Within: A Secret White House History 2006-2008, will be out September 8th. http://twurl.nl/sjzkms","Bumper stickers printed by Lenexa company may indicate that U.S. Senator Evan Bayh of Indiana is Obama's VP pick. http://twurl.nl/wgzlsr","Fake Obama VP texts going around - Fonzie , Michael Phelps, Alan Keyes http://twurl.nl/mrsn3p and http://is.gd/1Qi3","New Reuters/Zogby poll has John McCain with a 5-point lead on Barack Obama. http://twurl.nl/ztfywc","New York Times says Obama appears ready to announce his VP pick - announcement could come as early as Wednesday. http://twurl.nl/wt0zo3","General Wesley Clark discusses events in Georgia and Putin's griping about the missile shield in Poland. http://twurl.nl/2rgqmg","The Presidential Candidates' favorite music - top ten song lists for Barack Obama and John McCain. http://twurl.nl/bwwbye","Bill Kristol says Colin Powell will endorse Barack Obama at the Democratic National Convention. http://twurl.nl/jqkunh","John McCain says in response to Russian aggression against Georgia that \"we are all Georgians\" now. http://ping.fm/QIFqs","Book that was based on John Edward's mistress Rielle Hunter (Story of My Life by ay McInerney) hits bestseller list again http://is.gd/1nT7","President Bush on Monday demanded that Russia end a \"dramatic and brutal escalation\" of violence in Georgia. http://twurl.nl/lxgnl0","Clinton Communications Director Howard Wolfson says Edwards cover-up cost Clinton the nomination. http://twurl.nl/3wg8l7","The latest Gallup Poll Daily tracking update shows Barack Obama with a 47% to 42% lead over John McCain. http://twurl.nl/cbl8dk","John Edwards admits he had an affair but says the child is not his. http://twurl.nl/a4xtc1","3 anti-Obama books appear on Amazon.com's  bestseller list. Corsi's Obama Nation is currently #6 on the list. http://twurl.nl/ezfo5b","The Obama campaign has offered former President Bill Clinton a speaking role at the Democratic National Convention. http://twurl.nl/6ainqs","Some Democratic strategists are unhappy with the Obama camp's response to McCain's attack ads. http://twurl.nl/oh4evt","Some diehard Hillary Clinton backers are not giving up says Raw Story article. http://twurl.nl/wh2kny","McCain Girl sings with her magical animated friends Don't Tax Me Turtle, Single Issue Eagle & Homophobic Platypus. http://twurl.nl/jnum3a","Tyra Banks channeled Michelle Obama for a Harper's Bazaar photo spread. http://twurl.nl/d8d2yf","The John Edwards love child story continues to percolate across the Internet but networks won't cover it. http://twurl.nl/igo06x","Reporter Dana Milbank quits Olbermann over a disputed quote about Obama becoming a symbol. http://twurl.nl/znx7ii","White House denies it made a fake letter to show a link between Saddam Hussein’s regime and al-Qaeda.  http://twurl.nl/jlu1u2","New Zogby poll shows Obama losing support among young voters, independents and women. http://twurl.nl/2wxg1l","Comic-Con Meets Politics: Costumed Comic-Con attendees are polled to see who they are voting for in this video clip. http://twurl.nl/3z2yr4","White House rejects calls from House Republicans that it convene a special session of Congress on energy. http://twurl.nl/qnyn3l","John McCain's Ferragamo Loafers that became an issue in the ongoing campaign last week. http://twurl.nl/4ee4i0","Candidate Comics: John McCain and Barack Obama will each get their own comic book this fall. http://twurl.nl/3qlbuw","Barack Obama may support limited additional offshore oil drilling. He's also pushed for a windfall profits tax. http://twurl.nl/adzg26","Constantly changing Gallup Poll has Barack Obama now ahead of John McCain by one percentage point, 45% to 44% http://twurl.nl/ywvq5a","Earlier this week David Letterman presented the Top Ten Signs That Obama is Overconfident. http://twurl.nl/lsqxzb","New McCain ad calls Barack Obama \"The Biggest Celebrity in the World.\" Ad also shows Britney Spears and Paris Hilton http://twurl.nl/pq411z","Alaska Senator Ted Stevens indicted - prosecutors say he received $250K in gifts and services from VECO Corp. http://twurl.nl/r66tog","Here's the new trailer for Oliver Stone's film about George Bush, called W. http://twurl.nl/2tvcu6","Ad from the McCain campaign looks at some in the media's infatuation with Barack Obama. http://twurl.nl/wxa0j3","Department of Homeland Security is raising vague concerns about a possible terrorist attacks in the US or abroad. http://twurl.nl/mcnull","Barack Obama opens up 9% lead over John McCain according to latest Gallup poll http://twurl.nl/86xh5f","John Edwards scandal erupting after National Enquirer caught him visiting his mistress and their infant child. http://twurl.nl/uwtlyc","German journalist overly enthusiastic about her workout with Barack Obama. \"wow, he didn’t even sweat! What a man!\" http://twurl.nl/ltr5jx","Vanity Fair decided to create a cover in response to the now infamous New Yorker Obama cover. http://twurl.nl/a0v4ch","Barack Obama promises crowds at Berlin's victory column a \"safer, more united world.\" http://twurl.nl/f5ik78","President George Bush explains the economic downturn:  \"Wall Street got drunk\" ... \"and now it's got a hangover.\" http://twurl.nl/h6hxpf","Enquirer claims to have caught Edwards with mistress and love child. http://twurl.nl/hxsfh4","John McCain makes a gaffe - refers to a non-existent Iraq/Pakistan border http://twurl.nl/586hox","Gore: \"We're borrowing money from China to buy oil from the Persian Gulf to burn it in ways that destroy the planet\" http://twurl.nl/vhmetw","JibJab is back with more election satire. Barack Obama rides a unicorn in it. http://twurl.nl/a0guw7","US officials not denying reports they plan to establish a US diplomatic presence inside Iran. http://twurl.nl/0x6h7d","Jon Stewart on controversial New Yorker Cover: It's Just a $%@!! Cartoon. http://twurl.nl/motq6u","Brit Hume to resign as Fox News anchor. Will remain as senior analyst - has been with Fox since debut 12 years ago http://twurl.nl/2ygvkk","A video of a detainee being questioned at the US prison camp in Guantanamo Bay has been released for the first time http://twurl.nl/s7nfoi","Pres. Bush lifted an executive ban on drilling on the Outer Continental Shelf - the ball is now in Congress' court http://twurl.nl/1hv56r","Cartoon on New Yorker Cover angers Obama campaign - McCain camp also criticizes cartoon. http://twurl.nl/2naltm","Nine US troops killed and 15 injured in attack on a remote U.S. base in Afghanistan. http://twurl.nl/ksie3l see also: http://is.gd/Snw","Former White House press secretary Tony Snow has died of cancer.  He was 53. http://twurl.nl/fnvfzm","Rumor Mill: Anti-gay GOP Alabama Attorney General Troy King was caught by his wife in bed with his male assistant. http://twurl.nl/rwkkk6","McCain rejects Phil Gramm's \"Americans are Whiny\" speech http://twurl.nl/i7epts","Jesse Jackson apologizes for saying he wants to cut Barack Obama's nuts off http://twurl.nl/nau40g","Senator Obama voted for the FISA bill.  Hillary Clinton voted against it. http://twurl.nl/mt0fuw","The White House has apologised to Italian PM  Berlusconi for a briefing describing him as being \"hated by many.\" http://twurl.nl/hhil4f","John McCain jokes about killing Iranians with cigarettes http://twurl.nl/qatt3e","Senator Jim Webb issues statement that he doesn't want to be Obama's VP pick. http://twurl.nl/t02enw","John Edwards will debate Karl Rove on Sept. 26 on the campus of the University of Buffalo. http://twurl.nl/1s1o7w","Conservative Senator Jesse Helms remembered more as a polarizer than a compromiser.  http://twurl.nl/1bmc3v","Barack Obama tells Christian mag that \"mental distress\" should not qualify as justification for a late-term abortion http://twurl.nl/f364kf","Barack Obama says he might change his troop withdrawal plans after his trip to Baghdad later this month. http://twurl.nl/h7n7dq","The Upper Deck Company recently released a set of Presidential Predictor trading cards. http://twurl.nl/i14pye","Seymour Hersh says the Bush Administration has stepped up its secret moves against Iran. http://twurl.nl/vw2oi8","Barack Obama and Hillary Clinton held a rally today in Unity, New Hampshire, where they both received 107 votes. http://twurl.nl/xqh0xc","President Bush may someday have a sewage plant named after him - the George W. Bush Sewage Plant. http://twurl.nl/8i4ux6","Supreme Court ruled that individuals have the right to own guns for self-defense and hunting. http://twurl.nl/uoz1dv","Netroots jilted by Obama's support of surveillance bill that offers retroactive immunity to telecommunications corps http://twurl.nl/tgyvos","Barack Obama denies having an email relationship with actress Scarlett Johansson - says there was just one email. http://twurl.nl/ss5wqa","Jon Stewart Tells Viewers It's Ok to Laugh at Obama's Foibles http://twurl.nl/seyee6","Rush Limbaugh's Secret Passion: Jo Malone Gardenia Candles http://twurl.nl/ty2fvk","Obama's campaign is done with the presidential seal they unveiled last week at a meeting with Democratic governors. http://twurl.nl/nohqd5","John McCain and Barack Obama spar over how much money to spend on flood control efforts. http://twurl.nl/tipspm","Barack Obama reveals new logo which resembles the official U.S. presidential seal. http://twurl.nl/me56l1","New surveillance bill will broaden the government's spy powers and grant immunity to the telecoms. http://twurl.nl/i1d6j0","Politics is also in Plurk here: http://tinyurl.com/598tpx Find your Twitter friends inside Plurk: http://twurl.nl/vfui0g","Former GOP presidential contender Mike Huckabee warns GOP against demonizing Barack Obama. http://twurl.nl/2jg3tz","Two Muslim women at Obama's rally in Detroit were not allowed to appear in photographs or on tv with the candidate. http://twurl.nl/862txi","McCain foreign policy adviser R. Scheunemann says Obama represents \"the perfect manifestation of a Sept. 10 mindset\" http://twurl.nl/xaoocz","Al Gore endorses Barack Obama.  Posts message on his online journal. http://twurl.nl/vcfjpd","Tim Russert dead at 58 from heart attack - recording voice overs for “Meet the Press” program when he collapsed http://twurl.nl/q670rh","James Carville told Wolf Blitzer that Obama needs to pick Al Gore as his vice president and make him the Energy Czar. http://twurl.nl/zq0ywt","Jim Johnson has resigned from Barack Obama's vice presidential search team http://twurl.nl/symokd","Barack Obama falls of wagon - admits to smoking a cigarette within past few months. http://twurl.nl/4y6yti","First Lady Laura Bush praises Hillary Clinton. Says she \"admired Hillary's grit and strength.\" *http://twurl.nl/xwwad2","Clinton endorsed Obama today in major speech. http://twurl.nl/8fu6uo Follows yesterday's 1-hour meeting. *http://is.gd/sQs","Obama confident of both victory and second term: \"In 2016, I'll be wrapping up my second term as president\" http://twurl.nl/8say4z","ABC News says Hillary Clinton will hold an event with her supporters by Friday. http://twurl.nl/66z1hq","Obama has tapped a three-person team including Caroline Kennedy to lead his search for a running mate. http://twurl.nl/uaaj5q","The AP says Clinton told New York lawmakers that she is open to being Obama's VP candidate http://twurl.nl/odsftb via @newsalert","CNN projects Hillary Clinton wins the Puerto Rico primary by a wide margin.","CNN PR exit poll says \"Large number of Clinton voters say they wouldn’t be satisfied if Obama wins the nomination\" http://twurl.nl/u76exk","Trinity United Church of Christ saddened by news that Barack Obama has resigned from the church. http://twurl.nl/rdvlhz","Voting is underway in the Puerto Rico primary. http://twurl.nl/wqnamw","AP: Dem party officials say a party committee agreed on compromise to seat Michigan & Florida delegates w half-votes http://twurl.nl/hakinl","Senator LarryCraig is writing a book about his arrest for solicitation in a men's airport bathroom. http://twurl.nl/y38c4s","Scott McClellan dishes on Iraq War, possible Bush cocaine use in his critical new book \"What Happened\" http://twurl.nl/p68f1m","NYTimes says there are concerns the John McCain camp is in disrray - staff resignations, money raising troubles http://twurl.nl/z5qr0y","John McCain (71) receives a healthy report - heart pass stress test. McCain has survived three bouts of melanoma. http://twurl.nl/2xbzuu","Hillary Clinton has a 32% lead in Kentucky with 62% of precincts reporting. http://twurl.nl/fuchl2","CNN projects Hillary Clinton as the winner of Kentucky by a \"wide margin.\"","CBS early exit poll in Kentucky - 80% of Clinton voters said they would be dissatisfied if Obama was the Dem nominee. http://twurl.nl/a0pa0q","Senator Ted Kennedy diagnosed with brain tumor - malignant glioma in the left parietal-lobe http://twurl.nl/m2les8","Polls predict 10+ point win for Obama in Oregon tuesday http://twurl.nl/xrf4cf & a 30 point Clinton rout in Kentucky http://twurl.nl/5srbf2","Giant crowd estimated at 75,000 came out to see Barack Obama at Waterfront Park in Portland, Oregon. http://twurl.nl/dl0gb0","Senator Ted Kennedy has been rushed to the hospital after suffering stroke symptoms. Kennedy is 76-years-old. http://twurl.nl/4lghnl","The California Supreme Court overturns a voter-approved gay marriage ban in a 4-3 decision. http://twurl.nl/ys3xz2","Hillary Clinton now ahead of Barack Obama in Virginia by 39% with 72% of precincts reporting http://twurl.nl/ghr2ya","Hillary Clinton is up 37% over Barack Obama in WV with 49% of precincts reporting. http://twurl.nl/jysopp","Exit polls indicating a 30+ point win for Clinton over Obama in West Virginia.","CNN has called West Virginia for Hillary Clinton.  Results should start coming in soon.","West Virginia Exit Poll: 20% think Obama shares views of Rev. Wright \"a lot\" and 30% think he \"somewhat\" shares views http://twurl.nl/p4bmmo","64% of Democrats in a Washington Post/ABC News survey want Hillary Clinton to stay in the race. http://twurl.nl/v28wl3","Former Republican Rep. Bob Barr has launched a Libertarian Party presidential bid http://twurl.nl/3hr520","L.A. Times says Ron Paul's forces are planning a GOP convention revolt against John McCain http://twurl.nl/svffkn","West Virginia votes on Tuesday.  WV Polls show Clinton with a monster lead over Obama. http://twurl.nl/zb0mhv","Bush wedding photos hitting the blogosphere: http://is.gd/f6w  http://urltea.com/3691 http://is.gd/f6y http://is.gd/f6z","LA Times reports on Obamaa gaffe - says he visited 57 states. http://twurl.nl/s6lzi3","Barack Obama sacks Middle policy advizer Robert Malley over talks with Hamas. http://twurl.nl/ck7ba1","And there's the call from MSNBC http://www.msnbc.msn.com","Almost of all of Lake County is in now and Hillary Clinton has widened her lead to about 22,000 votes.","NYTimes (AP) says Lake County has a tradition of late vote tallies. They are continuing this tradition tonight. http://twurl.nl/gk43m0","56% of Lake county, IN is now in. Lead is narrowing but Clinton still leads Obama by 16,609 votes. http://twurl.nl/vl07hy","Finally starting to get some data in for Lake county in Indiana. It's going 75-25 for Obama with 28% reporting so far. Clinton lead at 2%","Only CBS has called Indiana for Clinton. Other networks still waiting for data from Lake county in northwest Indiana. Clinton is up by 4%.","It looks like Barack Obama is going to hold onto a 14% win in NC http://urltea.com/35r7","Here's the link for the call on the Indiana primary for Hillary by CBS News http://twurl.nl/du4cuw","CBS News has called Indiana for Hillary Clinton.","NBC News also projects that Sen. Obama will win the NC primary. http://www.msnbc.msn.com","Fox News is already projecting that Barack Obama will win the North Carolina primary.","Fox News says their exit polls show Hillary Clinton won Indiana by 4 points but no network is calling the state for Hillary yet.","Indiana results coming in to CNN's results page. Hillary has a 12 point lead but with just 8% reporting http://is.gd/cVy","Al Gore may still endorse one of the candidates reports CNN's Political Ticker http://twurl.nl/7jduhs","Very early exit polls out of Indiana and North Carolina show continued strong concern about the economy. http://twurl.nl/nz6mhv","John and Cindy McCain didn't vote for George Bush in 2000 says Arianna Huffington http://twurl.nl/330g30","Polls show Clinton about 5 pts ahead in Indiana http://twurl.nl/76gn7i and Obama 5-10 points ahead in NC http://twurl.nl/3dgab0","Newsweek has an article about why Oprah Winfrey left Rev. Jeremiah Wright's church. She didn't like Wright's tone. http://twurl.nl/3narrq","Barack Obama and Hillary Clinton will split Guam's delegates - each candidate picks up two delegates. http://twurl.nl/1y7q8z","CNN says Barack Obama just barely won Guam caucus. Difference was just 7 votes. http://www.cnn.com Usually Obama does better in caucuses.","Top 10 Surprising Facts About Barack Obama - Top Ten List that Barack Obama will read tonight on Letterman - http://twurl.nl/yt8wyz","Ron Paul's new book The Revolution: A Manifesto http://twurl.nl/zno0kz  is currently #1 on Amazon - via @bestsellers","Pres. Bush thinks up a way to stop Dems - send Jessica Simpson to the Democratic convention http://twurl.nl/atb6na via @celebritygossip","DC Madam commited suicide police report. Much of Palfrey's client list still secret. http://twurl.nl/83ouam","Obama on Rev. Wright: “I am outraged by the comments that were made and saddened by the spectacle that we saw yesterday.” http://is.gd/a8r","President Bush's 2009 budget will eliminate funding for the Reading is Fundamental (RIF) program http://twurl.nl/hefajs","New remarks made by Jeremiah Wright being discussed today in the political blogosphere http://twurl.nl/cfa4rr","Howard Dean says either Hillary Rodham Clinton or Barack Obama must drop out after June primaries. http://twurl.nl/3aptvw","McCauliffe saying Clinton on track to raise $10 million with 50,000 new donors since the polls closed in PA http://twurl.nl/zt0h40","On Twitter: Barack Obama just hit 25,000 followers @BarackObama and Hillary Clinton thanks Pennsylvania @hillaryclinton","Earlier, Paul Begala mistakenly said that Clinton's website was hillaryclinton.org -- was corrected by Donna Brazile (it's .com, not .org)","CNN says Clinton has raised over $2.5 million since being declared winner in PA. 80% first-time donors. http://twurl.nl/gu46s6","Fitchgate photos http://twurl.nl/w43ezk and http://twurl.nl/sqk27u via @bloggersblog","Hillary Clinton's lead looks to be holding at around 10% with 93% of precincts reporting. http://twurl.nl/tiftng","@SallieB It would be a strange thing to do on purpose. The Obama camp will probably be questioned about it.","This will probably become a story of some kind. The Obama campaign must not have noticed they all had Abercrombie & Fitch shirts on.","Buzz about the 3 guys wearing Abercrombie & Fitch shirts behind Obama during his speech http://twurl.nl/jvz4um and http://twurl.nl/uy3oer","Hillary Clinton up by 10% with 57% reporting. http://twurl.nl/hr1pnf","Fox News projects Hillary as the winner of the Pennsylvania primary. Vote data still trickling in extremely slowly.","None of the networks willing to call the Pennsylvania primary early. Still waiting for votes to start trickling in.","CNN says Hillary winning 61 percent of voters 65 and over in Pennsylvania primary. http://twurl.nl/5q2ksu","Bush polled the lowest of any American president in the 70 year history of Gallup polling. http://tinyurl.com/5eqjoo","However, late deciders broke for Clinton 58 percent to 42 percent according to CNN http://twurl.nl/k86g8a","CNN says exit polls show there 150,000 new voters in the Pennsylvania primary and 60% of these went for Obama http://twurl.nl/k86g8a","Early Pennsylvania exit poll results show 90% of Democratic primary voters believe economy is in a recession http://twurl.nl/48vufp","Pat Robertson and Al Sharpton team up for climate change video. http://twurl.nl/tlfm4n via @globalwarming","Clinton's camp denies the internal Pennsylvania poll rumor posted by Matt Drudge http://tinyurl.com/3mge27","Drudge Report says Hillary Clinton's internal polling shows she has an 11-point lead in Pennsylvania http://twurl.nl/3w3sz0","Clinton has big lead over Obama in Pennsylvania among bowlers (54% - 33%) http://twurl.nl/5ibwea","John Edwards @johnedwards hasn't updated his Twitter in over five months.","Hillary Clinton slams Democratic activists and Moveon.org at a private fundraiser http://twurl.nl/tckdxv","Barack Obama reports income of $4.2 million on his 2007 tax return via @newsalert","Hillary Clinton @hillaryclinton will be on the Colbert Report Thursday. http://twurl.nl/5w3mp2 Michelle Obama is on tonight.","US Troops suffer worst week in Iraq of 2008 - 19 GIs killed this past week http://twurl.nl/loetva","NYTimes: Barack Obama still on defensive over his remarks about small-town America http://twurl.nl/h7hdq5","Howard Dean says John McCain's age is a concern for voters http://twurl.nl/rbppcw","Sir Elton John raises $2.35 million for Hillary Clinton http://twurl.nl/vo0yth","General Patraeus says he is not likely to call for a troop buildup (a second surge) even if security detiorates http://twurl.nl/ncnev1","Barack Obama on Tuesday called for a \"diplomatic surge\" including talks with Iran http://tinyurl.com/6l4mfs","Senators Clinton and McCain question General Petraeus at Senate hearnig. http://tinyurl.com/3javzf","Hillary Clinton is calling on Bush to boycott the Olympic opening ceremony http://tinyurl.com/5a6j9f","Hillary Clinton using Twitter to raise money towards specific types of Pennsylvania advertisements @hillaryclinton","Obama spokeman says McCain is not a warmonger - follows on air comments made by liberal talk show host Ed Schultz http://tinyurl.com/4qvxcn","Michael Barone at U.S. News still thinks Hillary Clinton can win the popular vote http://tinyurl.com/34y5hy","Huffington Post: Barack Obama is talking about Republican rival John McCain while ignoring his Democratic opponent http://tinyurl.com/35kzop","Hillary Clinton @hillaryclinton made an April Fool's tweet earlier today via @bloggersblog","Al Gore - 60 Minutes: \"I doubt very seriously that I'll ever be a candidate again.\" - says he won't act as broker http://tinyurl.com/384l3o","Gallup Poll Daily tracking update has Obama back into the lead in the Democratic Race http://snurl.com/22w29","Some big Democratic donors are telling Speaker Pelosi to stay out of the Clinton vs. Obama primary battle http://tinyurl.com/2m87bd","AP story says Barack Obama is still trying to \"quell the flap\" over pastor's incendiary remarks http://tinyurl.com/32bkn4","More terrible candidate music videos: Barack Obama-sistible! http://tinyurl.com/37yfab and What Huckabee Wants http://tinyurl.com/2je85v","Senator Evan Bayh of Indiana (a Clinton supporter) suggests superdelegates consider electoral votes of each state http://tinyurl.com/2nvcay","Breaking on abcnews.com: Detroit's Mayor & former Chief of Staff charged with perjury & obstruction of justice over text-msg sex scandal.","Raining McCain: an unusual John McCain music video based on the song \"It's Raining Men\" http://tinyurl.com/3y7e6g","New Mexico Gov. Bill Richardson will endorse Obama today at a campaign event in Portland, Oregon. http://tinyurl.com/2olza4","John McCain aide suspended for circulating Obama/Wright video mashup on Twitter. http://tinyurl.com/3by2eg","Newly appointed New York Governor David Paterson admits that he and his wife had extramarital affairs. http://tinyurl.com/393zgu","Barack Obama plans to give speech tomorrow about Jeremiah Wright and about race in the presidential campaign. http://tinyurl.com/35au3s","Miami Herald says Democrats are unable to agree on a Florida do-over http://tinyurl.com/2qvj4t","Pro-Clinton bloggers abandon the Daily Kos blog in writer's strike. http://tinyurl.com/3c3j9y","Obama to Olbermann: \"I did not personally hear [Wright's] incendiary comments.... when I was sitting in the pews.\" - on MSNBC","Barack Obama tells Olbermann: \"I will not repudiate the man [Rev. Jeremiah Wright]\" - just now on MSNBC","The Reverend Jeremiah Wright has left Barack Obama's campaign in light of the controversy surrounding his sermons http://tinyurl.com/3aeaph","Barack Obama under pressure to sever ties with pastor Jeremiah Wright. Wright has referred to USA as \"US of KKK-A\" http://tinyurl.com/2vfqmf","Pentagon cancels plans to release information about study that found no link between Saddam Hussein and al Qaeda http://tinyurl.com/33m6h4","MSNBC's Keith Olbermann takes on Hillary Clinton with one of his Special Comments. http://tinyurl.com/28nxbb","ABC: Sen. Barack Obama's pastor says blacks should not sing \"God Bless America\" but \"God damn America.\" http://tinyurl.com/2unkln","Eliot Spitzer's prostitute Ashley Alexandra Dupre had a MySpace page with a song, photos and one blog post. http://tinyurl.com/3dyzg4","NBC is reporting that Geraldine Ferraro has resigned from the Hillary Clinton campaign http://tinyurl.com/2eakpg","Assisted suicide advocate Jack Kevorkian is planning to run for Congress with no party affiliation http://tinyurl.com/386msk","Early Mississippi exit polls from Fox News show Obama win - he is expected to win the state by double digits http://tinyurl.com/36gscm","Early Mississippi exit poll highlights show Barack Obama voters a bit more charitable toward Clinton than vice versa http://urltea.com/2wns","U.S. News says even a big win in Mississippi is not likely to boost Obama significantly http://tinyurl.com/2w2a8y","Fox News says Spitzer will face an indictment and is expected to resign. http://tinyurl.com/3az8qm","New York Governor Spitzer apologizes to family and public. Says politics is not about individual people. Nothing about resignation.","New York Governor about to give a press conference about his \"involvement\" with a prostitution ring. http://tinyurl.com/3az8qm","Tucker Carlson's show on MSNBC has been canceled - will remain as a political contributor to MSNBC for the election http://urltea.com/2w0p","Democrat Bill Foster takes seat vacated by former House Speaker Dennis Hastert in a special election http://tinyurl.com/2ys7sl","CNN is projecting that Barack Obama will win the Wyoming caucuses.","Obama ahead of Clinton in Wyoming caucuses 58% to 41% with 87% of precincts reporting http://urltea.com/2vny","Obama ahead of Clinton in Wyoming caucuses 58% to 41% with 65% of precincts reporting http://urltea.com/2vny","Obama ahead in Wyoming caucuses 56% to 42% with 35% of precincts reporting http://urltea.com/2vny","MSNBC is reporting that Obama adviser Samantha Power has resigned after calling Hillary Clinton a \"monster\" hat tip @newsalert","Next stop is Wyoming (this Saturday) where a total of 18 delegates are at stake for the Democratic. http://tinyurl.com/3xwgpb","Clinton has rejected the idea of holding a Michigan caucus - would disenfranchise some MI voters http://tinyurl.com/2r9rwm","New Republic says member of DNC's Rules & Bylaws Committee says Michigan will caucus. It was a primary in Jan. http://tinyurl.com/yvya93","One of Barack Obama's top advisers (Samantha Power) calls Hillary Clinton a \"monster\" http://tinyurl.com/3xljsg","Karl Rove analyzed Hillary Clinton and Barack Obama on Fox News early Monday. Raw Story has videos. http://tinyurl.com/3dtw82","Obama tells reporters he called SNL producer Lorne Michaels to complain http://tinyurl.com/2sr79e Was he joking? http://urltea.com/2ut8","President Bush formally endorsed Senator John McCain today at the White House http://tinyurl.com/25hkay","CBS News has called the Texas primary for Hillary Clinton. http://tinyurl.com/29dm63","The Texas caucuses have started reporting. Obama has a lead with 5% of that vote in. http://urltea.com/2uku","Hillary Clinton has a 45,000 vote lead with 54% of the vote counted in the Texas primary. http://urltea.com/2uku","Fox News is projecting that Hillary Clinton will win the Ohio primary.","Fox News is projecting that Hillary Clinton will win the Rhode Island primary.","John McCain wins Texas and now has enough delegates to win the GOP nomination says CNN.","Vote counts now coming from Texas as well http://urltea.com/2uku Ohio data seems temporarily stuck.","CNN is starting to show vote counts for Ohio http://urltea.com/2uko","Just Sandusky county in Ohio remains open for an extra hour. Results from rest of Ohio should start coming in around 7:30 PM EST.","CNN says Ohio polls are going to remain open until 9 pm ET (an hour longer) because of bad weather in parts of the state.","Fox News, NBC have projected Barack Obama as the winner in Vermont. McCain also won this state's primary. Both expected to win.","Vermont is likely to be called quickly for Barack Obama based on exit polls alone.","ABC says exit poll shows \"change\" beat \"experience\" again but not by as much in Wisconsin http://tinyurl.com/3beyxq","Some very early exit poll information. Lots of independents voting. Economy big concern in Ohio http://tinyurl.com/39bpy6","In Austin the Clinton campaign put the traveling press corp in the men's room next to the urinals. http://tinyurl.com/36lakr","Ohio polls showing Clinton up about 6 to 10% except for the Reuters/Zogby poll which shows a tie http://tinyurl.com/2xmr7y","Most recent polls for Texas have nudged back Clinton's way slightly but still within the margin of error. http://tinyurl.com/2fywx9","Latest polls suggest Clinton pulling away in OH but TX still too close to call http://urltea.com/2u44 More poll links http://urltea.com/2u45","Politico says http://tinyurl.com/2qk9dy the Hillaryis44 blog http://www.hillaryis44.org is run by Alex Rodriguez","Obama has spent $10 million on tv ads in Texas since early Feb and $5.3m in Ohio. Outspending Clinton about 2:1 http://tinyurl.com/33ze4t","CNN says Hillary Clinton expected to make surprise SNL appearance http://tinyurl.com/2kf5vu","Handy March 4th Chart contains delegates for March 4th contests as well as direct links to poll numbers. http://tinyurl.com/38d6va","Spanish language campaign songs: Obama's Viva Obama http://urltea.com/2rlu Hillary's Hillary Hillary Clinton http://urltea.com/2tik","John McCain accidentally called himself a \"liberal Republican\" but quickly corrected himself http://tinyurl.com/34rt8w","Clinton's African-American superdelegates say they're being threatened, harassed to get them to switch to Obama. http://tinyurl.com/2wrb5q","Senator Clinton's campaign has raised $35 million in February - Obama's camp claims they will surpass this figure http://tinyurl.com/2ykbne","New York Mayor Michael Bloomberg writes an op-ed for the New York Times - says he isn't running for president http://tinyurl.com/3xkwrl","CTV.ca says Obama senior staffer told Canadian official not to take Obama's NAFTA criticisms seriously http://tinyurl.com/2m9xas","Wall Street Journal dislikes the Patriot Employer Act, a bill Senator Obama supports http://tinyurl.com/27jnum","Barack Obama refuses to answer the 'Boxers or Briefs' question http://tinyurl.com/37apwq","L.A. Times Blog: Barack Obama's Farrakhan answer gives Hillary Clinton an opening http://tinyurl.com/2ylddl","NBC’s Brian Williams moderating Democratic debate tonight with \"Meet the Press\" moderator Tim Russert http://tinyurl.com/yw3am3","Video: McCain disavows Bill Cunningham’s “Barack Hussein Obama” rhetoric http://tinyurl.com/2a6c9x","Clinton staffers and volunteers complain http://tinyurl.com/2otrc9 about New York Times story by Patrick Healy http://tinyurl.com/2j8rxf","President Bush says he's confident the GOP will hold the White House in 2008 http://tinyurl.com/3a88ph","Egg as Peep: Mike Huckabee wants constitutional amendment to define person as a human starting with conception http://tinyurl.com/38bwnq","CNN/Opinion Research Corp. survey shows statistical dead heat in Texas for Clinton and Obama http://tinyurl.com/36f3mm","It's possible Mitt Romney could re-enter the GOP presidential race says L.A. Times Blog http://tinyurl.com/2wntls","Bloggers discussing photo that shows Barack Obama wearing Somali Elder garb from 2006 Kenya trip http://urltea.com/2saa","Hillary Clinton mocks Barack Obama during campaign rally. \"The Sky Will Open, The Light Will Come Down\" http://tinyurl.com/32254n","Saturday Night Live did a spoof of the Democratic debates last night http://tinyurl.com/38smqg","Ralph Nader has announced that he will be running for president as a third-party candidate http://tinyurl.com/34vupa","Southern Methodist University in Dallas, Texas will be the host of Bush's presidential library as expected http://tinyurl.com/2o9nzr","Politico says Barack Obama visited home of violent 60s radicals (Weather Underground) in 1995 http://tinyurl.com/2ot5zp","Democratic Debate Analysis: Hillary Clinton won: http://tinyurl.com/2ojfs3 Barack Obama won: http://tinyurl.com/3achyg","Mike Huckabee says he takes John McCain at his word - says McCain is a decent and honorable man. http://tinyurl.com/3djdvc","Obama won the Democrats Abroad primary. About 20,000 people voted. Obama won about 65 percent of the vote. http://tinyurl.com/339v2b","CNN is projecting that Illinois Sen. Barack Obama has won the Democratic caucuses in Hawaii http://urltea.com/2qw2","Results for Hawaii starting to come in. Obama has a 77% to 23% lead with 8% of precincts reporting. http://tinyurl.com/3x3gqb","Heavy turnout reported at Hawaii caucuses http://tinyurl.com/2lbpxw","CNN is projecting that Arizona Sen. John McCain will win Washington state's Republican primary. http://tinyurl.com/3xh8br","Barack Obama interrupted Hillary's speech  - accepted courtesy is to let your opponent who lost speak first http://tinyurl.com/2ohn6j","Obama now up by 15% in Wisconsin with 68% of the votes in. http://urltea.com/2qtz","Wisconsin primary results: Obama 55% Clinton 44% with 43% of the votes counted. http://urltea.com/2qtz","Obama ahead of Clinton 56% to 43% with 14% of the votes counted in Wisconsin http://urltea.com/2qtz (has already been called for Obama)","Fox News projecting Obama to win Wisconsin primary - based primarily on exit poll date.","Wisconsin voters not fans of globalization. Nearly all voters said economy is not good or in poor shape http://tinyurl.com/2n9kod","Some claiming early exit polls shows win for Obama in Wisconsin http://tinyurl.com/38bgz3 and http://tinyurl.com/364zbh","Jake Tapper from ABC News finds another incident of Deval Patrick and Barack Obama using the exact same lines http://tinyurl.com/32ha4n","Primaries in Wisconsin and Hawaii are today. http://tinyurl.com/ypbcph","Fidel Castro is stepping down as Cuba’s leader. His brother Raul Castro is expected to take over. http://tinyurl.com/3ckxh7","From the LA Times: Nearly-naked hotties for Ron Paul http://tinyurl.com/35xvjy It's about a calendar http://www.hotties4ronpaul.com","Words Matter: Does Plagiarism? Governor Deval Patrick's and Barack Obama's \"Just Words\" speeches side by side http://tinyurl.com/2veton","John McCain advisers want to use President Bush to help with fund raising but they don't want him close to McCain http://tinyurl.com/37vb6y","Politico says part of Obama's recent Wisconsin speech is similar to Deval Patrick's \"Just Words\" speech from 2006 http://tinyurl.com/2zt46w","Barack Obama had a private meeting with private meeting with John Edwards in NC earlier today http://tinyurl.com/2k2mrz","U.S. Rep. John Lewis (D-Ga.): New York Times report of delegate switch to Obama \"not accurate\" http://tinyurl.com/2tvvak","Politico says Former president George H.W. Bush will endorse Sen. John McCain in Houston on Monday http://tinyurl.com/2jfwym","Someone has made a Barack Obama lolcats website - Yes We Can Has http://yeswecanhas.com","New Rasmussen poll has Clinton up in Texas over Obama 54% to 38%. 1st Texas polling data since May, 2007. http://tinyurl.com/2fywx9","Apologies for announcing CNN won the New Mexico caucus earlier today - it was of course Hillary Clinton's win :-) http://tinyurl.com/38p9sz","Of the remaining GOP candidates Ron Paul is @ronpaul2008 Huckabee is @Huckablog and John McCain doesn't appear to have an official one.","Looks like Hillary Clinton does have an active Twitter account at: @hillaryclinton","Mitt Romney endorsed John McCain. \"This is a man capable of leading our country in this dangerous hour.\" http://tinyurl.com/35fogs","CNN has won the New Mexico caucus 73,105 votes to Obama's 71,396 http://tinyurl.com/32e25y","Ron Paul plans a grand march on Washington D.C. - its at the end of this rather long video http://tinyurl.com/39frgl","Senate Ethics Committee says that Sen. Larry Craig acted improperly in airport bathroom sex sting http://tinyurl.com/3cednq","The Associated Press says the U.S. may carry out executions (by lethal injection) at the Gitmo base in Cuba http://tinyurl.com/2wx6d6","John McCain has been announced as the DC winner. Obama and McCain have won in Maryland. http://tinyurl.com/29kkkk","CNN is projecting John McCain as the winner of Virginia - McCain eeks out a win.","Barack Obama is also being projected as the winner in the D.C. primary as expected http://tinyurl.com/29kkkk","CNN's count shows Huckabee with a slight lead over McCain in Virginia - but only 13% of the vote is in http://urltea.com/2ozd","CNN projects that Obama will win Virginia.","Exit poll data from Fox News suggests there may be a very close race between Huckabee and McCain in Virginia http://tinyurl.com/ywdhk8","New Survey USA poll for the crucial state of Ohio has Hillary Clinton up 56% to 39% over Obama.  http://tinyurl.com/3976fj","Weather may make it more difficult for people to get to polls in Maryland, Virginia and Washington D.C. today. http://tinyurl.com/2s9yvk","Video: Mike Huckabee explains his Texas strategy to Stephen Colbert. The Texas primary is March 4th. http://tinyurl.com/2ufgn5","Hillary Clinton met with John Edwards on Thursday. Obama's meeting with Edwards for today was canceled or postponed -- no one's talking.","John.he.is - funny video shows supporters attempting to make music video for McCain but are shocked by his words http://tinyurl.com/3y6tg4","Hillary card pulled from Upper Deck political card set - Upper Deck had cast her as Morganna the ‘Kissing Bandit’ http://tinyurl.com/2zld6f","Obama won a Grammy for his audio book version of his bestseller, \"The Audacity of Hope\" http://tinyurl.com/3xge37","NBC News is now projecting Barack Obama to win the Maine caucuses.","Barack Obama has 15% lead in Maine caucuses with 58% reporting. http://tinyurl.com/3xvowh","New Iraqi flag (purged of Saddam references) flies in Kurdish area of Iraq for the first time. http://tinyurl.com/3a5cve via @newsalert","Mike Huckabee has won Louisiana after a close battle there with John McCain for his second victory of the night.","Barack Obama sweeps as expected. http://tinyurl.com/3xfqp6 Huckabee wins Kansas and has lead in Louisiana and Nebraska.","McCain and Huckabee in close battle in both Louisiana and Nebraska - surprisingly good night for Huck so far http://www.politico.com","Obama wins Nebraska and Washington and has edge in Louisiana primary http://www.politico.com","Mike Huckabee on delegate math: \"Well, I didn't major in math, I majored in miracles. And I still believe in those, too.\"","Kansas Republican presidential caucuses: Huckabee 61% McCain 24% Ron Paul 11% http://tinyurl.com/3xfqp6","NBC is projecting Mike Huckabee as the winner of Kansas GOP caucus.","NBC has suspended David Shuster for his derogatory comments about Chelsea Clinton http://tinyurl.com/2nozmz","Hillary Clinton furious at MSNBC: anchor said Clintons had \"pimped out\" their daughter Chelsea http://tinyurl.com/2ot5tz","Washington Gov. Chris Gregoire has endorsed Barack Obama. The State of Washington is voting tomorrow http://tinyurl.com/3xxtya","Cheney's response when asked if he would still support waterboarding decision today: \"You're damn right I would.\" http://tinyurl.com/3742n4","BBC picks up Romney dropping out news. McCain's two remaining challengers: Mike Huckabee and Ron Paul http://urltea.com/2nv2","Romney may be quitting the race for President. Time says Withdrawal could come at CPAC speech at 12:15 pm ET http://tinyurl.com/24yfyk","Clinton & McCain lead post Super Tuesday Gallup poll Clinton 52, Obama 39 & McCain 41, Romney 25, Huck 21 http://urltea.com/2no8","Hillary Clinton takes a narrow lead in New Mexico count with 98% of the votes in  http://urltea.com/2nma","CNN just called California for Hillary Clinton.","AP may have called Missouri for Clinton too soon as Obama is now ahead with 97% of the vote in http://urltea.com/2nfc","The Associated Press says Clinton has won the Democratic primary in Missouri. CNN still waiting for more numbers http://urltea.com/2nf8","CNN projects Mike Huckabee winner of Georgia GOP primary.","NBC News declares Hillary Clinton the winner of Arizona.","CNN projects McCain the GOP winner of his home state Arizona.","CNN projects that Mike Huckabee will win the Alabama GOP primary.","Barack Obama doing well in caucuses so far tonight North Dakota, Kansas, Idaho but losing bigger states to Clinton http://urltea.com/2ndv","MSNBC is calling Oklahoma for John McCain http://www.msnbc.msn.com/","NBC News has called Alabama for Barack Obama. http://www.msnbc.msn.com/","CNN projected Obama the Delaware winner and Fox has projected Hillary the winner of Massachusetts and New Jersey","Actual voting results starting to trickle in on CNN - at least for Georgia. More states will start reporting at 7pm http://urltea.com/2ndv","CNN calls Georgia for Barack Obama http://urltea.com/2ndl","A Townhall blog has a \"big pile of exit poll data\" for the GOP races in several states http://tinyurl.com/2jnj2a","Early exit polls: Clinton leading among white women and hispanics; Obama leading among men and blacks http://tinyurl.com/2rbqnz","Exit polls say economy, change, endorsements important to Massachusetts voters http://tinyurl.com/2s6kf4","AP has some preliminary results of today's exit polls - when they decided, demographics - not who they voted for - http://urltea.com/2ncy","Hillary Clinton has agreed to appear in a Fox News debate on February 11th in Washington, DC http://tinyurl.com/39lnmt","Mitt Romney accuses McCain of \"backroom deal with the tax-and-spend candidate\" on Huckabee's West Virginia win http://tinyurl.com/3azj4l","Celebrity gossip bloggers making endorsements - Perez Hilton endorses Hillary Clinton http://tinyurl.com/39v5sv via @celebritygossip","Jack Nicholson is making robocalls for Hillary Clinton today - video clip containing the audio mesage http://tinyurl.com/2od3wy","Mike Huckabee wins West Virginia's 18 delegates after strategic maneuver by John McCain http://urltea.com/2nbq","Polls puzzle as Super Tuesday nears - McCain appears headed for a big win. Polls show Obama bounce but is it real? http://urltea.com/2n5h","California results could be delayed until Wednesday because of paper ballots in some areas and big turnout http://tinyurl.com/2m5vxf","Hallmark gets political - releases a line of humorous political cards http://tinyurl.com/2m96jh","Philip Shenon book says 9-11 commission head Philip Zelikow had closer ties to White House than publicly disclosed http://urltea.com/2mvo","Bush proposes $3 trillion budget - Democrats pledge fierce opposition http://tinyurl.com/2ph43o","Romney wins Maine caucuses - Romney 52% McCain 21% Paul 19% Huckabee 6% http://tinyurl.com/2r9gj2","Super Tuesday Chart: Lists # of delegates available in each state and provides links to latest poll information http://tinyurl.com/2omsvx","Super Bowl beats Super Tuesday by a field goal in odd poll to see which event people are more excited about http://tinyurl.com/2myf5u","Members of MoveOn have endorsed Barack Obama http://tinyurl.com/3ybr6r","Analysis of last night's debate - McCain stumbles, Ron Paul mentions Reagan campaigned for him http://tinyurl.com/2x9k66","The Ron Paul blimp has been grounded due to lack of funding. http://tinyurl.com/335xp7","Democrat John Edwards is dropping out of the presidential race - he will make an announcement at 1PM EST http://tinyurl.com/27qohv","Hillary Clinton crushes Obama in Florida: 856,944 (50%) to Obama's 568,930 (33%) - the State's delegates are being withheld by the party.","John McCain is being projected as the winner of the Florida primary by AP, CNN, etc. He will get all 57 Florida delegates with the win.","Time magazine blog says Rudy Giuliani expected to drop out and endorse McCain, as early as Wednesday http://tinyurl.com/yqbfpt","Exit Poll: 43% said Governor Charlie Crist's endorsement of John McCain mattered to them http://tinyurl.com/2seca9","Early Florida results (about 7% in) show Clinton well ahead of Obama for Dems and Romney and McCain in very close race for 1st for GOP.","NRO's The Campaign Spot has some early exit poll results that show John McCain ahead - shows a close race http://tinyurl.com/ys3jae","Some early exit poll details from Florida on the older voting demographic and opinions on the economy http://tinyurl.com/2qnuqx","Sen. Barack Obama snubs Hillary Clinton at SOTU last night  - turns his back on her. Photo: http://tinyurl.com/yqthmk","New York chapter of the National Organization of Women slams Ted Kennedy over his Obama endorsement http://tinyurl.com/2lm6yv","Senator Edward M. Kennedy is set to endorse Senator Barack Obama today http://tinyurl.com/37muc9","In South Carolina, Obama won 81% of all the African American vote, but only 24% of the white vote http://tinyurl.com/2okqet","Florida Governor Charlie Christ has endorsed John McCain just a few days from the Florida primary on 1-29-07 http://tinyurl.com/2w6ap8","Media outlets waste no time declaring Barack Obama the winner of the South Carolina primary based on exit polls.","John McCain accuses Mitt Romney of wanting to set a timetable for withdrawal from Iraq. Romney denies accusation. http://tinyurl.com/2n7aqf","Bill Clinton says John McCain & Hillary are very close - promises most civilized election in US history if both win http://urltea.com/2kx6","Democrat Dennis Kucinich is abandoning his bid for the White House http://tinyurl.com/2k365f","Duncan Hunter endorses Mike Huckabee surprising some conservatives http://tinyurl.com/2dtatw","Al Gore endorses gay marriage. Political pundits are trying to figure out what it all means. http://tinyurl.com/3x9vx8","Study finds Bush administration made 935 false statements preceding Iraq War - just 65 more and they'd have 1000 http://tinyurl.com/35moq3","Fred Thompson has dropped out of the race for the GOP nomination for president http://tinyurl.com/2jowt9","Maya Angelou has written a prose poem in honor of Hillary Clinton's candidacy for President. http://tinyurl.com/2vy728","McCain is being projected as the winner of a very close primary in SC - McCain 33% Huckabee 30% with 91% in.","McCain is edging Huckabee by 3 or 4% in the SC primary with about 70% of the votes in but it is still too close to call http://politico.com","Sen. Hillary Clinton wins the Nevada caucuses http://tinyurl.com/2bkx99 GOP South Carolina results start coming in this evening.","Nevada entrance polls show Hillary Clinton with the lead over Obama http://urltea.com/2jns","Some GOP results for Nevada starting to come in http://urltea.com/2jn4","Associated Press, NBC are calling Nevada for Mitt Romney although the votes are not in yet. http://tinyurl.com/2neyet","Mitt Romney and Associated Press reporter get into heated exchange over lobbyists http://tinyurl.com/2sx4wh","US judge rules that Las Vegas casinos can be used by Nevada Democrats for presidential voting on Saturday. http://tinyurl.com/39cgbw","McCain-Lieberman? John McCain thinks Sen. Joe Lieberman would make a \"great partner\" http://tinyurl.com/2euvrb","A former GOP congressman has been charged of of working for an alleged Al-Qaeda fundraising ring http://tinyurl.com/2w69w2","Mich. GOP congratulates wrong candidate - they announced McCain had won the MI primary instead of Mitt Romney http://tinyurl.com/38vu4n","Drudge Report says Michigan primary Exit Polls show Mitt Romney ahead: Romney 34, McCain 29, Huckabee 16 http://www.drudgereport.com","Exit polls indicate that half of Michigan voters pick the economy as the #1 issue facing the country http://tinyurl.com/2ghern","Latest Zogby poll shows McCain and Romney in a tight race as Michigan residents vote in the MI primary http://tinyurl.com/3xvogp","Fliers for Democratic candidate Barack Obama say \"You Can Be A Democrat for A Day.\" http://tinyurl.com/39ehpv","Threats to U.S. ships in the Strait of Hormuz may have come from a ham radio heckler called \"Filipino Monkey\" http://tinyurl.com/33mk4f","Fox News says Al Qaeda building a white army of terror. MI5 claims Al Qaeda has 1,500 caucasian terror converts http://tinyurl.com/2phba2","Lou Dobbs criticizes media on Daily Show for relying too much on polls and for not focusing on issues http://tinyurl.com/3czvdm","Video: Fred Thompson is the Boogie Woogie President of 2008 http://tinyurl.com/2anqfn","Mike Huckabee tells Joe Scarborough that Fred Thompson needs some Metamucil http://tinyurl.com/38fcuv","John McCain and Mitt Romney in very close race in Michigan. Polls suggest Huckabee is in 3rd. Primary is the 15th http://tinyurl.com/2nts5c","President Bush says that if he were running for office now he would also be \"an agent of change.\" http://tinyurl.com/2uqspk","Analysis: Republican Primary Debate: Gates of Hell edition - Mike Huckabee gets tap dancing award of the evening http://tinyurl.com/3at5b9","List of presidential candidates with Twitters: Obama, Edwards, Thompson, Ron Paul have most followers http://tinyurl.com/3anrkg","Roll Calls' Mort Kondracke says Obama needs to answer Walter Mondale's '84 taunt of Gary Hart \"Where's the Beef?\" http://tinyurl.com/2unjpx","Karl Rove, now writing for the Wall Street Journal, explains how he thinks Hillary Clinton won Iowa http://tinyurl.com/29ex55","New Mexico Gov. Bill Richardson has decided to end his campaign for U.S. President http://tinyurl.com/2povmr","CNN and the Associated Press have also called NH for Hillary Clinton.  Clinton and John McCain are tonight's NH primary winners.","MSNBC is calling the New Hampshire primary for HIllary Clinton. CNN still waiting on results from more counties. http://tinyurl.com/35rzfv","Barack Obama owes a lot of gratitude to Jeri Ryan for his meteoric rise in politics http://tinyurl.com/37cj3n","High turnout is causing ballot shortages in some New Hampshire towns -  warm day may be helping with turnout http://tinyurl.com/2fojjk","Hart's Location, NH votes - GOP McCain 6, Huckabee 5, Ron Paul 4, Romney 1 | DEM Obama 9, Clinton 3, Edwards 1","Dixville Notch, NH votes - GOP McCain 4, Romney 2,  Giuliani 1 | DEM Obama 7 Edwards 2 Richardson 1","A site that showcases political tweets for the different candidates http://politweets.com via @bloggersblog","Two small New Hampshire towns cast midnight votes - rest of the state votes tomorrow between 6 am & 8 pm http://tinyurl.com/2dsmhh","Fox is blocking GOP candidate Ron Paul from attending its debate tonight so Ron Paul is putting on his own show. http://www.ronpaul2008.com","Wyoming GOP results with 8 of 12 precincts reporting: Romney 6 delegates (75%), Hunter 1 (13%), Thompson 1 (13%) http://tinyurl.com/33chlb","First Wyoming delegate goes to Mitt Romney as results start coming in from Wyoming's quiet primary http://tinyurl.com/33chlb","Republicans having trouble counting in Iowa? Results stuck at 95% reporting http://urltea.com/2gye","Obama and Huckabee win Iowa caucuses -- what's it all mean? http://tinyurl.com/3cgvgf","Obama breaks out of the 3-way tie to win Iowa.  Ron Paul a big GOP surprise with 10% http://www.politico.com","Huckabee wins Iowa for GOP. Results for the Democrats are still tightly bunched around Obama, Clinton and Edwars http://tinyurl.com/2m8jtd","Voting is about to start in Iowa http://tinyurl.com/34h3mc You can see some of the latest poll results here http://tinyurl.com/2vc8g8","Learn how the Iowa caucuses work.  They function differently for both parties. http://tinyurl.com/2r3v8m","Hillary Clinton to appear on Letterman tonight. Unclear if Huckabee will be on Leno's show. http://tinyurl.com/2jlovs via @writersstrike","The Justice Department has opened a criminal investigation into the destruction of CIA interrogation videotapes http://tinyurl.com/2vw2fb","New York Post says candidates spending $50 million in Iowa which translates to about $200 per vote http://tinyurl.com/3y3yd8","Fred Thompson took New Year's Day off from campaigning to watch football http://tinyurl.com/3yakwr","Huckabee holds press conference about negative Romney ad - won't air ad on tv but plays ad for the media http://tinyurl.com/2vyxj8","Calendar that counts down the days until the end of the Bush Administration is a bestseller http://tinyurl.com/2ru8j7","Alan Colmes launches a blog called LiberalLand http://tinyurl.com/3bnxg8","Fred Thompson's poll numbers slipping as he struggles to stay in the GOP race http://tinyurl.com/2vzgj7","Did Bush know about the CIA interrogation tapes? Claims he didn't know of them until after they were destroyed http://tinyurl.com/3dgwpk","Colorado's secretary of state has declared many of the state's electronic voting machines to be unreliable. http://tinyurl.com/2s4xrg","Ron Paul raised over $6 million in a single day http://tinyurl.com/33pycy","A truck laden with explosives has blown up near a dam in Iraq that is said to be at risk of imminent collapse http://tinyurl.com/2jl5ka","A record number of U.S. soldiers - 109 - have killed themselves in 2007. http://tinyurl.com/2vws5b","Conyers requests Justice Department information on alleged Halliburton rape case cover-up http://tinyurl.com/235p46","No Booze for Bush: President Bush talks about how he overcome whiskey by quitting cold turkey http://tinyurl.com/3arwne","Mitt Romney’s presidential campaign plans to run ads targeting Huckabee on immigration http://tinyurl.com/2vvt4c","Pentagon will be tossing out mail addresed to \"Any Wounded Soldier\" http://tinyurl.com/2b2fgv","Debt climbing $1 million a minute. By the time Bush leaves office, debt will no longer fit on Times Square sign http://tinyurl.com/3x5v59","The State Department not only has a blog called Dipnote but they also have a Twitter @dipnote http://tinyurl.com/34wn6t - via @bloggersblog","Karl Rove claims Congress rushed the vote on the Iraq War but transcripts show Bush arguing against a vote delay http://tinyurl.com/2oglz4","Hostage drama continues at Clinton's Rochester office - 1 hostage still being held by suspect with mental illness http://tinyurl.com/2r9kl6","YouTube has posted the 34 question and answer videos from the Republican CNN YouTube Debate http://www.youtube.com/republicandebate","Federal prosecutors withdraw subpoena seeking identities of thousands of Amazon.com customers http://tinyurl.com/2pmwvl","Minority whip Trent Lott says he will leave Senate before end of the year http://tinyurl.com/2qhxea","Vice President Dick Cheney found to have irregular heartbeat during doctor's visit says MSNBC http://urltea.com/qd via @newsalert","Over 20,000 U.S. troops with brain injuries were left off the Pentagon's tally of injured troops http://tinyurl.com/3yaq7m","GOP candidate Fred Thompson accuses Fox News of skewing things against him http://tinyurl.com/3yjthx","As Australian Prime Minister Rudd promises to remove Australian combat troops from iraq and sign Kyoto treaty http://tinyurl.com/2kb5al","Australian Conservative Prime Minister John Howard defeated by left-leaning Kevin Rudd. http://tinyurl.com/2kb5al","New Hampshire has set its primary for January 8, 2008 http://tinyurl.com/2npqz7","Former White House press secretary Scott McClellan's new book says Cheney and Bush lied about Plamegate http://tinyurl.com/39ko94","Oprah Winfrey is said to be planning to hit the campaign trail and stump for Barack Obama http://tinyurl.com/3xhwtk","Senator Fred Thompson sliding in New Hampshire polls - latest poll even has Ron Paul ahead of him http://tinyurl.com/yt4osf","Bush's homeland security adviser Fran Townsend has resigned http://urltea.com/24ro","Popular on YouTube - video of Spain’s King Juan Carlos telling Venezuela president Chavzez to shut up http://urltea.com/24rn","Newsweek signs both Karl Rove and Daily Kos' Markos Moulitasas as columnists http://tinyurl.com/yws7z3","\"Let Down\" The co-hosts of Fox and Friends were saddened by the news that suitcase nukes are not possible http://tinyurl.com/2agy4o","Politicians ponder what to do about the writers strike http://tinyurl.com/32y9xa More strike scoop @writersstrike","Interrogation expert Malcolm Nance says water boarding is \"torture\" and \"drowning\" http://tinyurl.com/2jyobw","President Bush and German Chancellor Angela Merkel vow diplomatic solution to Iran's nuclear program. http://urltea.com/2279","President Bush played video war games with injured troops http://tinyurl.com/2msbk6","Senator overrides Bush's veto of the Water Resources Development Act  http://tinyurl.com/2tqvv2","Gallup Poll finds that President Bush has topped Nixon in unpopularity. http://tinyurl.com/35vno3","GOP candidate Ron Paul raises over $3.5 million in a single day http://tinyurl.com/32bebg","Fred Thompson doubts he will become president http://tinyurl.com/yov98w Could Fred get a round of applause please? http://urltea.com/20ed","2007 has also already been the deadliest year in Afghanistan for U.S. soldiers http://tinyurl.com/vpmoq","2007 has already been the deadliest year of the Iraq War for U.S. soldiers in Iraq http://tinyurl.com/32dzra","Stephen Colbert drops White House bid. \"I have chosen not to put the country through another agonizing Supreme Court battle,\" Colbert said","Fred Thompson's drug dealing aide Phil Martin resigns http://urltea.com/202v","New Twitter for breaking news stories @newsalert","Hannity says Halloween = liberal holiday \"teach[es] kids to knock on other people's doors and ask for a handout\" http://urltea.com/1zd4","President Bush renews plea for his Attorney General pick Mukasey to be confirmed http://tinyurl.com/394hqe","President Bush faces a new showdown with Congress on a revised version of the children's healthcare bill http://tinyurl.com/2yfymw","South Carolina Democratic Party votes to keep Stephen Colbert off the ballot http://tinyurl.com/3yy38p","Hundreds of US diplomats are refusing Iraq postings http://tinyurl.com/2qkp6q","ABC News has obtained the text of the Blackwater immunity deal http://tinyurl.com/yvs3y9","The largest dam in Iraq is at risk of an imminent collapse which could kill hundreds of thousands http://tinyurl.com/279s3o","CNN is reporting that Blackwater guards were offered immunity by the U.S. http://tinyurl.com/2j3ruo","Director of Public Affairs responsible for FEMA's recent faked news conference gets a big promotion http://tinyurl.com/27ogpv","FEMA held a totally fake news conference about the about the Southern Calfornia wildfires on Tuesday http://tinyurl.com/39ky9v","Carnegie Mellon study of most 100 informative blogs seems to rank conservative blogs higher than liberal blogs http://tinyurl.com/36uqgo","White House muzzles CDC Director Dr. Julie Gerberding on global warming related health risks http://tinyurl.com/3cqqgm","GOP candidate Fred Thompson refers to the insurgents in Iraq as a \"bunch of kids\" http://tinyurl.com/37jgtv","Another supposed audio tape from Osama Bin Laden. This one calls for Iraq fighters to unite against U.S. http://tinyurl.com/3ynuh7","Raw Story article says Cheney may be behind an Israeli air strike hit a nuclear facility in September http://tinyurl.com/2vfkfu","Senator Dodd to put hold on bill that grants retroactive immunity to telecoms that helped Bush in domestic spying http://urltea.com/1t87","Bush's approval rating falls to just 24%.  Congress at only 11%. http://tinyurl.com/yun6e7","Pakistan: Two bombs hit crowds greeting returning Pakistani ex-PM Benazir Bhutto http://tinyurl.com/259fhy","Son of Deliverance author compares the Iraq War to the movie and Dick Cheney to Lewis Medlock http://tinyurl.com/2qo4st","3 days ago Bush's counterterrorism chief said Iraq War hasn't made US safer from terrorism. Now he has resigned. http://urltea.com/1sua","Lynne Cheney digs deep into her family tree and finds that Barack Obama and Dick Cheney are cousins. http://tinyurl.com/2t7vby","Reuters says Turkey will grant troops permission to enter Northern Iraq http://tinyurl.com/2u7p3e","Rudy Giuliani takes alien invasion question. Says we will be prepared http://tinyurl.com/3d9b58","Turkish government to seek parliamentary approval for a military op against Kurdish rebels in northern Iraq http://tinyurl.com/2s5t5c","U.S. Military believes it has dealt \"devastating and perhaps irreversible blows\" to Al Qaeda in Iraq. http://tinyurl.com/2ssg25","Blackwater drew weapons on U.S. soldiers in one incident reports Newsweek http://tinyurl.com/2aa6t8","Sanchez, former U.S. commander in Iraq, calls Iraq War \"nightmare with no end in sight\" Blasts Bush admin. http://urltea.com/1qq8","Al Gore wins Nobel Peace Prize http://tinyurl.com/2ndo5e Pundits already asking \"will he run?\" question again. http://tinyurl.com/27cswx","Arrested teen owned a copy of The Anarchist Cookbook - also had bomb making materials http://tinyurl.com/36bnw6","Dan Bartlett has tough words for GOP candidates Romney, Thompson and Huckabee http://tinyurl.com/yqjrox","Bush administration denies leaking Osama bin Laden video obtained by a private terrorism monitoring group http://tinyurl.com/338sad","Fred Thompson tries to set the bar low for today's debate http://tinyurl.com/2lvvqz","GOP candidate Ron Paul raises impressive $5 million in third quarter http://tinyurl.com/3abusf","President Bush says rumors administration is planning to bomb Iran are \"empty propaganda\" and \"baseless gossip.\" http://tinyurl.com/33rokk","More accusations against security firm Blackwater USA - crushed car with kids to avoid traffic http://tinyurl.com/2awoo5","Congress vows to override Bush's veto of legislation that would expand health insurance coverage for poor children http://urltea.com/1ojh","Clinton has 33-point lead over Obama according to latest Washington Post/ABC News poll http://tinyurl.com/2kv56y","Bush vetoes bill that would let cigarette taxes pay for children's healthcare. Bill had major bipartisan support. http://tinyurl.com/2pow86","Unhappy religioius right leaders making plans to support a third party candidate http://tinyurl.com/248u6f","The U.S. State Department launches a blog called Dipnote http://tinyurl.com/34wn6t","Seymour Hersh says Iran War still on. Says Bush will say war needed to protect US troops in Iraq. http://tinyurl.com/2f89vw","New York Mayor Michael Bloomberg said he never considered running for president. http://tinyurl.com/2rlpvn","Rush Limbaugh spins up phony story to defend his \"phony soldiers\" radio comment http://tinyurl.com/33j6w2","Iran's parliament approves a nonbinding resolution labeling the CIA and the U.S. Army as \"terrorist organizations\" http://urltea.com/1m90","Radio talk show host Rush Limbaugh under fire for referring to troops who want to leave Iraq as \"phony soldiers\" http://tinyurl.com/39sesf","Cholera spreading in Iraq. WHO reports 600+ new cases in past week. Travel restrictions likely to be imposed. http://tinyurl.com/2r3mbx","Bill Clinton rips GOP's criticism of General Betrayus ad with memories of the \"Swift Boat\" advertisements. http://tinyurl.com/33b9w7","PBS says soldiers' weapons in Iraq are \"plagued with problems\" http://tinyurl.com/yvg8kz","Iranian President Mahmoud Ahmadinejad says there are no homosexuals in Iran. http://tinyurl.com/2t775c","Blackwater, a company which provides security in Iraq for US diplomats, denies accusations of weapons smuggling http://tinyurl.com/2uhyzq","Hillary Clinton laughs at Chris Wallace's questions on Fox News Sunday http://tinyurl.com/3dakyf","President Bush says he will veto bill that lets a cigarette tax hike pay for some children's health insurance. http://tinyurl.com/3yl2cn","An outbreak of cholera has spread from northern Iraq to Baghdad. 1,500 infections. http://tinyurl.com/2kxsa2","Bush said to be scared of horses. Former Mexican President Vicente Fox says Bush is a \"windshield cowboy\" http://tinyurl.com/ysbcll","President Bush met with some bloggers last week after his Iraq War speech http://tinyurl.com/38v2nr","Defense Secretary Gates says he doesn't know if the Iraq War has been worth it. http://tinyurl.com/3bjh2a","Darth Cheney: Hillary Clinton refers to Vice President Dick Cheney as Darth Vader http://tinyurl.com/2vsmwb","Republicans block Democratic bill that would have given US troops in Iraq more home leave. Bush opposed the bill. http://tinyurl.com/33vcnm","29 percent approval rating is President Bush's worst Zogby poll performance http://tinyurl.com/2f9cny","Disruptive A University of Florida student tasered during John Kerry speaking event  http://tinyurl.com/2dq6sj","Iraq bans security firm Blackwater USA from the country after shoot-out in Baghdad kills civilians. http://tinyurl.com/ypynqz","President Bush names retired New York Federal Judge Michael Mukasey as Attorney General. http://tinyurl.com/2m95tr","Republican Senator Chuck Hagel calls President Bush's Iraq policy a \"dirty trick\" http://tinyurl.com/2o5n26","Alan Greenspan slams Bush administration and Republicans but praises Bill Clinton's economic policies in new book http://urltea.com/1htq","MoveOn.org has a new betrayal ad following \"Betray Us\" add about Gen. David Petraeus http://tinyurl.com/2p2ugj","Slate article says President Bush's Iraq speech last night was full of deception and fantasy http://tinyurl.com/393r9b","Fred Thompson tells interviewer he can't recall details of Terri Schiavo right-to-die case http://tinyurl.com/284f7q","Mother of a soldier who died in Baghdad vehicle accident weeks after co-writing NYTimes op-ed wants explanation http://tinyurl.com/36ruee","The Other Surge: There has been a sharp increase in contributions from the military to Democrats http://tinyurl.com/2okta9","CNN identifies mystery 9/11 plane spotted over the White House as the military's \"Doomsday Plane\" http://tinyurl.com/ywqu32","Key Iraqi Sunni ally who met with President Bush last week has been killed in a bomb attack http://tinyurl.com/34mrrb","Harry Reid says he will block former Solicitor General Theodore Olson from becoming attorney general http://tinyurl.com/29f7ef","Fox News says U.S. officials are crafting an Iran bombing plan http://tinyurl.com/yw4mhz","President Bush to announce to tell nation that he plans small number of troops cuts if certain conditions are met http://urltea.com/1gop","Cambridge University engineer creates theory to explain why twin tower collapse looked like controlled demolition http://urltea.com/1gip","Iraqi reporter says things are much worse in Baghdad today http://tinyurl.com/yvqroh","Anti-war activist Cindy Sheehan was arrested today at the Petraeus hearing http://tinyurl.com/354b9e","The Pentagon is planning to build a base near the Iraq-Iran border http://tinyurl.com/25d4wm","Fred Thompson bewilders Iowans by insisting Al Qaeda smoking ban was one reason Iraqis bolted to the U.S. side http://tinyurl.com/3bmcka","Bush says he \"finds it interesting\" that Osama Bin Laden mentioned Iraq in his latest video. http://tinyurl.com/2kxpdz","Return of Paper Ballots? Congress is considering the return of good old fashioned paper ballots for next election. http://urltea.com/1fre","Chuck Hagel will announce Monday that he is retiring from the U.S. Senate. He is also not running for president. http://tinyurl.com/yrqlx3","Bin Laden talks of taxes, democrats, Hiroshima. Says Islam better than the \"impotence of the democratic system\" http://tinyurl.com/2poxrx","Al Qaeda Website claims Osama bin Laden will soon send a video message to America http://tinyurl.com/2u5shs","Salon article says that Bush knew Saddam had no weapons of mass destruction http://tinyurl.com/yvprga","A federal judge struck down parts of the revised Patriot Act on Thursday http://tinyurl.com/359ffv","Ron Paul wins the \"text message vote\" at the Fox News GOP debate. http://tinyurl.com/2uscsa","Fred Thompson to announce his decision to run for president on Jay Leno http://tinyurl.com/2lbsc4","Bush tells Australian Deputy Australian Prime Minister that we are \"kicking ass\" in Iraq. http://tinyurl.com/39wpho","B-52 blunder: A B-52 bomber flew across the USA recently unintentionally loaded with nuclear weapons http://tinyurl.com/2jktau","Sen. Larry Craig is reconsidering his decision to resign http://tinyurl.com/39n8v4","The Times Online reports that the Pentagon has a \"three-day blitz\" plan for Iran http://tinyurl.com/25cu6n","Moving towards a national primary? Michigan has announced that it will move its primary up to January 15, 2008. http://tinyurl.com/353uy4","Surge failing 13 of the 18 benchmarks according to Government Accountability Office report. http://tinyurl.com/2e2bd4","Senator Craig also denied he had sexual relations with underage pages during the 1982 page scandal http://tinyurl.com/2qjny7","Raw Story article cites report indicating US is preparing 'massive' military attack against Iran http://tinyurl.com/2trkma","News station reenacts scene where Senator Craig tried to solicit sex from undercover officer in airport bathroom http://tinyurl.com/33e26z","Details of Sen. Larry Craig's (R-Idaho) arrest for \"lewd conduct\" here in Roll Call http://tinyurl.com/2pkzf6 (slow loading due to traffic)","Sen. Larry Craig (R-Idaho) was arrested for \"lewd conduct\" at the Minneapolis-St. Paul International Airport in June http://urltea.com/1c1h","Homeland Security Secretary Michael Chertoff rumored as possible replacement for Gonzalez http://tinyurl.com/2xjxna","Attorney General Gonzalez has formally announced his resignation after months of complaints about him. http://tinyurl.com/3c7dxj","L.A. Times says Marine Gen. Peter Pace is likely to call for significant troop cuts in Iraq http://tinyurl.com/2kaetb","U.S. has 24,500 detainees in Iraq. 85% of the detainees are Sunni. http://tinyurl.com/yothzt","President Bush trying to turn conventional wisdom about the Vietnam War on its head http://tinyurl.com/34syms","Pentagon to fall about 2,000 short of its goal of sending 3,500 armored vehicles to Iraq by the end of this year. http://tinyurl.com/2vemf2","Taliban chief says Bin Laden is \"extremely healthy and active\" http://tinyurl.com/35ylk4","Former CIA officer Bob Baer claims the U.S. will attack Iran within six months http://tinyurl.com/ynu5n4","Blogger files FEC complaint against Fred Thompson. Good roundup of the reaction to this here http://tinyurl.com/334edh","FBI Director Robert Mueller's notes confirm Ashcroft was pressured by Card and Gonzales while he was hospitalized http://urltea.com/19u5","Vice President Cheney's office says it has dozens of documents about the warrantless surveillance program http://tinyurl.com/37m8fv","Fred Thompson wears Gucci loafers to Iowa State Fair http://urltea.com/19tv","Billiam the Snowman and the Republican YouTube Debate http://tinyurl.com/36sdbp","White House spokesman Tony Snow to step down http://urltea.com/191k","Anti-bush lyrics from Pearl Jam at Lollapalooza censored by AT&T http://tinyurl.com/2sd344","White House may block US Iraq General David Petraeus and US Iraq Ambassador Ryan Crocker from testifying publicly http://urltea.com/18mo","GOP candidate Fred Thompson plans to \"step on political toes\"  http://urltea.com/18ml","Pakistan apparently helped arm and support the Taliban http://urltea.com/18mj","Bush administration to designate Iran's entire 125,000-strong Republican Guard as terrorists. http://urltea.com/182a","Neoconservative Bill Kristol puzzled by Karl Rove's resignation http://urltea.com/17za","Video clip from 1994 shows that VP Dick Cheney was well aware that invading Iraq could turn into a quagmire http://urltea.com/17lj","Barack Obama statement on Karl Rove. http://urltea.com/17li Obama says Rove's strategies left the country more divided.","Anti-war protesters topple Cheney effigy statue near Dick Cheney's home in Wyoming http://urltea.com/17le","Karl Rove resigns and will leave the White House this month. \"I just think it's time,\" Mr Rove said. http://urltea.com/17h7","Iowa Straw Poll results: Mitt Romney 32%, Mike Huckabee 18%, Sam Brownback 15%, Tom Tancredo 14%, Ron Paul 9% http://urltea.com/178s","Blogger liveblogging from Iowa Straw Poll: http://cycloneconservatives.blogspot.com","Ron Paul supporters may catch a ride to Iowa Straw Poll on Romney's bus http://urltea.com/175x","Eleanor Clift asks if Newt Gingrich is posed for a comeback. http://howtoweb.com/z/t13","US Republican party candidates compete in the Iowa Straw Poll tomorrow http://urltea.com/1719","China threatening devaluation of U.S. dollar. We borrowed billions from China to fund the Iraq War http://urltea.com/1718","Bush war advisor Army Lt. Gen. Douglas Lute says return to a military draft worth considering. http://urltea.com/1717","True or False: Army says Baghdad Diarist accounts false but New Republic editor Franklin Foer is standing his ground http://urltea.com/16dn","Iraq's national power system reported to be on the brink of collapse http://tinyurl.com/2tcpek","1,001 civilian contractors have been killed in Iraq the Labor Department reports. Another 4,837 have been injured.http://urltea.com/1652","New USA Today/Gallup Poll shows Hillary Clinton with a 22-point lead over Obama http://urltea.com/15pm","Democrats introduce resolutions to censure Bush, Cheney and Gonzales http://urltea.com/15op","Guiliani's daughter found supporting Barack Obama on Facebook http://urltea.com/15o4","Missing Weapons: US military can't account for 190,000 AK47 assault rifles & pistols given to Iraqi security forces http://urltea.com/15l9","Afghan Poppy Boom: Soaring poppy harvest in Afghanistan continue as another record poppy harvest is reported http://urltea.com/154y","Hillary Clinton defends taking money from lobbyists at YearlyKos convention http://urltea.com/154x","Waitress grills GOP candidate Mitt Romney on health care http://urltea.com/152l","Former House Speaker Newt Gingrich calls the War on Terror phony. Blames administration for lack of results. http://urltea.com/152k","House forms a special panel with subpoena powers to investigate alleged stolen vote http://urltea.com/152d","U.S. officials order review of failing U.S. bridges. U.S. bridges and highways have been underfunded http://urltea.com/14va","Bush signs homeland security bill that has 911 Comm. recommendations for screening plane cargo & container ships http://urltea.com/14vc","Time runs an article listing reasons Bush has not fired Attorney General Alberto http://urltea.com/14l5","Department of Transportation (DOT) study found that 1/4 of U.S. bridges are \"structurally deficient\" http://urltea.com/14j5","Russian subs near Arctic target. On a mission to claim \"vast swathe of territory\" in the Arctic http://urltea.com/14cz","Website linked to Al Qaeda group says they are planning a \"big surprise\" http://urltea.com/14c1","Democratic candidate Barack Obama says he might send troops into Pakistan to fight Al Qaeda if elected http://urltea.com/149t","North Dakota’s U.S. Rep. Earl Pomeroy calls President Bush a \"clown\" http://tinyurl.com/2k967q","Was Pat Tillman murdered? http://urltea.com/13yj Rumsfeld to testify in Wednesday hearing on Tillman's death http://urltea.com/13yk","Feeling Better: Chief Justice John Roberts leaves hospital. Tells President Bush he is doing fine after seizure. http://urltea.com/13se","Iraq football captain refuses to return to Iraq. Says his closest friend disappeared. Wishes America didn't invade. http://urltea.com/13mu","Chief Justice Roberts hospitalized for seizure not just a fall. Roberts had a a similar seizure in 1993. http://tinyurl.com/2na6q3","Article says Fred Thompson may not be raising enough money. Only raised a little over $3 million in June http://tinyurl.com/yr6f9c","Democrats to introduce a resolution calling for impeachment of Attorney General Alberto Gonzales. http://tinyurl.com/yqlzpb","Chief Justice John Roberts was taken to the hospital after falling on dock near his summer home in Maine. http://urltea.com/13ln","Judiciary Chariman Senator Patrick Leahy says Republicans blocking Freedom of Information Act bill http://urltea.com/12xj","FBI Director Mueller's testimony is very bad news for Attorney General Alberto Gonzales http://tinyurl.com/2n7y9s","GOP candidates afraid of Qs from YouTubers? Only Ron Paul and John McCain have signed on for GOP YouTube Debated http://urltea.com/12wa","Army medical examiners said Pat Tillman suffered three bullet wounds to the head from as close as 10 yards away http://tinyurl.com/29w48f","FBI Director Robert Mueller contradicts Attorney General Alberto Gonzales’ sworn testimony http://tinyurl.com/2ju9r3","Subpoena for Rove. Senate Judiciary Committee issues a subpoena for top White House adviser Karl Rove http://tinyurl.com/24oa8m","Senator John McCain's media team has resigned http://tinyurl.com/23d49r","Fred Thompson loses another senior staffer. J.T. Mastranadi was said to be \"fed up\" with the \"lack of structure\" http://tinyurl.com/3xfl8b","Alberto Gonzales angers Senators \"Gonzales sputtered, he stonewalled and generally sounded incredibly untruthful\" http://urltea.com/129h","House Judiciary Committee recommends contempt charges for Harriet Miers and Joshua Bolten http://tinyurl.com/2a74v4","Hillary Clinton says Barack Obama made comments that were \"irresponsible and frankly naive\" during YouTube debate http://tinyurl.com/2mwpgp","Gonzalez denies pressuring Ashcroft while he was ill in hospital to recertify Bush’s intelligence-gathering program http://urltea.com/11zb","Democratic CNN/YouTube debate on CNN now. Features video questions from YouTube users for candidates http://tinyurl.com/3y7rc8","New slideshow from Architects and Engineers for 9/11 Truth claims WTC destroyed by demolition explosives not fire http://tinyurl.com/36g9yn","Democratic candidates have raised $100 million more in 2008 campaign contributions than Republican candidates http://tinyurl.com/39nvj5","Dead farmer received $1.1 billion over seven years from the U.S. Department of Agriculture http://tinyurl.com/ywu5xm","Former Assistant Secretary of the Treasury under Reagan says \"something's in the works\" to trigger a police state http://tinyurl.com/392eff","Billing records show Fred Thompson did lobby on behalf of family planning group http://tinyurl.com/242re9","70 Congressman write letter to President Bush telling him they will no longer fund the Iraq War http://tinyurl.com/3b7rtd","Obama Girl vs Giuliani Girl video: http://tinyurl.com/2lmzut","Article about how Ron Paul's supporters are using social media tools to great success http://tinyurl.com/383qjv","John Kerry says there are 60+ senators support change of course in Iraq http://tinyurl.com/35n96c","A chart showing Ron Paul leading in campaign funds from military employees can be found here: http://tinyurl.com/32588x","Ron Paul receiving more donations from employees of the US military than any other GOP candidate http://urltea.com/zsd","An even bigger surge in Iraq is being considered http://tinyurl.com/2jw3gz","Ebay listing promises solution to the Iraq War http://tinyurl.com/2rnbrx","Jim Webb slams Lindsey Graham on Meet the Press for supporting Bush administration's policy in Iraq http://tinyurl.com/35wygy","The Guardian says Cheney is pushing President Bush to bomb Iran. http://tinyurl.com/ys8mr4","White House refuses to release Tillman documents. White House cites executive privilege. http://tinyurl.com/3bhzzn","Generals warn of a second strategic failure (after Iraq) in Afghanistan http://tinyurl.com/2k2tar","Fox News' Bill O'Reilly tells Tony Snow \"You Can't Win\" in Iraq http://tinyurl.com/2ylxs6","Sen. Barbara Boxer says impeachment of the President \"should be on the table.\" http://tinyurl.com/2gvoop","President Bush claims Iraqi insurgents are the same people who did 9/11 http://tinyurl.com/ysjo2g","Firefighters slam Giuliani http://tinyurl.com/3c4n2e Release video and launch website calling him \"urban legend\" http://tinyurl.com/2w7ex3","GOP Senator Gordon Smith (R-OR) calls Iraq War \"insane\" http://tinyurl.com/yrnkc7","Ex-Surgeon General also told to mention George Bush 3 times on every page of every speech http://tinyurl.com/3xvkme","Fomer Surgeon General said he was restrained by Bush administration. Bush admin puts politics above public health http://tinyurl.com/3ank6s","Al-Qaeda's Ayman al-Zawahri warns of more attacks against Britain http://tinyurl.com/2t4kob","First term Republican Senator David Vitter (R-LA) name is on the DC Madam's Escort Service List http://tinyurl.com/2ty5c9","Attacks on supply convoys in Iraq soaring http://tinyurl.com/2jx65q","Turkey has massed 140,000 troops on the Iraqi border says Iraq's foreign minister http://tinyurl.com/2wnp53","Former Secretary of State Colin Powell says he tried to talk President Bush out of invading Iraq http://tinyurl.com/yqq9ws","Tony Blair once rescued Gordon Brown from a locked bathroom http://tinyurl.com/2rd268","President Bush's approval rating falls to just 26% in latest Newsweek poll http://www.msnbc.msn.com/id/19623564/site/newsweek","GOP candidate Ron Paul has more cash on hand than Jon McCain. Raised $2.4 in second quarter. http://tinyurl.com/2yfbsh","Poll finds 45% in favor of impeaching President Bush and over 50% in favor of impeaching Dick Cheney http://tinyurl.com/2bfrjw","New film says Vice President Dick Cheney should be impeached http://impeachcheney.org","Gore lands last-minute DC Live Earth venue. Some GOP lawmakers tried to prevent a DC concert from taking place, http://tinyurl.com/2lotcz","CNN questions how Fred Thompson could run as outsider. \"Fred Thompson is known on Capitol Hill as the access man.\" http://tinyurl.com/2qamgu","Another GOP senator - New Mexico's Sen. Pete Domenici - splits with Bush on Iraq policy http://tinyurl.com/39qbts","Article says Fred Thompson leaked information to Nixon's team during the Watergate scandal http://tinyurl.com/2elo85","Departing Bush aide Dan Bartlett wants a \"Mission Accomplished\" do-over http://tinyurl.com/3xxld5","Not another one. AP says al-Qaeda linked websites hinting that another Osama Bin Laden tape may be on the way http://tinyurl.com/3brk58","Judiciary Committee preparing hearings about Bush's decision to commute Libby's jail sentence http://tinyurl.com/ywh8yf","The Decider Can't Decide: Bush can't seem to make up mind about whether to give Scooter Libby a full pardon http://tinyurl.com/3yfvj5","CNN's Jeffrey Toobin: \"Practically everyone involved in prosecuting or judging Lewis Libby was a Republican.\" http://tinyurl.com/3byqv2","GOP candidate Fred Thompson is a former lobbyist. Clients included deposed Haitian President Jean-Bertrand Aristide http://urltea.com/wfe","Poll finds 21% of Americans agree with Bush's decision to commute Scooter Libby's prison sentence http://tinyurl.com/yt43mf","Socialite Paris Hilton served more time than Scooter Libby will. http://tinyurl.com/2v4qqh","No Jail for Libby: President Bush commutes Libby's jail time sparing him from a 2.5 year prison term http://tinyurl.com/35e7yc","Mitt Romney strapped the family's Irish setter to the top of the car for 12 hours on the road http://snipr.com/1ns27","Terrorists bomb Queen of Sheba's temple in Yemen. Kill Spanish tourists. http://tinyurl.com/2le59n","New tactics by terrorists could mean the era of the car bomb is moving from Iraq to the West http://tinyurl.com/2w7dpr","Some experts think UK terror incidents were been done by amateurs with no connection to major terror group http://tinyurl.com/32cxpx","President Bush went fishing with Bush41 yesterday. Lobster is on the menu for weekend meeting with Putin. http://tinyurl.com/2o8xhn","BBC scroll says police in Glasgow have linked Glasgow incident with the car bombs found in London. http://news.bbc.co.uk","Many reports crediting bollards for keeping burning vehicle from killing people inside the Glasgow airport.","Video of the Glasgow airport attack http://www.cnn.com/video/","CNN http://www.cnn.com reports that one of the suspects driving the burning vehicle into the Glasgow airport has died.","Burning SUV rammed into Glasgow airport. Some U.S. airports will tighten security. http://tinyurl.com/2m7452","Congressional committee to probe whether Dick Cheney was involved in decision that killed 70,000 salmon http://tinyurl.com/2geu75","Al Qaeda believed to be behind London car bomb attempts http://tinyurl.com/2l8d7n","White House refusing to turn over any documents related to the recent federal prosecutor firings. http://tinyurl.com/2x3lzu","Immigration bill defeated in Senate http://tinyurl.com/3566f7","Legal immigrants can face years of delays trying to get into the U.S. http://snipr.com/1nmbz","Senate Judiciary Committee has subpoenaed the White House and Dick Cheney's office for eavesdropping documents. http://snipr.com/1nmbl","Christine Todd Whitman says she quit after VP Cheney rewrote coal power plant rules to favor the coal industry http://tinyurl.com/365ome","Record opium crop in Afghanistan despite U.S. presence. Up 49% over last year. http://tinyurl.com/28vuw3","Top Democrat says there has been an \"overwhelmingly positive reaction\" towards move to defund VP Cheney's office http://tinyurl.com/2uu99q","Dick Cheney claims he is not part of the executive branch of government. http://tinyurl.com/2ul23g","WashPo says that when 2nd plane hit WTC there were groans from everyone in the room .. but Cheney made no sound. http://tinyurl.com/3ad4by","Washington Post runs investigative report on Dick Cheney and his accumulation of power http://tinyurl.com/29geej","House votes to ban aid to Saudi Arabia. White House threatens to veto http://tinyurl.com/2w5qct","Ex-EPA Chief says Guiliani blocked efforts to get Gound Zero workers wearing respirators. Many 1st responders now ill http://urltea.com/tww","Some of $78 billion spent by Pentagon on weapons research going towards gay bombs, armed sharks, teleportation http://tinyurl.com/yqh3cf","Republican bill seeks to limit Speaker Pelosi's travel http://tinyurl.com/yntwot","FBI document says plane carrying Saudis out of U.S. on 9-19-01 may have been chartered by Osama Bin Laden http://tinyurl.com/yvwllw","14 US soldiers killed in two days in Iraq http://tinyurl.com/yp7csy","Bloomberg leaves GOP http://tinyurl.com/2ter7r says U.S. is in trouble http://tinyurl.com/2junfh","9/11 Widows demand release of CIA's Inspector General report that still has never been shown to the public http://tinyurl.com/26kekc","ABC News' The Blotter reports that \"Large teams of newly trained suicide bombers\" are coming to the US and Europe http://urltea.com/so5","Seymour Hersh reveals new details about Abu Ghraib: \"Father and son forced to do acts together\" http://tinyurl.com/yooejw","Mahmoud Abbas has dissolved the Palestinian Authority's government as Hamas-Fatah conflict escalates http://tinyurl.com/2g5g38","More on the Pentagon's consideration of a \"Gay Bomb\"  http://urltea.com/rq2 and http://urltea.com/rq3","President Bush hits new low of 29% on NBC News/Wall Street Journal poll http://urltea.com/rjb","Calls for calm after al-Askari shrine is bombed in Iraq http://urltea.com/res","The Case of the Disappearing Watch: White House claims Bush put watch in pocket but video tells a different story: http://urltea.com/r5j","President Bush's watch was stolen during his walkabout in Albania http://urltea.com/r4p","Pentagon confirms that they considered building a \"gay bomb\" that would make enemy soldiers lust for one another. http://urltea.com/qll","Republicans block vote of no confidence in Attorney General Alberto Gonzales. http://urltea.com/qx2","President George W. Bush dismisses upcoming no confidence vote on Attorney General Alberto Gonzales as \"meangingless\" http://urltea.com/qrm","Suicide bomb brings down bridge in Iraq tapping several U.S. soldiers http://tinyurl.com/yszjqm","President Bush receives a hero's welcome in Albania http://urltea.com/qnj","Holy Gaffe: President Bush refers to Pope as \"sir\" instead of expected \"His Holiness\" http://urltea.com/qjj","Secretary of State Condoleezza Rice thinks history will have a favorable view of Bush's foreign policy http://urltea.com/qi7","President Bush off the wagon? http://urltea.com/qak Video here http://urltea.com/qal","Bush pick for Surgeon General faces grueling Senate battle because of past \"homophobic statements.\" http://urltea.com/q3m","Bush gets a second chance to veto embryonic stem cell research. http://urltea.com/q2u","Turkish troops enter Iraq to chase after Kurdish rebels http://urltea.com/psi","The cost of a picture with President Bush plunges from $25,000 to just $5,000 http://urltea.com/ppr","GOP candidates slam President Bush for his Iraq War, Hurricane Katrina and immigration mistakes http://urltea.com/pp0","30 months: Scotter Libby, former chief of staff to Vice President Dick Cheney, sentenced to 30 months in prison http://urltea.com/pcc","Former CNN anchor Bernard Shaw: \"what Fox puts on the air is not news.\" http://urltea.com/pcb","Experts cast doubt on JFK terror plot. Call plot \"virtually impossible\" and \"nonsense\" http://urltea.com/p6i","Rep. William Jefferson, D-La. has been indicted on bribery charges http://urltea.com/p30","Arkansas GOP head says \"all we need is some attacks on American soil\" and naysayers will appreciate Bush. http://urltea.com/p19","John Edwards appeared to send a tweet last night during the debate http://twitter.com/johnedwards/statuses/89800092","John Edwards challenged Hillary Rodham Clinton and Barack Obama on leadership during last night's debate http://urltea.com/p14","G8 Summit riots are Germany's worst in decades. Nearly 1,000 injured. http://urltea.com/otz","16 troops already killed in Iraq in first three days of June http://icasualties.org/oif/","Catholic Priest and three of his assistants shot dead in Iraq http://urltea.com/otq","Terror plot against JFK airport stopped. Could have \"been worse than 9/11\" Plot was never passed planning stages http://urltea.com/oo8","Bush aide Dan Bartlett resigning. \"It’s been a hell of a ride.\" http://urltea.com/of8","Peggy Noonan: \"President Bush has torn the conservative coalition asunder.\" http://urltea.com/of7","Al Gore against idea of Bush impeachment. Suggests it would be waste of time and resources. http://urltea.com/o89","Dems planning stem cell research vote. However, they are not likely to garner enough support to override Bush veto http://urltea.com/o4f","Russian President Vladimir Putin says U.S. missile shield will lead to a new arms race http://urltea.com/o4e Says U.S. has left ABM treaty","Iraq PM concerned \"those still loyal to the previous regime may start planning coups.\" http://urltea.com/o4c","Seven people - including 5 U.S. soldiers - die when Chinook helicopter shot down in Afghanistan http://urltea.com/nwq","Fred Thompson plans to enter the presedential race over the July 4th holiday http://urltea.com/nsv","Newly released unclassified document shows that Valerie Plame was covert at the time her identity was revealed http://urltea.com/no8","8 U.S. troops killed in Iraq yesterday. 110 U.S. troops killed so far this month. 3 Germans kidnapped http://urltea.com/nk6","President Bush pays tribute to fallen U.S. soldiers at  at Ceremony at Arlington Cemetery. http://urltea.com/ndg","108 coalition troops killed in Iraq so far this month. Rate of 4 per day. http://icasualties.org/oif/","Queen \"exasperated and frustrated\" by Tony Blair's ten year legacy http://urltea.com/n6n","U.S. sends military aid to help Lebanese army fight rebels http://www.msnbc.msn.com/id/18857073/","Anti-war sparrow poops on President Bush during Rose Garden news conference http://urltea.com/mlu","John Edwards says War on Terror is a \"a bumper sticker, not a plan\" http://urltea.com/mls","Bush on uncaptured terrorist mastermind Bin Laden \"He's not leading many parades\" \"He's not out feeding the hungry\" http://urltea.com/miz","Analyst: White House created safe haven for terrorists with Iraq war. White House was warned about this pre-invasion http://urltea.com/mg6","GOP playing catch up on the Internets http://tinyurl.com/23pjf2","\"Second Surge\" More troops going to Iraq this year http://urltea.com/ltj Troop totals in Iraq could climb to 200,000+ by end of the year.","GOP candidate Ron Paul says he is actually more Republican than the other candidates. http://tinyurl.com/25bzqu","Al Gore takes on Bush in new book \"Assault on Reason\" http://urltea.com/lld \"Searing assault on the Bush administration\"","Fighting between Lebanese troops and Islamist militants continues in Tripoli -- northern Lebanon http://urltea.com/lew","Times Online says Paul Wolfowitz’s departure from the World Bank signals the fall of the neocons. http://urltea.com/lax","White House claims Jimmy Carter is \"increasingly irrelevant\" http://urltea.com/l9q","Defense Department dismissed Intelligence reports from 2003 that predicted sectarian violence in Iraq http://urltea.com/l8r","President George Bush warned that Gordon Brown is expected to reverse Tony Blair's support for the Iraq war http://urltea.com/l4s","Time has an article that asks if Gonzales' visit to Ashcroft's emergy room was illegal http://urltea.com/l1q","Ashcroft to override Comey's decision on the domestic wiretapping but Ashcroft told Gonzales that Comey is the attorney general [cont]","White House counsel Alberto Gonzales visited John Ashcroft's hospital room while Ashcroft was very ill to try and persuade [cont]","Record contractor deaths in Iraq: 146 contract workers killed in Iraq in first three months of 07 http://urltea.com/l1m","Gen. Petraeus says at least 2 of 3 missing U.S. soldiers still alive http://urltea.com/l1i","50 insurgents attack U.S. base in Iraq.  Ensuing battle leaves six militants dead. http://urltea.com/kvs","Bipartisan immigration bill faces bipartisan opposition http://urltea.com/kv1","Pennsylvania Sen. Arlen Specter thinks that Attorney General Gonzales will probably resign http://urltea.com/knf","Rush Limbaugh talks about meeting former President Bill Clinton http://urltea.com/km1","Former EPA Administrator Christine Todd Whitman has declined invitation to testify at 9/11 hearing http://urltea.com/khv","Republican Sen. Chuck Hagel has joined the chorus calling for Attorney General Alberto Gonzales to resign http://urltea.com/khu","British foreign policy think-tank Chatham House warns that Iraq faces the possibiliy of \"collapse and fragmentation\" http://urltea.com/kfw","Bush has appointed Lt. Gen. Douglas Lute as the U.S. War Czar. This is the first time the U.S. has had a War Czar. http://urltea.com/k8y","Wolfowitz swore at and threatened senior World Bank staff, gave raise to girlfriend. White House still support him http://urltea.com/k3z","U.S. troops won't be allowed to view photo and video sharing websites http://urltea.com/jxe","Deputy Attorney General Paul McNulty resigning. #2 at Justice Dept http://urltea.com/jxc","Impulsive President Bush takes over orchestra. http://urltea.com/joy \"He conducted with a great deal of panache.\"","John Edwards takes a question about World Trade Center 7 http://tinyurl.com/2flg33","Cheney in Iraq: US Vice President Dick Cheney is in Baghdad for talks http://urltea.com/ixm","USAID staff ordered to scrub references to Randall Tobias http://urltea.com/ixl","Queen begins toast: \"When I was here in 1776\" http://urltea.com/ixh","Obama explains inflated tornado toll gaffe http://urltea.com/ixg","Terror plot: Six men charged with plot to access Fort Dix in New Jersey by posing as pizza delivery drivers. http://urltea.com/ij1","President Bush and the Queen. Photos include a possible Bush wink and a frosty glare from the Queen. http://urltea.com/ih5","Paul Wolfowitz found guilty of a conflict of interest by a committee of World Bank Directors. http://urltea.com/igk","Troops fortifying need outposts set up as part of Surge http://urltea.com/igj","A dozen more U.S. soldiers killed in Iraq: http://tinyurl.com/2gzrk9","He's the Decider and the Commander Guy: President Bush: \"I'm the commander guy.\" http://urltea.com/i23","ConservaTube http://www.qubetv.tv is a new video sharing site for conservatives. The site says some of the videos were banned from YouTube","President Bush's approval rating has sunk to a dismal 28%. The lowest for a president since Carter's 28% in 1979 http://urltea.com/hvx","Giuliani takes different position on abortion than his opponents. MSNBC says \"libertarian position\" http://urltea.com/hqy","Republican contenders for president back the Iraq War. BBC says criticism of Bush sparing during recent debate. http://urltea.com/hqx","Jeff Gannon, former gay escort who visited White House two dozen times,  now spokesman for Christian bible group http://urltea.com/hqw","100,000+ Rally in Tel Aviv for Prime Minister Ehud Olmert and Defense Minister Amir Peretz to resign http://urltea.com/hic","Many potential jurors in the Jose Padilla terrorism-support case doubt official 9/11 story http://urltea.com/hib","May Day immigration rally in L.A. gets out of control as police and marchers clash. http://urltea.com/h5t","Video of Joe Biden saying he is going to shove the troop withdrawal bill down President Bush's throat http://urltea.com/h5r","Bush vetoes $100 billion Iraq spending bill that also included timelines to withdraw U.S. troops from Iraq http://urltea.com/h0z","50-foot banner reading \"Mission Accomplished?\" unfurled in front of White House. http://urltea.com/h0x","Carl Bernstein writing biography of Hillary Clinton. Will be out in June. http://snipurl.com/1ixy8","DC Madam to name more names on 20/20? http://urltea.com/gmz","Congress finally paying attention to the growing number of food recalls http://snipurl.com/1ixxl","Iran is cracking down on men's hairstyles and grooming. Iran's morality police are going after barber shops http://urltea.com/gpb","More from George Tenet: al-Qaida tried to kill Al Gore. al-Qaida wants to detonate nuke inside u.S. http://urltea.com/gp9","Retired Lieutenant General William E. Odom says Bush \"seems to have gone AWOL\" http://urltea.com/gp8","ABC says there are more Bush officials on the DC Madam list http://urltea.com/gp7","[cont] oil installations in Saudi Arabia and bringing down the Saudi government. The Iraq War has allowed terrorists groups to organize","Time article discusses the recent Saudi arrests of 100+ militants. http://urltea.com/g7c These groups are intent on hitting [cont]","More on the recent Supreme Court's to uphold the constitutionality of the 2003 Partial Birth Abortion Act http://urltea.com/g3y","102 coalition troops killed in Iraq so far this month. http://icasualties.org/oif/","Fox reports a parody story about a fictitious prank played on Muslim students as real news http://tinyurl.com/2cdnrv","Pentagon says Abd al-Hadi al-Iraqi being held at Gitmo. Considered one of Al-Qaeda's highest operatives. http://urltea.com/g3w","Senate passes Bill to pull out of Iraq. Bush expected to veto the bill http://urltea.com/fwv","Ex-CIA Director Tenet totally slams Bush admin for disingenuous and dishonorable use of his \"Slam dunk\" comment http://urltea.com/fvs","Reid on Cheney “I’m not going to get into a name-calling match with somebody who has a 9 percent approval rating\" http://urltea.com/fne","Subpoenas for Secretary Condi Rice approved by House panel http://urltea.com/fnd","Taliban says Bin Laden running militants' operations in Iraq & Afghanistan. 5.5 years since 9/11 still not captured. http://urltea.com/fnc","Kucinich to introduce Articles of Impeachment for VP Dick Cheney at noon EST http://snipurl.com/1hud1","Troops killed were all from Fort Bragg in North Carolina http://urltea.com/fb4","9 troops killed, 20 injured when suicide truck bomber hits U.S. base http://urltea.com/fb3","Live on CNN Now: Tillman's brother says Army deliberately created fictional story about his brother's death.","89 coalition troops killed in Iraq already this month http://icasualties.org/oif/","Bush 41 cites \"Bush fatigue\" as reason Jeb Bush does not appear to be running for president http://urltea.com/f51","Rep. Henry Waxman warns of systematic security failures in the Bush administration. http://snipurl.com/1hqu8","Karl Rove had a special \"double delete function\" to delete those five million missing emails. http://snipurl.com/1hpe9","Bush even more confident in Gonzales despite doubts about his competence being raised by GOP lawmakers. http://snipurl.com/1hpdl","Laurie David and Sheryl Crow describe their encounter with Karl Rove http://snipurl.com/1holz","Al Qaeda said to be planning new mass casualty attack http://www.timesonline.co.uk/tol/news/uk/article1687360.ece","Former Russian President Boris Yeltsin has died at age 76 http://urltea.com/f1g","Casablanca column says Laura Bush may now be at a hotel instead of the White House because Bush is drinking again http://snipurl.com/1h8pe","Senator Harry Reid says the Iraq War is lost and the \"surge is not accomplishing anything\" http://snipurl.com/1h87r","John McCain sings \"Bomb bomb bomb, bomb bomb Iran\" http://tinyurl.com/27fmyt","Supreme Court backs Partial Birth Abortion Ban Act 5-4 http://snipurl.com/1h1qd Justice Ginsburg: \"Today's decision is alarming\"","Ghastly day in Iraq as 160 die from an avalanche of car bombings. One massive bombing killed 115+ people. http://snipurl.com/1h1px","Top conservatives write a letter to President Bush telling him to fire Gonzales http://tinyurl.com/yqmn8s","France warned CIA about an al Qaeda plane plot before 9/11 http://snipurl.com/1gtak report did not mention crashing planes into buildings","President Bush allowed the ban on assault weapons to expire in 2004 http://snipurl.com/1gqly","Brady campaign report on Virginia's gun laws http://snipurl.com/1gqit \"Assault weapons are as easy to buy as hunting rifles.\"","Senator Leahy says Rove's lost emails is \"like saying the dog ate my homework\" http://snipurl.com/1gdy4","Rove's lawyer says Karl Rove didn't mean to delete all the important emails. http://snipurl.com/1gdy1","MSNBC says two Iraqi lawmakers were killed in the Iraqi parliament suicide bombing http://snipurl.com/1g8b8","Green Zone explosion was suicide bomber in the cafeteria inside the Iraqi parliament building. 8 dead. 23 injured. http://snipurl.com/1g878","Senator Leahy links Bush administrations missing Attorneygate emails to 18-minute gap on Nixon tape recordings http://snipurl.com/1g7xf","Explosion inside Baghdad's supposedly secure Green Zone kills 3. http://snipurl.com/1g7x6","Baghdad Bridge Bomb: Serious truck bombing in Baghdad damages bridge and sends cars into the Tigris river. http://snipurl.com/1g473","House committee led by Rep. Dennis Kucinich (D-OH) wants to know why gas prices are headed to $4 http://snipurl.com/1g5t5","Senator Biden calls for American military force to be used in Darfur http://snipurl.com/1g5ru","Senate votes 63-34 to do away with Bush's stem cell restrictions. Bush to veto despite house, senate and public support for the research.","Rudy Giuliani way off on estimate of prices for bread and milk http://snipurl.com/1g3fv","Bombs in Algeria kill 23 and heavily damage the prime minister's office http://snipurl.com/1g3fp","Fred Thompson says he has cancer but it isn't the kind that should affect his campaign if he runs http://snipurl.com/1g33m","John McCain claims he didn't really need the massive amount of protection he had on his Baghdad march. http://snipurl.com/1g03w","White House focuses on Clifford the Big Red Dog instead of huge Shia protest against U.S. troops in Iraq http://urltea.com/4kd","House judiciary panel subpoenaes Attorney General Alberto Gonzales for missing emails and documents http://urltea.com/4kb","Bush, White House and press corp were unprepared for Texas snow and cold http://snipurl.com/1fuac","10 U.S. troops killed over the weekend. Six killed on Sunday. http://snipurl.com/1fqkh","Seven NATO troops killed in Afghanistan http://snipurl.com/1fpv0","Explosion averted: Ford CEO stops President Bush from plugging electrical cord into hydrogen tank of hybrid car http://snipurl.com/1fptk","Cheney once again makes a Saddam-al qaeda link that the Pentagon says never existed http://snipurl.com/1fh5d","Fred Thompson said to be \"getting more serious everyday\" about possibly running for U.S. president http://snipurl.com/1fh4u","The British are Coming! Michael Chertoff, the Head of Homeland Security, warns of attack from radicalised Britons http://snipurl.com/1fh4q","Another chlorine gas truck bomb explodes in Iraq. 27 dead. http://snipurl.com/1fgky","50 helicopters shot down since Iraq War began http://snipurl.com/1fe7u","Mitch Romney claims to be a lifelong hunter but comes up with just two hunting trips hunting rodents and mice. http://snipurl.com/1fe73","New York Sun editorial wants Dick Cheney to run. But Cheney's approval rating is even lower than Bush's. http://snipurl.com/1fe6r","25 coalition troops killed in first six days of April in Iraq War. http://icasualties.org/oif/","More of the Scotus auto emissions decision that rebuked Bush. The EPA must now step up to the plate. http://snipurl.com/1f78d","British sailors finally get to come back home. http://snipurl.com/1f5s8","Rep. John Murtha blogs his thoughts on President Bush's veto threat http://snipurl.com/1f5rz","Bush appoints Swift Boat funder Sam Fox as Ambassador to Belgium http://snipurl.com/1f5rc","Karl Rove and his car pelted with objects thrown by students. http://snipurl.com/1f36k","Bill O'Reilly and Condoleezza Rice spar over the Iraq War and Iran http://snipurl.com/1f1gm","Former Massachusetts Gov. Mitt Romney has raised the most money among GOP candidates with $21.5 million http://snipurl.com/1ezkg","Iraqi merchants not impressed with McCain's Baghdad walk http://snipurl.com/1ezkd","Bush criticizes Pelosi's Syria visit http://snipurl.com/1ezjg but says nothing about the recent Republican trip http://snipurl.com/1ezjo","ABC's The Blotter says Iran could be nuclear by 2009. http://snipurl.com/1exjq","NBC Reporter says \"Paris Hilton Could Ride A Bicycle In A Bikini Through Anbar\" with McCain’s protection http://snipurl.com/1exjf","Colorado Republican Congressman Tom Tancredo has entered the 2008 presidential race http://snipurl.com/1evq3","McCain strolls through Baghdad market. Only needed 100 soldiers, 3 blackhawks and 2 apache gunships as backup. http://snipurl.com/1etqf","Bush's global warming policy rebuked in tight 5-4 vote by Supreme Court. http://snipurl.com/1evn9","Peta is angry about MC Rove's recent remarks about animals http://snipurl.com/1euv2","Democrats plan to widen conflict with Bush -- press on privacy issues, correct Patriot Act wrongs, close Gitmo http://snipurl.com/1eum3","Al Qaeda said to be rebuilding in Pakistan's tribal areas and restoring its leadership http://snipurl.com/1eujn","Henry Kissinger says victory in Iraq is not possible http://snipurl.com/1essb","Fighting continues in Somali. Said to be worse fighting there in 15 years. http://snipurl.com/1erz7","Hillary Clinton raises $36 million in the first fundraising quarter http://www.drudgereport.com/flash2.htm","U.S. government is losing its expertise due to an overuse of outsourcing http://snipurl.com/1ep2m","Bush's 2004 strategist Matthew Dowd says John Kerry was right about Iraq http://snipurl.com/1ep32","Nearly 400 killed in Iraq in three days http://snipurl.com/1ep2o","Karl Rove dances for the pleasure of the president http://snipurl.com/1ede6","Saudi Arabia King calls the Iraq War a disaster. http://snipurl.com/1e8mc","John McCain's MySpace page hacked http://snipurl.com/1dwdw","Text of Tillman Family Statement http://snipurl.com/1c4b4","Senate trying to put the brakes on costly war. $300 billion spent so far http://snipurl.com/1e0og","Iran airs video of captured British sailors. Female British soldier seen in head scarf. http://snipurl.com/1e0mi","Pelosi tells Bush to \"Take a deep breath\" and \"calm down\" Source: http://www.rawstory.com","Senator Charles Schumer says Rove, Miers subpoenas are ready to be issued http://snipurl.com/1e07o","Polls show nearly 75% back subpoenas and forcing White House officials to testify http://snipurl.com/1dwli","Sad news in Washington: Tony Snow's cancer has returned and spread to his liver. http://snipurl.com/1dwla","Novak column says Bush is lonely and isolated from Republican party http://snipurl.com/1c49i","GOP Sen. Chuck Hagel of Nebraska says impeachment of President Bush is an option http://snipurl.com/18zbo","More of Sean Penn blasting President Bush http://snipurl.com/185mb","Sean Penn blasts Bush: \"Let's make this crystal clear: We do support our troops, but not the exploitation of them and their families.\"","Cheney says House is undermining the troops with 2008 pullout vote http://snipurl.com/185m3","Google goes after political campaign advertisements http://snipurl.com/16mm7","Lower the Fundraising Bar: Mit Romney's campaign says McCain has raised more money than they have http://snipurl.com/trhi","John McCain says his presidential campaign wont meet its first quarter fundraising goals http://snipurl.com/trhf","Iraq War casualties up over 3 killed per day again for march http://icasualties.org/oif/","Massive size of terrorism database, Terrorist Identities Datamart Environment (TIDE), raises privacy concerns http://snipurl.com/qpm4","UN backs new Iran sanctions 15-0. Iran has also moved 15 kidnapped UK troops to Tehran http://snipurl.com/tplv","Documents released on Friday show Gonzales approved the US Attorney filings http://snipurl.com/tplo","University of Florida nixes idea of honorary diploma for Jeb Bush http://snipurl.com/mf31","Vilsack will endorse Hillary Clinton for president http://snipurl.com/1du6p","Angry Bush promises to veto new bill that brings the troops home in 2008. The bill passed the house today http://snipurl.com/1du65","Former U.S. Attorney David C. Iglesias explains why he thinks the Bush adm. fired him for political reasons http://tinyurl.com/355u8h","Former US Attorney David Iglesias explains why he was fired by the Bush Administration. He believes it was political. http://tinyurl.com/355","Tony Snow: \"What Do You Gain From A Transcript?\" Guess the White House doesn't want the public to know what anyone said.","White House offers unsworn private appearance by Rove and Meiers. Leahy turns it down. http://tinyurl.com/2sjtxm","94-2 Senate Vote means Bush will now have to get Senate confirmation of new attorneys http://tinyurl.com/2rgddt","Mit Romney channels Castro in speech http://tinyurl.com/38hk4g","U.S. Attorney Scandal continues to widen http://tinyurl.com/ysb4xo","4 years on U.S. Iraq deaths at 3218 wounded at 23417 http://icasualties.org/oif/","Gonzales is trying to find support for staying on as attorney general http://tinyurl.com/2mhxwf","Iraq War protests today in New York City http://tinyurl.com/2j8ecy","The heat is on. Leahy wants Bush aids to testify over attorney scandal. Including Rove. http://tinyurl.com/2nxeju","Sources tell CBS that it is inevitable that Gonzales will be ousted http://tinyurl.com/2h4ero","Technorati Claim http://technorati.com/claim/wetahr5kxp","Iraq War protestors march on Pentagon http://tinyurl.com/35dm49","Shocker: Bush administration never bothered to do an internal plamegate investigation http://tinyurl.com/2wx48a","Thousands march on the Pentagon in Iraq War protestors. Counter protestors tear their signage. http://tinyurl.com/35dm49","Emails tie Rove to U.S. attorney scandal. Contradict Snow's comments that it was all Harriet Mier's idea. http://tinyurl.com/36nytq","Drudge Report links to misleading website providing incorrect troop casualty data. http://tinyurl.com/26j9b9","Coverage of the attorney scandal continues to grow. http://tinyurl.com/282ttz"]