["What's it like being an olfactory king? (Hint: very boss-like) http://t.co/IHYOwtPX","A prediction: Every dude will be wearing these kicks at Pitti Uomo this year http://t.co/yUG81kYA","Here is a polite conversation between the two wolves on Kanye West's trucker jacket http://t.co/ZIXApGQl","Spring is nearly in bloom. @benferrariPHOTO captured the seasonal style shift—and a few dogs—in downtown NYC: http://t.co/HVLnOV4b","RT @SHotchkissNYC: The Chi-town business set is about to be a lot better dressed - here comes @MrSuitSupply - http://t.co/bDOimlBW - 1st ...","We pitted our actors against each other in a series of Week in Style categories. @ZacEfron won the day. See who lost: http://t.co/H2LUrlvu","RT @BrianCoatsBC: Another behind the scenes on the Derrick Rose shoot. He's the definition of statuesque. http://t.co/bf1umGVu","They sure do, the band an the actual young ones cc:@apc_usa -MS http://t.co/pvOPqePn","My Olympic watching gear courtesy of @apc_usa and their new West Village shop -MS http://t.co/v5cpkhpm","RT @therichdale a very nice candle u should own. smells like smokin cloves in the 10th grade http://t.co/ppD0qO8J","RT @SHotchkissNYC: Fact: a puppy dies every time a grown man wears flip flops in the city. Ashton Kutcher is killing puppies: http://t.c ...","Stop the cycle of losing cheap umbrellas by investing in a well-made one that you—and everyone else—will remember: http://t.co/RsCiZSbe","The newest outpost of @rag_bone is worth a peek: http://t.co/YrulCQyx","The Want Les Essentiels wall at the @maison_kitsune store in the NoMad http://t.co/ag4lqOPn","I want to go to there -MS @maison_kitsune store opening at the NoMad http://t.co/lb9pJH1F","Learn to suit up properly and everything else follows: http://t.co/S9lxLSk7","Let's talk shop with Gildas Loaec and Masaya Kuroki of @maison_kitsune: http://t.co/COFDid2F","The Most Stylish @NBA Players Ever (Sorry, George Mikan.) http://t.co/BrSMTrnr","RT @SHotchkissNYC: One of the finest chinos in the land, the @UnisNewYork Gio Skinny is back in stock in new colors for spring. http://t ...","Keep an eye out: Topman's denim jacket project is coming very, very soon: http://t.co/GZOmJgem","Want to dress like an @NBA player? Take notes from guys like @CP3 and @DerekFisher: http://t.co/BrSMTrnr","Notes from the Road: @RamblersBone in Taos, New Mexico: http://t.co/kG7de1zU","Is the @NBA the most stylish league in sports? These guys make a good case: http://t.co/BrSMTrnr","Stuff We Like: Mismo's Full-Grain Leather Morris: http://t.co/Fc6cJLOK","RT @BrianCoatsBC: Behind the scenes: GQ's newest cover guy Derrick Rose getting his video on with @gvonsteiner @MilkStudios LA. http://t ...","Dropping Knowledge: What is seersucker? If you don't know, now you know: http://t.co/41agBJii","Untipped. Not a very nice way to leave your waitress. But your summer ties? Magnifique: http://t.co/3OTsCYzu","If you were throwing a dinner party, you'd do well to have Alexander Gilkes on your guest list: http://t.co/qaQ8JRXm","Want to know how an art connoisseur (and occasional auctioneer) lives? Alexander Gilkes: http://t.co/qaQ8JRXm","Searching for Spring shoes? Look effortlessly polished in Clark's men’s spring collection. See the newest shoes at http://t.co/rYlzHvek.","Tip: Get some stripes on your chest. It's the fastest way to look like an athlete, even if you're not built like one: http://t.co/1SqWJRhv","Suit up, gentlemen. http://t.co/U82OAJdJ","We talk to @madmen_amc costume designer @JanieBryant about the dandified ways of Lane Pryce: http://t.co/SwkzAXIH","See what makes Derrick Rose an MVP of style (and get the look for yourself!): http://t.co/1SqWJRhv","The Goods: @yalebreslin goes digging through violinist @charliesiem's iPod. What did he find? http://t.co/wjIXCQud","What's on @charliesiem's iPod? http://t.co/wjIXCQud","RT @BrianCoatsBC: Good morning. Wait for the coffee to arrive before untangling my @miansai . Halfway there. http://t.co/7LWlHkMm","Stuff We Like: @Lookmatic Eyewear: http://t.co/RZVsiUKV","RT @Wax_Wane: \"Dropping Knowledge: Seersucker,\" the second installment of my series for @GQMagazine, Enjoy http://t.co/RCQ4fBre","Want pro style like Derrick Rose? Start with the stripes. http://t.co/1SqWJRhv","\"I'm fine. This is mine. It's my life.\" - @iamalaindelon: http://t.co/0NSmN3kO","Derrick Rose, Style MVP: http://t.co/1SqWJRhv","NYC: @LordAndTaylor, 4/19, 5-7pm. Buy a bottle of @OriginalPenguin Men’s Fragrance and have it engraved free: RSVP4@GQ.COM","The Style Report: @madmen_amc: http://t.co/ghLn4K4w","This Just In: @Billy_Reid and @KSWISS go sand suede for summer: http://t.co/4m9wWgoe","Men, step up your skincare routine. Meet the @Clarisonic Mia: http://t.co/NSiIwJGV","RT @RugbyRL: Spotted in Rugby: Marcus Allen exuding cool in one of our past season army jackets on @GQfashion. #killingit http://t.co/xZ ...","Editor's Pick: Homespun Knitwear at @JCrew_Insider: http://t.co/SJOERhD9","Street Style: Marcus Allen is one of the most stylish guys we know. The key? Confidence. And @RugbyRL: http://t.co/v2Mbxut0","Stuff We Like: a flask that's more than OK: http://t.co/83mDap8O","Pinstripes, plaid, and a patterned tie make this the dandiest Lane's looked in some time. The Mad Men Style Report: http://t.co/EQbFhHZF","\"I tried being reasonable. I didn't like it.\" - Clint Eastwood http://t.co/heNd4SVo","The Style Report takes on @madmen_amc, episode four: http://t.co/m8ZKV3uw","The Week in Style: 04.13.12: http://t.co/XUgt3FEx","The Style Guy is back to solve your sartorial dilemmas: http://t.co/cUzTM7I2","The GQ Guide to Suits: http://t.co/S9lxLSk7","We just tweet you, and this is crazy... but here's our @tumblr, follow us maybe? http://t.co/FY7Ly0qg","The best menswear from @UrbanOutfitters: http://t.co/iQXlXONF","It's time to break out the boat shoes. The ones to wear this spring: http://t.co/hy1iKQ2T","An open letter, GQ-style, to Zac Efron: http://t.co/nCCbG0VL","15 fashion tips for dummies, or at least actors: http://t.co/mXnm3c1W","Our guide to what to wear this spring: http://t.co/isjKXdvA","What can you learn from a Hollywood stylist? Plenty. http://t.co/mXnm3c1W","Fashion in Hollywood involves as much calculation and bartering as negotiating royalties. Meet @ilariaurbinati: http://t.co/L8vBgS4d","Your Friday the 13th style icon: Jason Vorhees: http://t.co/BYqRu5m2","The Missoni for @Converse Chuck Taylor All Star collection is back: http://t.co/GHOR5r1s","Don't blame @jhogangidley for that sweater vest. Meet @RickSantorum's stylish communications director: http://t.co/HJ9N82K8",".@UrbanOutfitters has stepped up their menswear game: http://t.co/iQXlXONF","The Style Guy weighs in on how to work an ascot, pull off sartorial slippers, and find a killer motorcycle jacket: http://t.co/cUzTM7I2","Want to jack Taylor Kitsch's red-carpet swagger? We can get you everything but @BrooklynDecker: http://t.co/go8rODz7","Exclusive Sneak Peek: Lapo Elkann on Lifestyle Mirror: http://t.co/AH2U1rzC","Street Style at @The_Masters: Gotta make sure your hair is nice when you're wearing the winner's jacket. http://t.co/T7h2nz9p","GQ Regrets: The Checkered Cap #the80swereadifferenttime http://t.co/U6Npe5mU","Jason Vorhees, style icon: http://t.co/BYqRu5m2 #fridaythe13th #menswear","Lessons from Paul Newman and Robert Redford: Get swim trunks that fit, and have some fun with your friends. http://t.co/uuwNbJeh","An open letter to Zac Efron: http://t.co/nCCbG0VL","\"Mr. Black stares off into the blue... shit's getting weird.\" Checking in with @RamblersBone: http://t.co/aNCgQh4Y","\"When dad needs a bib.\" @GQMagazine, Sep. 1971. http://t.co/rEjdv1FO","Join us at Bloomingdale’s on 59th Street next Thurs, 4/19 to celebrate @MichaelKors Spring menswear collection @ 6:30 PM: rsvp1@gq.com","In which Brooklyn Decker wears a see-through dress: http://t.co/XUgt3FEx #weekinstyle","Your @Coachella weekend playlist from our friends at @GrandLifeHotels: http://t.co/obmdbaCn #coachella","RT @BrianCoatsBC: I love these distressed monk strap beauties from N.D.C. http://t.co/SafO81jh","You've got style questions, and @lordrochester has answers. The Style Guy: http://t.co/cUzTM7I2","\"I want a suit that doesn't know a time period and doesn't know geography, either.\" - Sid Mashburn on the ideal suit: http://t.co/eERbmK6q","Michael Ingui. Dopeness. http://t.co/NH04VNYf","Fresh style. Fresh price. Talking with Joe Fresh's Joe Mimran: http://t.co/jy7yTRMB","The cast of The Avengers came out to fight against the evils of bad style. We're not sure they won: http://t.co/4uoArSLQ","Are you a man who puts crystal dolphins on his testicles? It's time to cut that out. http://t.co/ZGtA0Xw3","GQ Shops: The best stuff at @UrbanOutfitters: http://t.co/iQXlXONF","Looking for a suit that's slim but not skinny? Sid Mashburn's got you covered. The Perfect Italian Suit: http://t.co/eERbmK6q","RT @SHotchkissNYC: \"Guys, stop putting crystal dolphins on your testicles.\" http://t.co/FWrSfOwg - @LaurenBans","Print. #menswear @mrmrsbenson http://t.co/Cm6oYvjF","Dots for dudes! Well, sort of. @THE_WOR Breakers Long Sleeve Shirt: http://t.co/ptQw8p4j","By popular demand, we present The GQ Guide to Suits: http://t.co/U82OAJdJ","@maryannbarone Consider it approved.","RT @BrianCoatsBC: Today's fashion meeting brought to you by grey cuffed suit pants with Nike's worn sockless. @GQfashion http://t.co/z2C ...","No wonder André 3000 is always so well-dressed. Want the perfect Italian suit? Look no further than Atlanta: http://t.co/eERbmK6q","See what the @RamblersBone crew is up to: http://t.co/Ck4RDxff","Don't get stuck only seeing double. Our case for the single monkstrap: http://t.co/ZR8Kq670","Sid Mashburn's ideal suit? Slim, not skinny. \"It would've looked good ten years ago and still will ten years from now.\" http://t.co/eERbmK6q","A hipster emporium no more, Urban Outfitters has stepped up its menswear game. Time to get on board: http://t.co/iQXlXONF","The Best New Menswear Designers in America: Ian Velardi, @OvadiaandSons @BLKDNM @mmcnairy @saturdaysnyc @toddsnyderny: http://t.co/Qi2per0L","The perfect $1,000 Italian suit comes from...Atlanta? http://t.co/eERbmK6q","\"Tortoise frames rather than black for sunglasses.\" - Style tips from @ilariaurbinati: http://t.co/Zx21RM3z","Ties from @Gap? You bet...and very nicely done. http://t.co/y7P5XQa0","\"We like our celebrities the way we like our politicians: plausibly human, not too human.\" Meet @ilariaurbinati: http://t.co/ctUytZ2r","\"It's been a dream really. I've found my niche.\" - Miles Johnson on @LEVIS Vintage: http://t.co/ZCVnpFA2 #menswear","‎\"People in L.A. talk about their bodies the way people in New York talk about their work... fucking constantly.\" http://t.co/L8vBgS4d","The styles you need, the fit you want, and how to put it all together with aplomb -- The GQ Guide to Suits: http://t.co/U82OAJdJ","RT @Wax_Wane: Know Your Sh&t: Madras - The first in a series I’ll be writing for @GQfashion on Menswear terms - Enjoy it folks http://t. ...","Sparta? This.. is.. Madras: http://t.co/mHL8IqvN","We're curious: how many of our followers get their suits tailored?","\"If Jay Gatsby had a store...\" Introducing Angelo Galasso's new menswear mecca: http://t.co/NcaGbLaY","How a Hollywood stylist dresses the stars: http://t.co/L8vBgS4d","RT @BrianCoatsBC: I love these amazing distressed Churchs suede shoes. http://t.co/gt1bNzG7","Stuff We Like: Feltraiger's Camo 'Cuda http://t.co/CCLx8SDO","You should be able to fit two fingers under your shirt collar. If you can fit more, it's too big.\nHollywood Style Tips: http://t.co/mXnm3c1W","\"When dressing down, you can't go wrong with raw, unwashed denim.\" Tips from a Hollywood Stylist: http://t.co/mXnm3c1W","The most important person behind an actor's image isn't his agent—it's his stylist: http://t.co/L8vBgS4d","RT @GQMagazine: The GQ Guide to Suits: http://t.co/MhkMarxA",".@zara_us is having a menswear moment: http://t.co/UTUqdsRZ","Hey @Rusty_Mill_Co, keep doin' what you're doin'. http://t.co/QNGwMdK9","\"The best style advice came from my parents: Be honest. Just be yourself.\"—Stefano Gabbana of @dolcegabbana: http://t.co/uJI1Ys6V","Here's why @HamiltonShirts' Brushed Cotton \"Flanelina\" Shirt is the best blue shirt we've seen in years: http://t.co/Bhy5XDq2","Our favorite boat shoes for spring: @BALLY_SWISS @bandofoutsiders @hmusa @SperryTopSider @sebago http://t.co/hy1iKQ2T","Who wore it better: Kanye West or a Baby Cheetah? http://t.co/BGJfDXPX","We've long waited to answer the question, what does one wear while filming Killer whales in Antarctica? http://t.co/AOIJm6lx #FrozenPlanet","West coast, rejoice. @UNIQLOUSA is headed your way: http://t.co/TOMOhTSQ","Looking for new boat shoes for spring? Think outside the prep: http://t.co/hy1iKQ2T","RT @BrianCoatsBC: “@NathanJOwens: GQ  http://t.co/eIXuTK2i”those were two of my favs that didn't run in the mag - thank god for the iPad ...","This Just In: @31philliplim hits the web: http://t.co/4xBnLmCj","\"It's simple: Everyone should have a black blazer.\" — Domenico Dolce of @dolcegabbana: http://t.co/uJI1Ys6V","Bring your swim trunks. And your flippie-floppies. The best new boat shoes: http://t.co/hy1iKQ2T","The Boat Shoe: It started out as Americana. Now it's dropping acid: http://t.co/hy1iKQ2T","RT @BrianCoatsBC: Post-shoot ride home from one of my fav guys- Arthur K. http://t.co/cG5o6HO8","\"Keep your jacket buttoned. Always. It's just really flattering—it will take pounds off you.\" - Tom Ford: http://t.co/B3Wooccz","Gym style? Yes, it's a thing. How to get your workout gear looking strong: http://t.co/gbmsFdWI","See the best (and worst) dressed from the offices of Sterling Cooper Draper Pryce: http://t.co/ZGh1hBAP","Three days: the amount of time it took Michael Paterniti to look, act, eat, and think like an Italian gentleman: http://t.co/jI1xQpHw","Ever booked a vacation just to try out a new suit? We haven't either, but these give us hope:  http://t.co/TPLQzfr0","\"The world needs more people who are serious, enlightened, and with an elegant spirit.\" - Brunello Cucinelli: http://t.co/jI1xQpHw","Stan Rizzo, Wearing Mustard, in the Boardroom: @therichdale talks to @madmen_amc's @JanieBryant: http://t.co/Z1Jgk71V","Does Zac Efron read @GQMagazine? You be the judge. http://t.co/UCeOzS3u","Microprints and foulard patterns? We don't hate it, Ginsberg. The Style Report on @madmen_amc: http://t.co/kDOWM3ZP","Happy birthday to the brilliant and talented @MarcJacobs!","Facebook buys Instagram. Your thoughts? http://t.co/BBHdY46D","RT @willwelch: YES! The full GQ 100, in all it's multi-faceted, service-y glory, is now online. Go learn some shit: http://t.co/xyOcoUU7","You can stop sending résumés now: Raf Simons is taking over at @Dior.","Peak lapels told us everything we needed to know about Don Draper. The Style Report takes on @madmen_amc, Episode 3: http://t.co/ZGh1hBAP","How to look, act, eat, and think like an Italian gentleman in just three days! http://t.co/jI1xQpHw","From Flanders's coolest kicks to Homer's iconic mumu moment, we humbly present The Bartorialist: http://t.co/y1ZoHlCM","Eat Our Shorts! Simpsons Runway Style: http://t.co/y1ZoHlCM","Don't make us tell you again that you need a sports coat right now. @ScoopNYC has you covered: http://t.co/RRFoCjuj","Okay, guys: No more baggy saggy b-ball shorts, no more pit-stained Señor Frog's tees. What to wear at the Gym: http://t.co/gbmsFdWI","Step your style game up. The GQ 100: http://t.co/GdNRlGnf","If you don't know, now you know: @ScoopNYC is on fire lately. The best goods of the moment: http://t.co/bGXZPgoa","The Bartorialist: A guide to the fashion of The Simpsons: http://t.co/y1ZoHlCM","No Sweats! Get your workout wardrobe in shape and the abs might just follow: http://t.co/EbtnPlNK","A heather gray undershirt prevented Elijah Wood from usurping the \"Coolest Look of the Last Year\" from Gosling: http://t.co/sXCnwQkI","Hey guys: you need to get your workout gear in shape, too: http://t.co/EbtnPlNK","D'oh! Couture: Real-life inspiration from Springfield's most fashionable citizens. We present The Bartorialist: http://t.co/y1ZoHlCM",".@ScoopNYC has impressed us with a tightly edited mix of menswear. Here are the best goods up for grabs right now: http://t.co/bGXZPgoa","The GQ Guide to a Workout Wardrobe: http://t.co/hkAyKOc5","Stanley Tucci vs. Ben Stiller: Who wore the gray suit/black polo better? (Hint: Stanley Tucci) http://t.co/6dw1aW36","Lose the saggy b-ball shorts: Fully functional gear that's sharp enough to turn heads in the gym and on the street: http://t.co/EbtnPlNK","RT @GQMagazine: Read this twice: We talked to @RealTracyMorgan about his Swarovski Crystal-Studded Michael Jackson Jacket: http://t.co/2 ...","RT @StyleGF: Good stuff coming from the @GQfashion team today, if you have time to burn til your half day kicks in: http://t.co/VCYDUMtN","By now you know we're fans of @NeedSupply. Check out this playful spring style video they put together: http://t.co/YeTNc0CC","Looking good for Fall 2012, @BananaRepublic: http://t.co/xbO7F08T #weseeyou","Awesome #EngineeredGarments reversible belt from @NepenthesNYC. Sweet Repp and tweed. -MS http://t.co/e9lQvoKC","\"Every age can be enchanting, provided you live within it.\" - Brigitte Bardot: http://t.co/yAXtMWsJ","RT @SHotchkissNYC: Squad Up! We picked the most stylish crews of all time: http://t.co/v33e3Ah5","RT @BrianCoatsBC: Today I learned when shooting with a diabetic horse, it's best not to feed him 6 apples. #sorryaboutthat","RT @GQMagazine: The Bartorialist: A guide to Springfield's most fashion-forward citizens: http://t.co/22dD4xDX","Squad Up: The Most Stylish Crews of All Time: http://t.co/CxiOpPSH","Are you a peacock? Don't be. Here's how: http://t.co/rjMLON7L","First Look: Warriors of Radness Unveils the Inspiration Behind the Rad Brad Tee: http://t.co/g3S5rW2m","Baseball is back. It's about time. How was your #openingday? http://t.co/HWFYeYfC @MLB","Exclusive Look: Michael Bastian for Barneys: http://t.co/PiwV3Jsa","Behati skateboard goodness courtesy of @3x1 and @WattsUpPhoto. Get your own at 3x1.us -MS http://t.co/MFWL68iy","If you're not familiar with the name John Pawson, it's time to get acquainted: http://t.co/550lxqMP","A watch doesn't have to be expensive to be a status symbol: http://t.co/73k0k8C8","RT @BrianCoatsBC: I know I am getting old when i walk into the fashion closet and the interns turn the music down. #keepondancintillthew ...","The \"Rad Brad\" Tee. May be NSFW, but that depends on where you work: http://t.co/g3S5rW2m","Happy Birthday @Pharrell. We dig your style. http://t.co/gi7aNdk5","Michael Bastian suits up for Barneys... and the results are good: http://t.co/s7IrizyD","Get your charm on the cheap: try a Parnis watch! http://t.co/ZyhvkTjR","If you're not into home runs and RBIs, @The_Masters start today, too. Here are the stylish young golfers to watch: http://t.co/q3yjtJZs","RT @GQMagazine: Yo, @taylorswift13, we're going to let you finish, but http://t.co/pTY6MfyA.","Store Opening! Welcome to London, Jack Spade: http://t.co/qPTP7FNs","We liked this @frankandoak Pencey Tie so much, we wrote about it: http://t.co/KhcruLQc","First Look: The Webster at Target: http://t.co/6Z0deAAK","Looking for a style icon that hasn't been ridiculously played out by the masses? Start with these guys: http://t.co/I2fFovGP","RT @BrianCoatsBC: Hey guys, take it easy with the cologne dosage so early in the am- remember to save it for your Sat nite booth at STK.","RT @GQMagazine: The GQ 100 is now available online, filled with the best looks, labels, and advice from our April 2012 #StyleBible: http ...","Hello, Mr. Nice Watch. The best men's timepieces from Baselworld: http://t.co/Mb6K6D0B","@bananarepublic hitting the right FW'12 trends. Seen here: pinstripes and a touch of mustard. -MS http://t.co/GNWrOzxZ","@bananarepublic monogram line three-piece suit killing it at their FW'12 preview - MS http://t.co/kcqocRws","Hey @RickSantorum, take notes: This is how you rock a sweater vest. @Graeme_McDowell: http://t.co/pmjJwFNk","@HamiltonShirts and @NickWooster digi and desert camo collaboration mash up -MS http://t.co/hirWPjcl","Our \"Test Shots\" man @JakeDavisFilms does some Warhol-esque shooting with @_ASAPROCKY: http://t.co/hqYeX58H",".@webbsimpson1: Polo madras, Kelly green, and ribbon belts. The classic gentleman. Augusta's Most Stylish: http://t.co/dzgRCIqR","Who's making red pants work this spring? http://t.co/MGZNShKZ",".@JakeDavisFilms captures one of our favorite new menswear designers, @ToddSnyderNY: http://t.co/rtYQlWsU","New Watch Alert. The best men's watches from Baselworld: http://t.co/oqmS2cdc","What are the pros wearing at The Masters? @GolfDigestMag's Mr. Style has a sneak preview: http://t.co/h0OVPqN1","We know the golf world isn't your typical go-to for style inspiration, but these guys might change your mind: http://t.co/dzgRCIqR","Coming soon: Kenneth Cole Collection. Have a peek at some of our favorite pieces: http://t.co/aMvhidqd","Sportsmen with swag: the most stylish young players at Augusta: http://t.co/dzgRCIqR","RT @SHotchkissNYC: 8 stylish young golfers to watch this week at Augusta: http://t.co/oEmbc6EU","RT @BrianCoatsBC: Worth a trek to the Upper East Side to see @Belstaff fall preview. #toughchic http://t.co/TQM0RAEm","Nine things every man should have in his pockets: http://t.co/gqJO2bsU","Invite us to something on this stationery, and we'll be there. J.W. Hulme and Pierrepont Hicks: http://t.co/QGxmZXdM","Who doesn't need a good pair of driving moccasins? http://t.co/8Ifkalsf","\"I have no employees. I do the design, I do the sales, I do the marketing, the merchandising.\" - Ian Velardi http://t.co/rgQyWasA","New labels, sick shops, bespoke socks... The options are astounding. But is it too much? We're here to help: http://t.co/vwoG4lDO #GQ100","Twitter's newest celebrity @TimGunn really loves SuitSupply: http://t.co/EF6HVPwF","This just in: @Nike suits up the @NFL: http://t.co/jz5d0joH","Also from @Ted_BakerUSA: the perfect sized backpack - slim and trim but can hold your daily haul - MS http://t.co/sSoWCfWt","@Ted_Baker killer flecked skinny ties for Fall '12 - MS http://t.co/6MDXiKi9","Presenting the GQ 100: Everything a man needs to know about style. http://t.co/vwoG4lDO","Top chef Alain Ducasse couldn't do without his @LEVIS 501s. \"By far the most comfortable jeans of any I've ever worn.\" http://t.co/rC3YVQJN","RT @BrianCoatsBC: Big shout out to @GQMagazine @GQfashion  for our 5 ASME noms. That's a lot- and General Excellence which is like Best  ...","\"All our best men are laughed at in this nightmare land.\" - Jack Kerouac http://t.co/5ZlzB4K3","Pastels are in, but.. play it cool, okay? http://t.co/5uzlUsx1","Thinking of adding a little color to your wardrobe? Now's the time. This and other tips from The GQ 100: http://t.co/vwoG4lDO","Okay so it was @teamVic in the end, on hand to unveil @Nike #nfl gear -MS http://t.co/THK52SRH","This @Nike #NFL launch is no joke. We have turf and massive tv (and possibly Tebow?) -MS http://t.co/MhADqlgW","@nike new NFL gear. Cool quilted reversible bomber (the reverse is black). -MS http://t.co/VW5KXGay","The best color for men's pants this spring? We're seeing red: http://t.co/naeQnkdG","Want a better-fitting suit? Just sleep in it till it molds to your shape. Yes, really. The GQ 100: http://t.co/GHV0V2f3","The biggest trend in scent is gender-neutral. These are our favorites for body and home: http://t.co/69xmPqyS #GQ100","Cold weather, cool looks. Ben Ferrari Street Style: http://t.co/tm2gwYHP","The burgundy Gucci suit: Is it a sartorial right of passage for teen heartthrobs? http://t.co/iaHz4ayH","Exclusive First Look: Behind-the-Scenes at the Getty Archive http://t.co/0K4l3HDo","RT @BrianCoatsBC: Either it was very windy in LA last nite or Juicy Couture's new ads are getting super edgy. http://t.co/mfeOuc5w","Remember us telling you about the season's best keyhole sunglasses? We suggest you start with these: http://t.co/729d23UR @MOSCOT","RT @SHotchkissNYC: @impossiblecool and @soniceditions hit the Getty Archive in LA and all I got was this f%&kin' blog post: http://t.co/ ...","Meet @madmen_amc's denim-rocking new copywriter, Michael Ginsberg: http://t.co/Wze2UWB8","\"A Conversation on Japan\" at PROJECT Wooster: http://t.co/Y8afKu7I","From pants to pastels, everything a man needs to know about style. We present the GQ 100: http://t.co/vwoG4lDO",".@madmen_amc's set decorator takes us through Don Draper's swanky new pad: http://t.co/5vF2ht7v","RT @RugbyRL: Not to be missed: @gqfashion's @shotchkissnyc interviews @impossiblecool about his latest vintage photo collection: http:// ...","The Style Report takes on Sunday's episode of @madmen_amc: http://t.co/vGTqYT7g",".@JayCutler6 likes them, you should too. The best red pants under $100: http://t.co/naeQnkdG","@StyleGF Let's play the blame game for sure.","As @KanyeWest told us in an email, \"Riccardo is super dope!!!\" Why you should know Riccardo Tisci: http://t.co/2lXGH83y #GQ100","The best red pants for men, all under $100: http://t.co/naeQnkdG","\"I don't know where I'm going from here, but I promise it won't be boring.\" - David Bowie http://t.co/LMKyZyim","Red is the color that should be making an appearance south of your waistline this spring. Here are our favorites: http://t.co/naeQnkdG","We present The GQ 100: Your guide to a stylish new world: http://t.co/vwoG4lDO","Don't Be Such A (Pea)Cock: Five rules for wearing the trends the right way: http://t.co/YjWHVvuB","This twit is a Frankenstein's monster of street style. Don't become The American Male Peacock: http://t.co/YjWHVvuB","Swagger-Jacking the Week in Style: Tom Brady Edition http://t.co/0TutiQsF","We always advocate a pop of color, and there's no reason that it can't come from your sports jacket: http://t.co/cnWdIedF","A brown suit doesn't have to look so... brown. Dave Franco demonstrates: http://t.co/mSJ4lxQi","Style Tip: Unless you are Steven Tyler, the point of a scarf is to keep you warm. http://t.co/YjWHVvuB","How to wear a brown suit the right way: http://t.co/mSJ4lxQi","The most important piece in your wardrobe? Spring sports jackets. The ones to wear: http://t.co/prTcwb21","RT @cmbenz: I'm just gonna say it - if you're wearing those slip-on Chucks \"without laces\" I know everything about your life.","Kudos on the killer tan, Josh Hartnett. The Week in Style: http://t.co/ivmagjmL","\"Hands. They're so awkward! Where do you put them?!?!\"—celebrities this week. The Week in Style: http://t.co/FrZ2WqtI","We can't get you Gisele, but we can teach you how to dress like Tom Brady: http://t.co/0TutiQsF","Apparently, Gerard Butler is also celebrating National Cleavage Day: http://t.co/NgXCjzZW","Style Tip: If you can see your lapels in your peripheral vision, they are too wide. http://t.co/YjWHVvuB","Paul Stuart Custom. Smooth as Butter. http://t.co/0nidv9E8","Cool Stuff: Surf's up with @CHANEL: http://t.co/zpd4K05J","Here are the spring sports jackets that will ensure you make the warm weather transition in style: http://t.co/prTcwb21","We see you, @TimGunn.","GQ's Field Guide to the American Male Peacock: http://t.co/YjWHVvuB","The American male peacock is not a bird. He is, in short, a monumental douchebag. Here's how to identify him: http://t.co/YjWHVvuB","Mini-dresses, hoop earrings, and hammer pants. It can only be The Week in Style: http://t.co/FrZ2WqtI","@HarperEllis_ Any reason is a good reason if you ask us.","The spring blazer might be the most important piece in your wardrobe. Make sure you get it right: http://t.co/prTcwb21","Spring sports jackets are back. Here are the ones to wear: http://t.co/prTcwb21","How do we feel about the red pants? http://t.co/tWZPRn1N","Hollywood's freshest rookie, Dave Franco (don't call him Li'l James!), breathes some life into the brown suit: http://t.co/mSJ4lxQi","Pretty impressive sculpture style feature wall from @JoeFresh for their big fifth ave opening -MS http://t.co/OOMhfRnR","Grease is the word: the good people at J.M. Weston have a great new product to keep your soles looking brand new: http://t.co/o7K4kvDU","Best New Menswear Designers in America: @JakeDavisFilms captures Ovadia & Sons: http://t.co/9EQtB7Ia","We're digging the iconic biker inspiration behind Left Field NYC's 2012 denim lookbook: http://t.co/ad1FVL88","RT @BrianCoatsBC: Getting the magic hour light means the crew needs a boost. #longday #onemoreshot http://t.co/2OiZmsfO","RT @SHotchkissNYC: Al Pacino in Serpico is a Top 5 dead or alive style icon for me: http://t.co/pJNnkotT","We saw brown suits inch their way back the past few years, but now they've hit a critical mass: http://t.co/TmWVS3kN","No pattern is more southern than gingham. No designer does it better than Sid Mashburn: http://t.co/oqhxiLmO","Whether trying too hard or not at all, these men have broken rule after rule. GQ's worst-dressed of March 2012: http://t.co/O8cY5UkT","You'll want to pack this scarf for any and all summer excursions (at least until your girlfriend steals it): http://t.co/OZyiaXEy","Tip: Match a pair of red pants with a gray blazer for an instant boost of style and confidence: http://t.co/EdeHH550","We want answers: who's styling Victor Cruz? http://t.co/obcJvX4i @TeamVic","Brown is having a moment—just like our cover star, Dave Franco: http://t.co/TmWVS3kN","Attention @Ludacris: All it takes is a polygonal pocket square to sabotage an otherwise perfectly sharp suit: http://t.co/O8cY5UkT","Forever in blue jeans? This season, try throwing a little red into the mix: http://t.co/EdeHH550","The brilliance of @bandofoutsiders. \"button\" and \"little button\" finishing on 5 pocket cords - MS http://t.co/n99S4QYt","The ultimate in sweatpants by @bandofoutsiders. Killer cargo pockets too. -MS http://t.co/1kDMrXXp","Nautical knot ties from @bandofoutsiders - MS http://t.co/NxDM7AMW","RT @BrianCoatsBC: Behind the scenes - Michall Lewis getting a pre-shoot trim while reading his suspense novel in Hebrew. http://t.co/zI6 ...","What's the best color on jeans this season? We're seeing red: http://t.co/EdeHH550","The worst-dressed men of 2012 (so far): who made the cut? http://t.co/O8cY5UkT","Don't you know it's all about the accessories? Here are some of our favorites: http://t.co/SDOAhM3J","And @converse brings their take in the hiker. Big boot look without the bulk. Dig those red laces too. -MS http://t.co/QtKbWrPG","@UGGaustralia bringing your fave puffer vest to your feet. Cool take on a classic snow boot -MS http://t.co/ZegOkXwS","It's all about the accessories. The best to wear and where to buy this season: http://t.co/SDOAhM3J","It's time to say \"Hay, Y'all\" to your inner Southern Gentleman: http://t.co/oqhxiLmO","Why own a @hamiltonwatch? They say, \"I'm a baller, but I'm not a dick.\" 11 Must-Have Accessories: http://t.co/SDOAhM3J","Yo, @adamlevine, aren't movie stars and rockers supposed to wear suits, sunglasses and leather? http://t.co/WbaSLVFV","Boardwalk Empire' star Michael Pitt channels a Palm Springs playboy for Prada S/S 2012. Is there anything he can't do? http://t.co/9ya9si8z","We're digging @MIANSAI bracelets: the nylon cord and brass anchor casts off a great nautical vibe. http://t.co/SDOAhM3J","Superior sequels are rare in Hollywood, but we damn well expect it in the design world. Good thing for Outlier x FEIT: http://t.co/MsUYI62d","Hey @ClubMonaco, we love the new look! http://t.co/jMNGrIVE","The real Archer finale shocker: A new tie bar! Welcome to the 2010s, Sterling: http://t.co/JOkhEKl3","In a field suddenly crammed with brands, these are our favorite accessories: http://t.co/SDOAhM3J","RT @BrianCoatsBC: Love all these short tie bars- very #GQ http://t.co/7gM2NpdV","RT @GQMagazine: \"How to Dress for Spring Break,\" A Short Statement From James Franco: http://t.co/eGDjeVP3","Don't miss Wolverine 1000 Mile's Ramblers Bone Project: http://t.co/8kUiGjOG","Does your wardrobe need an upgrade? Start here. The 25 Best Men's Stores in America: http://t.co/WdWk1f6w","You're gonna want this suit from @kennethcole collection. Slim tailoring but with just the right amount of s http://t.co/fe3lLxna","Rugged, urban, and informed. We like what's happening at @ernestalexander: http://t.co/BQpKWPYK","@kennethcole 2-in-1 topcoat with zip off bottom for Fall 2012. http://t.co/TOoCTbpy","Very cool life size digital models in motion at Kenneth Cole http://t.co/U6UkhAsJ","Print is everywhere. Camo is everywhere. Why not toss a little of the two together? The result: http://t.co/4QmLboRx","We first fell in love with @ernestalexander for their satchels, but founder Ernest Sabine isn't stopping there: http://t.co/BQpKWPYK","Editor's Pick: @SandastUSA Bourbon Leather Bag: http://t.co/eL0G9ABe","@danielcummings We're holding you to that.","Will you learn something? Maybe. Will shit get weird? Probably. Godspeed, @mikaelkennedy @impossiblecool: http://t.co/8kUiGjOG","Stuff We Like: The Evolution of @ernestalexander: http://t.co/BQpKWPYK","The Daily Endorsement: Shades of Grey by Micah Cohen Safari Jacket: http://t.co/4QmLboRx","Two of our favorite photographers are hitting the road in search of the American dream: http://t.co/8kUiGjOG @mikaelkennedy @impossiblecool","These are the 25 best men's stores in America. Road trip, anyone? http://t.co/WdWk1f6w","\"A flask of booze is an easy way to make friends.\" Nine essentials for all men: http://t.co/gqJO2bsU","\"My body could stand the crutches, but my mind couldn't stand the sideline.\" - Michael Jordan http://t.co/VKMGUZ7b #morningshot","What's in your pockets? We asked Michael Williams of @AContinuousLean to empty his: http://t.co/gqJO2bsU","RT @BrianCoatsBC: \"make the pig face the camera!\" was just said on set @GQfashion . (was not the talent)","Color on display at @DIFFANational - NE http://t.co/jwK9uam9","Attention, @TimTebow. You're a New Yorker now. It's time to dress like one. We're here to help. http://t.co/VMoUrDsV","Talking hip-hop with @RichardChaiNY, @JayZ enthusiast. - NE http://t.co/MTeHYAnk","Reoccurring theme: Booze. Wine-bottle lamps, anyone? - NE http://t.co/UbIuzcCf","Confirmed: The grooms will occupy this cake all night. -NE  http://t.co/9OrL6EdU",".@richardchainy x EFFEN for @DIFFANational - NE http://t.co/u08KPmAf","The most affordable route to jacking Rooney Mara's swag? 'Dragon Tattoo' collections from @hmusa. The collaborators: http://t.co/iouILYJM","Looking for a nice watch? You're going to need @HODINKEE: http://t.co/mYYgibi5","We found this @technodrome1 piece of @lordrochester in our inbox this morning. Check it out: http://t.co/RgtY2YtZ","Who says prepsters are on the way out? Nobody, if they were paying attention at #NYFW: http://t.co/uuSiccMX","Tim, it's time to bench that Denver wardrobe. We examine @TimTebow's sartorial side: http://t.co/VMoUrDsV","This Just In: GANT Yale Co-op Shirt Collection: http://t.co/S5C44odY","First Look: Dior Homme Pre-Collection Fall 2012 Lookbook: http://t.co/RfO7cZcd","We talked to @madmen_amc's costume designer, Janie Bryant: http://t.co/nEtUjVqW","If there were ever a good time to go gray (in the watch world, at least), it's now. Victorinox's Swiss Army 'Original': http://t.co/rTvxiNdY","Hipster brewery + hipster clothier = hipster trapper hats. The world of designer collaborations: http://t.co/iouILYJM","What does success smell like, @RealDonaldTrump? http://t.co/8RthjEfK","RT @GQMagazine: Congrats to @JamesAugustus, winner of our our #StyleBible giveaway. Stay tuned to @GQMagazine and @GQFashion for future  ...","\"Everybody has talent, it's just a matter of moving around until you've discovered what it is.\" - George Lucas http://t.co/crL7mcuB","Stodgy old behemoth brands and hot young designers have all gone wild for collaborations. Our guide to who's-with-who: http://t.co/iouILYJM","The Style Report: We present the five best-dressed gents from the offices of Sterling Cooper Draper Price: http://t.co/iOZ9KsTj","RT @GQMagazine: Zou Bisou Bisou? Just what was that French song that Megan Draper was singing on @MadMen_AMC? http://t.co/zuV3MG6g","Upper-crust East Coast swagger isn't going anywhere any time soon. Preppy Style: http://t.co/uuSiccMX","Who's collaborating? We created this handy cheat sheet so you can keep track of how your favorite designers get around: http://t.co/iouILYJM","Be sure to catch our Q&amp;A with @RealDonaldTrump, scent enthusiast: http://t.co/8RthjEfK","RT @GQMagazine: Welcome back, Don. #MadMen","If you're going to wear a gray suit, liven it up a bit. Go crazy; play around with bright colors and brash patterns: http://t.co/6jOs4mrI","What does success smell like? We asked @RealDonaldTrump: http://t.co/8RthjEfK","That leather jacket you can rock 'til it falls apart: worth it. Here's our pick: http://t.co/aAnqffoR","\"I've never fired anybody for the wrong cologne.\" - @RealDonaldTrump, Scent Enthusiast: http://t.co/8RthjEfK","RT @GQMagazine: We'll announce the winner of our #stylebible giveaway on Monday morning. Thanks to all who entered—we're honored to be y ...","Watch. Smile. Buy good jeans. @3x1 Presents \"Dear Lily\" by @Poppyfilms: http://t.co/0kLJSNOB","John Slattery shows us how to rock a gray suit, like only TV's favorite silver fox can: http://t.co/6jOs4mrI @madmen_amc","RT @3x1: Watch \"Dear Lily\" our film by @Poppyfilms via @GQfashion - http://t.co/Yz6YTnWd","Want the goods to look as paparazzi-ready as Liam Hemsworth? Look no further: http://t.co/aAnqffoR","\"Design means you can create beautiful things, whatever that is or whatever you choose to do.\" - @RichardChaiNY: http://t.co/7yaTtSX2","All this hidden behind a Snapple machine? That's @bdgastore in Beantown - SH http://t.co/JESKNICi","Welcome to @bdgastore in Boston - one of our 25 best stores - SH http://t.co/0XHp6156","In NYC this weekend? Head to Pier 94 and check out installations from @DIFFANational, featuring @RichardChaiNY: http://t.co/7yaTtSX2","Exclusive First Look: 3x1 Presents \"Dear Lily\" by Poppy de Villeneuve: http://t.co/0kLJSNOB","RT @BrianCoatsBC: “@prabalgurung: Is it about doing this in Nepal? going to the Mt.everest base camp?  http://t.co/aFMFIbja” I love look ...","Want to swagger-jack Liam Hemsworth's leather jacket style this weekend? http://t.co/Ut4dDueF We've got you covered: http://t.co/aAnqffoR","First Look: @RichardChaiNY x EFFEN for @DIFFANational: http://t.co/7yaTtSX2","Best Stuff of the Week: Dror for Tumi Expandable Suitcase: http://t.co/kDXJbAju","1950s Hollywood clearly hadn't discovered the sleek, angular textures of future style that would come. http://t.co/BnYar4Em","RT @NateErickson: My first piece for @GQFashion. Thank you @RichardChaiNY x @DIFFANational: http://t.co/IIo0P0yv","Don't forget! You still have the chance to win free GQ swag: http://t.co/yPVUTJ8T #StyleBible","@NathanKovach @jcrew_insider Which store?","@suitsupply shirts for days - MS http://t.co/MfwzXT2Y","The Week in Style: @TheHungerGames' swagger battle continues: http://t.co/Ut4dDueF","one of our favorite duffels from @Herschelsupply spotted in use on the NYC streets. -MS http://t.co/M3KGkPaM","Are we in Milan? Dreads with a suit on a motorcycle. -MS http://t.co/l3lbO2x4","Today only! Is @GQFashion your #stylebible? You could win free GQ Swag: http://t.co/yPVUTJ8T","This just in: @CalvinKlein Fall 2012: http://t.co/guXjDVp6",".@johnthecho demonstrates the magical properties of a perfectly tailored suit: http://t.co/OjsDYxw7","At a @RickSantorum rally, the best accessory is a handmade sign. @GQPolitics tackles Conservative Street Style: http://t.co/cseH5xAq","Dear Christopher Stanley: A plaid blazer is a different brand of dick-swinging altogether. The Week in Style: http://t.co/Q3uxa5k0","The stars of @TheHungerGames competed for a different prize this week: GQ's Best-Dressed list. Who survived? http://t.co/Ut4dDueF","Our friends at @ParkandBond dipped into the current pool of New York's finest ad minds for some style inspiration: http://t.co/PyDqFfWG","Hollywood's vision of the future is usually rather bleak, and the fashion is no exception: http://t.co/3N3XeGXs","Future style: We scoured the sci-fi archives, combing through the sartorial choices of every future-set film ever made: http://t.co/BnYar4Em","Exclusive First Look: @ToddSnyderNY shares his #NYFW memories: http://t.co/8Rz02KwX","From anoraks to swim trunks, do you know the trends that matter in Spring 2012? Don't worry, we've got you covered: http://t.co/F0aMdFjZ","CONTEST: RT this tweet or tweet this phrase to win free GQ swag: \"@GQFashion is my #StyleBible!\" Rules/prize info here: http://t.co/yPVUTJ8T","RT @BrianCoatsBC: I love when you go to @CalvinKlein appointment and this is totally normal. Shout out to Thor! http://t.co/IhqeQoyp","RT @GQMagazine: CONTEST: RT this tweet or tweet this phrase to win free GQ swag: \"@GQMagazine is my #StyleBible!\" Rules/info here: http: ...","At MSG for the Black Keys with RL Denim &amp; Supply - SH  http://t.co/K4UWka0m","Fans camp overnight for Ronnie Fieg's kicks. \"My customers are like my family.\" Welcome to @kithset: http://t.co/tp08c8xp","This NUMBER:Lab zip jacket is looking like our go-to weekend wear for the foreseeable future: http://t.co/LStHXkWh","Cool venue for the @ernestalexander fall preview - Bauman Rare Books -SH http://t.co/2bxkc6BP","New jackets from @ernestalexander for fall - SH http://t.co/PUDhW6WO","That boy Kyle from @_NATIVESON came through with the coolest trucker in the game! - SH http://t.co/wg7O6IsP","#shoeporn: These Leffot x Alden Marble Indy Boots had us drooling on our desks. http://t.co/ZUCiHBdt","Fighting Style: Why You Need an M-65 Jacket: http://t.co/m693RPS9","Looking to lighten up your jacket with the warm weather? Look no further than NUMBER:Lab. http://t.co/LStHXkWh","RT @BrianCoatsBC: House of mirrors @CalvinKlein with Alex Cuhna. http://t.co/qvJPZDs4","Ronnie Fieg doesn't mince words. \"I want this to be the best shoe store in the world.\" We spotlight @kithset: http://t.co/tp08c8xp","When buying for a new home, keep it simple. Hollywood's most trusted interior guy, Trip Haenisch, has a few pointers: http://t.co/831fCPlj","Sharp-dressed men and those looking to join them: get to know the name Ian Velardi. http://t.co/s8S6kvew","Its military heritage aside, the M-65 makes for a pretty impressive everyday jacket. Here's how you can wear it now: http://t.co/m693RPS9","RT @BrianCoatsBC: Man Spanx and suntan lotion @giveawaytable #gqmag. http://t.co/ECQ4w4Ru","\"Blame is for God and small children.\" - Dustin Hoffman http://t.co/7XKnzNI6","From @billykirkinc to @filson, American-made is back in style. Here's our guide to the best of the best: http://t.co/ZfaBmgBM","We Made It In America: An illustrated map of homegrown brands that are back in style here and abroad: http://t.co/ZfaBmgBM","Whether your style is more ten-hut or at ease, here's why you need the an M-65 Jacket now: http://t.co/m693RPS9","@calvinklein new look of layering, vest over a trench. If you want to try it at home take their lead and kee http://t.co/BBu2spWv","Team @gqfashion looking good for the @calvinklein fall 2012 presentation with CK's Kevin Carrigan cc:@brianc http://t.co/rxBHvDlt","The perfect western denim snap button front shirt from @calvinklein jeans - MS http://t.co/MN78hbXP","Lovin this @calvinklein gray flannel number with color blocked turtleneck and sweater combo - MS http://t.co/HvVwuIwI","Obsessed with these @mmcnairy suede shitkicker boots for fall - SH http://t.co/PSP1SpKy","New @alexanderolch belts at @paulandwilliams - SH  http://t.co/uuVFDUor","So by now you've picked up that we're pretty keen on striped silk knit ties for spring, right? http://t.co/qgShKXiH","Get ready, men. Your dress shoes just copped an attitude: http://t.co/LlAd8BpB","The Corsillo brothers have been doing some seriously so-weird-they're-cool lookbooks: http://t.co/1KWoFzZ6","Quite possibly the coziest Henley out there. Can you feel that? Shade of Grey by Micah Cohen - SH http://t.co/05zQomVT","PRO-TIP: Swap the strap on a watch and you've got a whole new timepiece. How to buy vintage watches: http://t.co/wE0wPoVe","The Daily Endorsement: Manolo Costa New York: http://t.co/jbUHEGNA","Your dress shoes just copped an attitude. Could you rock the blue and yellow? http://t.co/Qz0ankho","\"In America, if you succeed you don't have to apologize.\" - Lapo Elkann http://t.co/kUFFE9K5","A World Series MVP. A White House guest. The only thing average about @dfreese23 was his style. Until now: http://t.co/Jxxym4Ue","\"They actually do beer baths in Germany, and that's supposed to be really good for your skin.\" Jeff Laub's Essentials: http://t.co/vZeA9iQP","We gave St. Louis @Cardinals third baseman David Freese (@dfreese23) a style boost fit for a champion: http://t.co/Jxxym4Ue","The keys to a perfect vintage watch: Keep it simple, mechanical, and iconic. Easy, right? http://t.co/wE0wPoVe","RT @BrianCoatsBC: Love the shout out to the major Jim Moore! Video: Drake Raps an Exclusive Verse for GQ: Video: GQ http://t.co/EAxwUj2L ...","Remember when shoes were just black or brown? Yeah, neither do we. The best new dress shoes for men: http://t.co/Qz0ankho","RT @BrianCoatsBC: Early morning flight/ shoot. Jen and Paul are riding with me. #thismeansluck http://t.co/GMenoi04","RT @SHotchkissNYC: Congrats to Mr. @JakandJilBlog for a great  @clubmonaco collab and event - no surprise nearly everyone was in the house.","Classic Americana meets modern style in the H.W. Carter &amp; Sons Fall 2012 Lookbook: http://t.co/vwctNLCe","At the beach in Venice without your trunks? Not to worry, @steven_alan's got you covered. The best of Abbot Kinney: http://t.co/vsgen6R0","Exclusive Sneak Peek: @maison_kitsune comes to New York: http://t.co/HQ9qAB9E","Good stationery can make anyone seem dignified. Big thanks to Ted at @terrapinprints - SH  http://t.co/zop6gWpd","Our cover star @Drake has never had an office job, but that hasn't stopped him from being young and moneyed: http://t.co/WFwBTUVM","Camo Jerseys: Yes or no? The @Raptors say yes: http://t.co/9rXakRnw","It's the only place where you can buy an ice-cold Yoo-hoo and a clean pair of Jordans. Boston's own @Bdgastore: http://t.co/cphgVyxN","We caught a glimpse of the new @saturdaysnyc in Tokyo. How do you say expansion in Japanese? http://t.co/LntzSvx8","Having your own style means breaking a few of the rules now and then—just know which ones to break. We'll help: http://t.co/WFwBTUVM","Take it from @Drake: you want a suit that's the business—not a business suit. http://t.co/WFwBTUVM","So edgy, it hurts. The racks at @nepenthesnyc will inspire you to pull off looks you never thought possible: http://t.co/amPO9kFc","We're liking what we see in the H.W. Carter &amp; Sons Fall 2012 Lookbook:  http://t.co/vwctNLCe","Just about everything in GQ's #StyleBible (plus delicious cocktails and a swim) can be had on Abbot Kinney Boulevard: http://t.co/E1DX5Nwl","We present our list of the 25 Best Men's Stores in America. Which one is your favorite? http://t.co/WdWk1f6w","RT @SHotchkissNYC: I creeped around and shot the hottest women at South by Southwest: http://t.co/NzzYpB9u","RT @BrianCoatsBC: Behind the scenes April issue. @jodiebolandmkup hard at work as usual on @NathanJOwens shot by @WattsUpPhoto http://t. ...","The Daily Endorsement: Red Wing Heritage Sage Mohave Work Chukka: http://t.co/sXF1wEh6","Podcast: @lordrochester and @MichaelHainey discuss GQ's #stylebible, Glenn's encounter with @fucktyler, and more: http://t.co/tC4Q60t3","The eternal question: Jeans or Chinos? http://t.co/9yYZp224","VIDEO: The Style Guy (@lordrochester) meets Tyler, the Creator (@fucktyler): http://t.co/i2r6Yhk7","Zara's got a brand new look: @GQFashion got a sneak-peek at the brand's 5th Avenue flagship: http://t.co/fREak7TA","\"They don't associate themselves with other brands that they don't respect or actually like.\" @fucktyler talks Supreme: http://t.co/Lh5SWMFd","Tommy Ton of @JakandJilBlog fame captures the most eye-catching kicks on men from around the globe: http://t.co/bkX3fb2y #streetstyle","RT @EricRayDavidson: We gave WorldSeries MVP David Freese an upgrade - Looking sharp buddy! Cc @dfreese23 @GQfashion @BrianCoatsBC #MLB  ...","\"It's sort of a non-strategy strategy. I think it just comes out having integrity.\" -  @lordrochester on @supremeny: http://t.co/Lh5SWMFd","Merch We Can Believe In: We're an impartial party here, but @BarackObama's supporters are killing it in the style game: http://t.co/r3Gvlija","Sad But True: Simon Spurr leaves namesake brand: http://t.co/dqb4kiNU","If @fucktyler and @lordrochester can wear @supremeny in their own way, then so can you: http://t.co/Lh5SWMFd","RT @BrianCoatsBC: It's an understatement to say the Simon Spurr news is sad. And ironic right after a CFDA nom for best designer.","Step your game up. The @GQMagazine Spring 2012 Trend Report: http://t.co/F0aMdFjZ","GQ's cover man, John Slattery, knows a thing or two about dressing down a well-fitting suit: http://t.co/PE9i110B","Fun Fact: Alice Cooper only has shirts that look like this in his closet. http://t.co/HAMQl2Bh",".@JasonSegel and Ed Helms forgot they had Judah Friedlander in their closets: http://t.co/jLlhEPXA #weekinstyle","Kweli on the ones and twos - SH #stylex  http://t.co/FLAYSVIn","#1 rule in Austin... Hydrate. - SH #sxsw  http://t.co/bsFO366s","What will the well-dressed man be wearing this season? http://t.co/F0aMdFjZ","Follow these style rules and stay looking fresh this spring: http://t.co/DfYt2Rck","Ready for Day 2 on the streets of Austin - #sxsw -SH http://t.co/JJwiva02","VIDEO: Dave Franco learns a thing or two about style from GQ's Jim Moore: http://t.co/rQ7rXcyy","Brace yourself: red pants are coming. Street Style with @benferrariPHOTO: http://t.co/RKhT8A52","RT @Lantzzer: As they say in fashion..one day you're in..and the next day you're out. Thank you @GQfashion for making me a better man. I ...","@dvb Speaking of jumpsuits... http://t.co/qc2AeUdV","Sad Pitt! That jumpsuit would have been a homerun with a little crotch tailoring: http://t.co/eE6icTxS #weekinstyle","The wall of signed Converses at @thefader fort - SH #sxsw http://t.co/7CJEqQal","First Look: Cesare Attolini opens its doors on Madison Ave: http://t.co/wZDVyxn9",".@benferrariPHOTO trained his expert lens on the streets of NYC. It's beginning to look a lot like springtime: http://t.co/RKhT8A52","The only rule for growing a mustache, if you're Matthew Broderick, is that you should not: http://t.co/qc2AeUdV","Some beauties from @rancourtco - Kyle is the man - SH #stylex  http://t.co/DJdBPYoJ","Mike from @taylorstitch showing off the new belts - SH #stylex http://t.co/2zogSOCD","At the NikeFuel station in Austin, TX with @marcustroy and @tuckedstyle #makeitcount - SH http://t.co/D01jmEdG","RT @BrianCoatsBC: Happy Birthday Jerry Lewis! Anyone on twitter actually know who that is?? #eternalkid","“I have a theory that the truth is never told during the nine-to-five hours.” - Hunter S. Thompson http://t.co/sLo5zqLV",".@UrbanDaddy's Randy Goldberg killed this super clean setup at @AspenFashionWk: http://t.co/fFIE9x8q","Rutherford B. Hayes: Style Icon? http://t.co/lHMN9Yix","RT @BrianCoatsBC: “@NathanJOwens: I posted a new photo to Facebook http://t.co/OiL4PA01” that was a fun day! @jodiebolandmkup had a hard ...","It's a tie! (Three ties, in fact.) #stylebible RT @ejsamson: Which one's your favorite? http://t.co/Fn4i2DLq","Slope Style: @trendland's Cyril Foiret is killing the silk scarf/chunky cardigan combo at @AspenFashionWk: http://t.co/y1tqG8w1","Exclusive: Behind the Scenes at Fashion Week with @JakandJilBlog x @ClubMonaco: http://t.co/ByvPH2RA","VIDEO: Meet the trio behind the Big Apple's coolest surf spot, @saturdaysnyc: http://t.co/NSUmVj3T","RT @BrianCoatsBC: Think you have an organized office? Check out my friend @sharkeyhome. Books organized by color. http://t.co/5hrFJuvU","RT @BrianCoatsBC: I wish I had a cough button on my desk always! Good one @MarthaStewart http://t.co/qc0womSN","#girlwatchinginphilly: blogger @theglamourai  @ philadelphia train station http://t.co/ehp5TaX1","@PaulSmithDesign 25th Anniversary NYC party: the perfectly laid back affair from one of fashion's coolest du http://t.co/8yrBvMRd","carpet baggin' it @PaulSmithDesign NYC 25th anniversary store party http://t.co/m6aHlq3d","The holiday that brings out everyone's Irish spirit also tends to bring out a host of style disasters: http://t.co/YaaTmOST","Polka dot tie perfection with some micro gingham from @PaulSmithDesign -MS http://t.co/kyH8Qeyd","Suits stored behind some handsome glass doors @shop_zara fifth ave flagship store - MS http://t.co/0ZXCxrx4","@shop_zara limited edition collection at new fifth ave flagship. Crazy good suede moto jacket at a ridiculou http://t.co/3MgBr8IS","@PF_Flyers 75th Anniversary kicks on display with some seriously good fried chicken at Bowery Diner -MS http://t.co/QGFZHiYg","Stuff We Like: PUMA x Undefeated Clyde Sneakers http://t.co/ENQ4JqmB","Our style do's and dont's for St. Patty's Day will separate \"Erin Go Bragh\" from \"Erin Go Bro\": http://t.co/YaaTmOST","RT @GQMagazine: Happy birthday to one of our favorite knights, Sir Michael Caine: http://t.co/tmuWINbB","RT @BrianCoatsBC: questions about organizing your closets? tune in @martharadio SiriusXM 110 5pm est - I helped @sharkeyhome get rid of  ...","\"We want to stretch people a little bit and inspire them in a different way.\" - Andrew Pollard of @projectshow: http://t.co/T3FUYuDq","VIDEO: Go behind the scenes with @Drake as he talks to @GQMagazine about his personal style: http://t.co/lJTtmQen","RT @BrianCoatsBC: Is it ironic that Fashion Star is based in LA? #really? #nooffensebut...","Fact: The real-life John Slattery is no less stylish than his Mad Men counterpart, Roger Sterling: http://t.co/UPWOMDbc #stylebible","RT @BrianCoatsBC: I've lived in NYC a long time - my very first being trapped in an elevator. #omg #claustrophobia #notchic http://t.co/ ...","Announcing GQ's First-Ever Style Bible. We proudly present everything a man needs to know to look his best in 2012: http://t.co/y3e7ZA09","RT @richardblandino: The gorgeous Kenza @GQMagazine #stylebible event with GQ's own @BrianCoatsBC http://t.co/pm2ZQTGt","Sending hello's to @kimkardashian from Jim Moore at our @GQfashion #stylebible party. Wish you were here.","Thanks to all if the #menswear peeps who came out tonight to support the @GQfashion April #stylebible. Hope good times were had by all.","RT @JakeDavisFilms: Big thanks to the @GQfashion men and all the nominated menswear designers for a great #stylebible evening.","Big thanks to @ejny from @saks for coming to the @GQfashion #stylebible party tonight. Great guy, equally great style.","@NickWooster is in the house at the @GQfashion #stylebible party. #menswear is officially all under one roof.","Getting ready to take the 2012 Best New Menswear Designers in America class photo #stylebible  http://t.co/Oe1MLm3j","Getting ready totally the 2012 Best New Menswear Designers in America class photo  http://t.co/yVXUqiCj","@toddsnyderny chatting with @mmcnairy, @OvadiaandSons talking up @Saturdaysnyc and #IanVelardi. It's a beautiful #BNMDA #menswear moment","RT @shipley_halmos: Style Guide bringing the a-game RT @GQfashion: @shipley_halmos just got here. It's a moshpit of #menswear tonight. - MS","An exclusive sneak peek of the @gqfashion April #stylebible. See the full reveal tomorrow on http://t.co/oQO4KMOO http://t.co/s6Y01huO","RT @tylerthoreson: It's like #menswear Davos af the launch party for the @GQfashion #stylebible","@tophergrace making preppy look right at tonight's @GQfashion #stylebible party.","@parkeandronen in the house and have us thinking we need to put some serious thought into our swim this summer. @GQfashion #stylebible","The man who mastered the blazer in our pages @treysongz just arrived, looking sharp as s#it doing black on black the right way #stylebible","Big love to #IanVelardi and #RobertGeller for coming to our @GQfashion #stylebible party.","Johan Lindeberg from @blkdnm just got here.  Rounding up our #BNMDA designers at the @GQfashion #stylebible party -MS","@shipley_halmos just got here. It's a moshpit of #menswear tonight. If you're on the way bring your a-game guys -MS","@johnbartlettNY @saturdaysnyc @rag_bone @toddsnyderny @OvadiaandSons all here for the @GQfashion #stylebible party.","@mbastiannyc and Frank Muytjens from @jcrew_insider all here for the @GQfashion #stylebible party at the Jane hotel","#McNasty in the house at the @GQfashion #stylebible party. Rocking equally dirty denim and bucks - MS","Some step and repeat love at the @gqfashion #stylebible party tonight - MS http://t.co/IeXqTC4T",".@renmcknight getting a head start on spring in a polka dot J.Press belt. #dudesindots @ GQ Magazine http://t.co/i0S6Iw4m","Just minutes away from our @GQfashion #stylebible party.  We'll keep you looped in on all the #menswear goodness as it happens -MS","The Best of Tommy Ton: Never before have we seen so much crisp, colorful, and downright avant-garde footwear: http://t.co/xpHpmf8z","The GQ Spring 2012 Trend Report: what to wear, how to throw it on with style, and where to shop the trends right now: http://t.co/isjKXdvA","RT @BrianCoatsBC: Attn men of NYC and beyond...just because its warm out with more daylight does not excuse flip flops. At least get a p ...","Check out the 1 dollar watch - times have sure changed. The packaging is pretty priceless too. Ts  http://t.co/6UeeElG2","Check out this chocolate dial dress watch beauty from Zenith. Ts  http://t.co/HVk7n06y","A bit of Brit in Baselworld. Ts  http://t.co/gRsKEouJ","Victorinox's \"new infantry\" watch. Vintage inspiration and veg tanned leather strap make for a very victorio http://t.co/T0nOQYrO","RT @SHotchkissNYC: Talking a very fresh-feeling fall 2012 with @aaronplevine of @clubmonaco - http://t.co/2ASBGMfP","Finalists on American Idol will have a new style coach come March 15th: Tommy Hilfiger. http://t.co/C3yNhdva @TommyHilfiger","Navajo prints are making a slow but steady wave right now, and Ashton Kutcher is catching it early: http://t.co/nwxw5SUV @aplusk","RT @SHotchkissNYC: My favorite daily vintage photo fix @impossiblecool interviews NYC photog Brian Hamill about the '60s, the Stones, et ...","Joseph Abboud's New American Men campaign shows men who are passionately carving out their paths and doing it in style: http://t.co/PiwTOHoL","Your Morning Shot: The Specials. \"I think we were beautifully naive...\" http://t.co/UlNrw4DW","New Rolex oyster perpetual date just II. Nice. Ts  http://t.co/6OZKiCkw","Gotta love a matte red Ferrari. Ts  http://t.co/yIWQLAck","RT @BrianCoatsBC: Careful not to sit on these glasses....Coming Soon: Tom Ford Special Edition Eyewear http://t.co/OjA7TB8L via @GQ","Week in Style: Hunger Games swagger battle, the most punk rock kid in Hollywood, and reason #3,452 Brad Pitt is a BAMF: http://t.co/j6yUKKFy","Oris's new \"cool gray\" watch starts the day off right. Ts  http://t.co/i2EiQ7E5","The Swiss are super sweet people and they are always offering the creamiest chocolate treats. Swiss delights http://t.co/F9SazKgC","Last chance to win Tommy Ton & @ClubMonaco limited-edition bag, or a trip to @JakandJilBlog’s favorite city. To enter: http://t.co/drxC0xU8","A show stopper of the day. Patek Philippe's new Calatrava - stunning! Ts  http://t.co/pVt84kPh","Video: Best New Menswear Designers in America: Johan Lindeberg, the brains (and beard) behind BLK DNM: http://t.co/NIr2OmpC @BLKDNM","What people aren't talking about is Austin's fresher-than-ever style wave. Here's where to shop in your @SXSW downtime: http://t.co/hMNo7APs","Celebrity Style Evolution: A look at the leather-centric ensembles of standup legend Eddie Murphy over the decades: http://t.co/ljwqveSU","RT @BrianCoatsBC: Funny charticle- guess i'm a \"GQ type\" Bracelets Through the Ages http://t.co/WO2JRXBD  CC: @miansai","Seiko's \"astron\" - world's first ever solar gps watch. Ts http://t.co/zqHFkTjl","Check out these new Bell & Ross beauties \"the Argentium\" - gorgeous in gray. Ts  http://t.co/77i8e2xp","Kicking the day off at Baselworld 2012 in the \"hall of dreams\" - this crowd is no joke.  http://t.co/YGUhtrFv","Before she walked the runway for Kanye, Joan Smalls was on our Lust List. Take another look at the steamy photos http://t.co/Phkag8ou","30 Most Stylish Men Under 30: Michael B. Jordan pulls off casual style like few others http://t.co/VQeYrtHu @michaelb4jordan","30 Most Stylish Men Under 30: You can always count on @DonaldGlover for a one-two punch of sporty prep http://t.co/38aQ6tzI","Marni @hm after an onslaught of fashion editors.  Our prayers are with the h&m staffers on restocking tonigh http://t.co/XnL0388s","Off to check out Marni @hm collection and will report back on the launch, with pics #consuelocollabo - MS","We're about to ruffle some twi-feathers. Find out which @Twilight guys made our 30 Most Stylish Men Under 30 list http://t.co/lfzKPbkH","RT @SHotchkissNYC: @SperryTopSider has a brand spanking new boutique on lower 5th Ave in Manhattan: http://t.co/8xjCtDDL - \"get ya boat  ...","Dear @JonahHill, we like you (and your style) just the way you are http://t.co/qy7YglWI","We spotted Prince Harry looking crispy in Jamaica: http://t.co/I2IPd2QH - that lad knows how to take Westminster Abbey to the West Indies","Step aside, @GavinRossdale. Your boy Kingston has arrived http://t.co/CHAPFvRE","In 2005 GQ followed Hedi Slimane when he was riding high at Dior Homme. Revisit our profile on YSL's new leading man: http://t.co/zGKSNXTY","RT @paul_icon: Thanks @gqmagazine! Keeping it sassy. RT 30 Under 30: These are the best-dressed young men on the planet: http://t.co/sbD ...","Find out @WarbyParker creators @NeilBlumenthal and Dave Gilboa's favorite frames from their line http://t.co/sXoUpeBc",".@JohnCarter star Taylor Kitsch channeled James Dean in our new fashion shoot http://t.co/B9zF4icC Think he pulled it off?","@hm and Marni's much anticipated collab hits stores tomorrow, and we're giving you the first look: http://t.co/DuAVoNku - #MarniatHM","RT @SHotchkissNYC: I talked to Neil and Dave from @WarbyParker about the 10 things they keep in their sights at all times: http://t.co/c ...","RT @BrianCoatsBC: Really love my new @Mosley_tribes and @miansai glasses collab. Pop the collar on your polo and go. http://t.co/5Dq4h9Ma",".@azizansari's style is no joke. That's why we put him on our list of the 30 Most Stylish Men Under 30 http://t.co/o37dPqlY","Sorry @JonasBrothers, only 2 of you made our list of the 30 Most Stylish Men Under 30 http://t.co/cJ4SFxFA @nickjonas @joejonas @kevinjonas","@DarrenCriss may be the Most Stylish Man Under 30 but we still got love for the original Glee style star @chriscolfer http://t.co/4FI9gP09","At JFK - Examples of watches for sale I would NOT recommend. Ts http://t.co/9c39xcmq","At JFK airport - Just as it says \"time to fly\" headed off to Basel, Switzerland to see all the new watches f http://t.co/Sh5abMKA","ATTN: Beliebers, find out where @justinbieber ranks on our list of the 30 Most Stylish Men Under 30 here http://t.co/5LWMxeut","Only one #HungerGames guy made our list of the 30 Most Stylish Men Under 30 http://t.co/YYabScBB #teampeeta #teamgale","Obsession of the day, you ask? This half softshell, half hoodie, all suh-weet technical jacket from @Outlier - http://t.co/CECZmfOA",".@BrunoMars is a master of throwback style. That's why he kicks off our countdown of the 30 most stylish men under 30 http://t.co/ihuNOi9g","RT @SHotchkissNYC: @WSJ is live blogging Yeezy's runway show from Paris: http://t.co/47HcmdOe - DONDA forever","RT @SHotchkissNYC: Hedi's home!: http://t.co/stOFdVmr - Slimane to return to creative director post at YSL, replacing Stefano Pilati","RT @richardblandino: Meet @michellevawer my \"Go-See of the Week\" on http://t.co/zqMPEFFl #models\nhttp://t.co/yeoho1fS",".@DarrenCriss tops our list of the 30 Most Stylish Men Under 30 http://t.co/ecGgGSEW Discuss.","Where did the #GossipGirl guys land in our list of the 30 Most Stylish Men Under 30? Find out here http://t.co/ecGgGSEW @gossipgirl","Want to get into the hat game? Take a cue from these street style pros shot by @JakandJilBlog http://t.co/YN29uGMe","The 30 Most Stylish Men Under 30: http://t.co/ecGgGSEW Could one of these youngsters be the next Gosling?","RT @SHotchkissNYC: The most beautiful woman you'll see in an American flag tank top today: http://t.co/2NEKj0RN - SI Swimsuit starlet Mi ...","RT @BrianCoatsBC: Run, don't walk to @JCrew_Insider new mens Ludlow store in NYC. It's stunning and very GQ. http://t.co/37S65GDt","RT @MichaelHainey: I love this on the Maybach: because they ripped out the doors, they jacked the seat-controls onto the dash #badass ht ...","Our editors spotted these new @BALLY_SWISS two-tone brogues: http://t.co/KHVfwrZJ - for old school cool styling with updated functionality","Your daily shot is of Vincent Cassel, a Frenchman who is infinitely cooler than any of us: http://t.co/iNtzhbnr","RT @SHotchkissNYC: Now D. Wade and LeBron are just messing with us right? http://t.co/GH7PXAHM","RT @SHotchkissNYC: @Levis Trucker jackets... so hot right now. Our man Mr. @woodensleepers shows us why you should get a vintage one: ht ...","Stylish sunglasses under $100: @WarbyParker @SUNPOCKET @ExpressLife @BananaRepublic @SEEEYEWEAR @williamrast http://t.co/nET6HUtq","RT @SHotchkissNYC: Need some top-notch stationery with a sense of humor? See Ted at @TerrapinPrints immediately. We chatted last week: h ...","The problem: Prone to sitting on/crushing your sunglasses. Solution: These 6 stylish shades, each under $100 http://t.co/nET6HUtq","RT @BrianCoatsBC: I really really need to do a shoe edit. Who wants to help? http://t.co/5ERZ0SMd","Now that guys can get a great suit anywhere, it's become about pairing the jacket and pants  for everyday versatility: http://t.co/RrWOWKtA","RT @BrianCoatsBC: Oh for gods sake the gift guide pitches are starting already.","You've salivated to those shots of McQueen and Newman long enough. Meet your new shades: http://t.co/sp2qBflV @WarbyParker","Editor's pick: Phineas Cole double-color tie. It's two ties for the price of one! http://t.co/MTkZwmF0","This just in: Coal Haan's LunarGrand in leather hits SoHo tomorrow. http://t.co/13LE4lGw","Your Evening Shot: Wes Anderson. http://t.co/LDkCEo6i","RT @SHotchkissNYC: These @warbyparker Griffins have to be the best shades on earth under a Benjamin: http://t.co/O8QZyJQh","Finally, you can lounge on the couch in sweats without killing your girl's libido—and even wear them (gulp) in public: http://t.co/s0Bin1AO","The Week in Style: Skarsgård played it safe, Johnny Depp tested the limits, and Bryan Cranston did a self-promo: http://t.co/3pHSTK8W","@gantrugger FW'12 lineup include this awesome camel coat.  Must have for fall. -MS http://t.co/RSCRJN2o","@gantrugger FW'12 preview is pretty great, including this polka dot scarf -MS http://t.co/8TeJ1myg","This just in: Prada's Walking in Milano shoe collection: http://t.co/RRhMsxvg","J.Crew's quest to dress men for every occasion continues with the opening the their new Ludlow Shop: http://t.co/v20semrY @JCrew_Insider","We teamed up with @JakeDavisFilms for an exclusive, six-part video series. Who better to start us off than @mmcnairy? http://t.co/Ax9LVY4J","RT @SHotchkissNYC: We asked @JakeDavisFilms to capture our Best New Menswear Designers via his \"Test Shots\" series, first up? @mmcnairy  ...","Check out Tommy Ton’s project with Club Monaco. You could win a limited-edition bag or a trip to his favorite city: http://t.co/QwPYC93f","Exclusive first look: Nike x Undercover Gyakusou Spring 2012 behind-the-scenes video. http://t.co/IhveE5Lr","Margherita Missoni knows what she wants. She can help you understand what your girlfriend wants, too: http://t.co/FKFfkFaR @mmmargherita","Your Morning Shot: Paul Weller. \"It's Thursday evening in Toronto... but for us, it's Friday night.\" http://t.co/FVvjKpXP","Worst-Dressed Men of the Month: @rustyrockets exposes his areola, @iamwill sees red, and Steven Tyler redefines unisex: http://t.co/O8cY5UkT","We got the exclusive first look at @JCrew_Insider 's first stand alone suit store, the Ludlow Shop in Tribeca: http://t.co/v20semrY","RT @BrianCoatsBC: Saw this on my way home- John looks cool and Elle is Elle, Jessica looks like someone took her man. http://t.co/w0IiN0DS","Turnbull & Asser shows us where buttons come from - MS http://t.co/vtogNAB9","Tie, shirt, square perfection from Turnbull & Asser - MS http://t.co/DGGI11Li","Who better to close out our month-long salute to African-American style icons than this guy http://t.co/SiI86hyP #BlackHistoryMonth","RT @sean_fennessey @durgapolashi on a real American hero: Lil' Penny. http://t.co/s7shSLNf","Here's your exclusive sneak peek at Mr. Brown by Duckie Brown for Rothmans NY http://t.co/XHbTRFFE","We feel for you RT @willwelch My black alligator belt is going in for repairs. I shed a blog tear to mark the occasion: http://t.co/34Jgj7w3","One of the sharpest summer totes we've seen in a while from Caputo & Co.: http://t.co/J4RIBn7Y - and it supports local workers in Guatemala","Time for a style upgrade? Basil Hayden’s wants to give you $500 to make it happen. Enter for a chance to win: http://t.co/bn1oztD4","RT @SHotchkissNYC: Spotted: Lil Wayne (@LilTunechi) partying at All-Star weekend in @GQfashion BNMDA @mmcnairy smiley face shorts: http: ...","How many GQ editors can you spot in this cool #nyfw video by @liamgaws? http://t.co/tKye33Gj","From Milan to New York, the best street style photos from the Fall 2012 season http://t.co/Ft1ur0Cw (Nice work, @JakandJilBlog)","The second round of @BananaRepublic's Mad Men collection hits stores tomorrow. Here's a preview of what you'll find http://t.co/9zvxtEzF","GQ's Best New Menswear Designer Todd Snyder on the 10 things he can't live without http://t.co/sCte6YEC @ToddSnyderNY","RT @BrianCoatsBC: Post shoot haircut and a beard trim in a glamorous location van- I almost kept the 'stache... http://t.co/JZy6cDU8","We found 3 affordable sports jackets that'll make you look like you own the bank without breaking it http://t.co/DjwdXzFx","Yes, a double-breasted jacket can be worn unbuttoned. Just remember this tip http://t.co/nJNFN5hP","Not all suit jackets are created equal. These are the only ones you can get away with wearing solo http://t.co/ylg1pWcB","Case closed: This is the difference between a blazer and a sports jacket http://t.co/V0WFzvcG","RT @SHotchkissNYC: @mattyseebs weighs in on all those bad breaks: http://t.co/567ksQGS - CLEAN IT UP Hollywood!","A sports jacket isn't a suit, so don't treat it like one. This is the right way to style it http://t.co/h36SS0xZ","RT @SHotchkissNYC: LA interior design guru @TripHaenisch hits us with his latest installment on where to score great finds for your home ...","Simply put, this is the most important item in any man's wardrobe. Allow @TreySongz to show you how it's done: http://t.co/3n9o4lLA","RT @BrianCoatsBC: I wonder if this guy is a Yankees fan? I kind of want this hooodie. http://t.co/SzQIP8Yq","RT @SHotchkissNYC: Dearest male celebrities, please, please learn the basic rules of dressing like a gentleman: http://t.co/a4I68nvu - e ...","Forget the ceremony: These are the best-dressed men at the Oscars After Parties http://t.co/d8jongfb","Want to set yourself apart from the glut of men in silver, platinum, and plain 'ol gold accessories? Go for these http://t.co/VJyG2peS","RT @SHotchkissNYC: Spending an afternoon with one of New York's most dapper dudes, Domenico \"Mimmo\" Spano: http://t.co/GGfL7tjt","In case you didn't make it through the whole ceremony, here are our picks for the Best-Dressed Men at the #Oscars http://t.co/DjMXadZW","Surprised to see so many good looking shawl collared tuxedos tonight, both wide and slim. Good call. JM","Slimmer cuts are dominating the Oscar tuxes tonight. Christian Bale's tux is razor sharp! JM","RT @GQMagazine: And the Best-Dressed Men at the Oscars Are... http://t.co/b0ojoMms","What do you guys think of Bradley Cooper's stache? The tux is perfection but the facial hair...? JM","Some of these Oscar guys need a bow tie straightener","Brad Pitt give us full-on movie star in a slim peak lapel tux. He looks iconic and modern at the same time. Kills it! JM","RT @markwby: Brad Pitt has full-circled back to his Legends of the Fall look. Which is kind of ok.","Jason Segal's tux choice makes him look sleek--note the peak lapels and low button stance, and comfortable at the same time! JM","Re Bradley Cooper's stache: I want it. -mb","Colin Firth doing the wide shawl lapels, strong bow tie and high collared shirt. Balls-out glamour by Tom Ford! JM","Weird. We haven't received a press release for which designer did the Dictator's get up...#redcarpet #oscars","Christopher Plummer wearing a midnight blue velvet tuxedo with all the swagger of a style icon at any age. JM","@jlo you still looking fly, girl. #oscars #redcarpet","Is the dictator wearing @gucci loafers? #redcarpet @gucci","Yes, I saw Puffy getting de-linted before his turn on the red carpet. I think we all need that before we head out for a big night! JM","Jean Dujardin goes total French classic in peak lapels, a wing collar shirt and slicked hair. JM","Dujardin goes for the movie star size lapels and beefs up the bow tie from his previous red carpet outings #oscars #redcarpet","Puffy's got the skinny lapeled tux nailed. He's got movie star mojo tonight! JM http://t.co/OPXbki0e","Diddy gets a spifing up and we have to wonder where's Farnsworth?   #oscars #redcarpet","Judd Apatow looking fly in his Oscar tux, but please dude, keep that jacket buttoned. JM","Pharrell pulling off the three-piece tux and winning the award for most swagger so far this evening. #redcarpet #oscars","Clooney getting everything right tonight in a Armani tux. Proportion is key here and he nailed it! JM","Demián Bichir looks like what we think the most interesting man in the world would have 30 years ago #oscars #redcarpet","Clooney: classic movie star bow tie. The buttons? We're still working those out. #redcarpet #oscars","GQ cover girl Michelle Williams hits the carpet in slighly more than she had on in our pages http://t.co/hPBKdTSl","@missjudygreer: Wow. #redcarpet #oscars","Clooney gets on the #redcarpet in what else? Giorgio Armani.  Goes for the notch lapel this time around and looks smart as always. #oscars","Nick Nolte goes for a statement making bow tie and some shades ...and it works? #oscars #redcarpet","It's always refreshing to see Rose Byrne happy and not looking like a fragile deer in Glenn Close's eyeline. #Oscars #redcarpet","Zachary Quinto trying that geek chic thang on the #Oscars #redcarpet with some serious specs. Does three make a trend? http://t.co/JK1FWmAk","RT @SHotchkissNYC: Apparently Agamemnon was the first dude to walk down the red carpet in 458 BC. His tux had Greek lapels... natch","Milla Jovovich on yet another Resident Evil movie would not give up any spoilers.  We envision guns and zombies. #Oscars","Before the nominated guys actually get on the #redcarpet for tonight's #Oscars take at GQ's picks for each: http://t.co/Rzl79oFj","George, Brad, Jean - you may want to have one last look at our red carpet tips for tonight before getting in that car: http://t.co/0qWe7Gm0","Kermit the Frog in custom @BrooksBrothers.  Even frogs can be baller.","@RyanSeacrest rocking the usual @Burberry.  This time he goes with a sleek peak lapel option and we approve.","We're live tweeting the @eonline red carpet.  Stay tuned for updates on all the best dressed guys here and on http://t.co/oQO4KMOO - MS","Loving lunch at Mile End on Hoyt Street in Brooklyn right now. Five star food and ambience. Just love it! JM http://t.co/Bg4YPWaf","RT @SHotchkissNYC: LeBron and D. Wade made a serious courtside style statement last night at the Skills Challenge - http://t.co/LDl44fon ...","But can they dunk in a suit? http://t.co/LzCRq6J2 @nba #allstar","RT @BrianCoatsBC: Wow- so its true- Jil Sander will return to her company. Welcome back and good luck- its a fashion orgasm but Raf set  ...","RT @BrianCoatsBC: Look who gets his card on @richardblandino wall all by himself. @hipenfold next to @ellemacpherson and @adrianalima ht ...","OK, f*** you, Russell Brand. Now you're just messing with us: http://t.co/AaxILrII @rustyrockets","This is objectively not how you wear a scarf, little Jonas: http://t.co/ljf9Ohyf @nickjonas","In light of tomorrow's @NBA dunk contest, here's a style playbook from the game's five highest-soaring dunkers: http://t.co/ZhW1qT8l","Freebie alert: Win a $500 style upgrade courtesy of Basil Hayden’s http://t.co/bn1oztD4","This Just In: Jil Sander in at Jil Sander: http://t.co/703XShbF","We got the first look at @redwingheritage 's Genuine Handsewn Collection for spring - made in Maine by Rancourt: http://t.co/CVJOiyHt -","Week in Style: Theroux tries to wear a tie bar, Zefron revives a classic combo, and @jaredleto cleans up his act: http://t.co/3QqSF2OB","Your Morning Shot: Gregory Hines. \"I never wanted to be a star, I just wanted to get work.\" http://t.co/oIe8o9R0","RT @BrianCoatsBC: I'm digging these two dudes waiting for a street cart smoothie in their slim selvedge and cool footwear. #NYC http://t ...","Exclusive: video of GANT's @MBastianNYC on his killer collegiate/mod-inspired Fall 2012 collection. Check it: http://t.co/7hHl3TGi","From now on--thanks to a recommendation from @BlindBarber--we're strictly spritzing our locks with this: http://t.co/QIFc40Cp","Calling all San Fran dudes--@aetherapparel's concept store on wheels just landed in you hood: http://t.co/3Z5XvMbV","Our vintage pick of the week: Lee's blanket-lined denim chore coat http://t.co/FmWuPGIB Props to @woodensleepers for discovering this beast","This pocket watch from @MARCHLAB and @coletteparis ain't your grandpappy's timepiece. It's got crazy Napoleonic swagger http://t.co/Eq6RVvgw","Kaiser Karl courtesy of Jean-Philippe Delhomme show at FIAF in NYC - MS http://t.co/veUczHU0","Delhomme's take on Thom.  Great seeing his work outside the pages of GQ too. - MS http://t.co/pULWfwLK","This is what a $39,000 watch looks like http://t.co/uLD1o4e5","Congrats to our Best New Menswear Designers @OvadiaandSons @BLKDNM @saturdaysnyc @ToddSnyderNY @mmcnairy & Ian Velardi http://t.co/tMZ8XIrZ","Pocket watches are for your grandfather and the dude at Davidoff, right? Not this one from @MARCHLAB and @coletteparis: http://t.co/Eq6RVvgw","RT @JakeDavisFilms: Congratulations to all the @GQfashion Best New Desingers in America nominees. I'm very excited for what we have plan ...","It gets our vote for merger of the year: your bucks just met your wingtips. http://t.co/zG6SxjTe","RT @BrianCoatsBC: wow Raf Simons leaving Jil Sander on Monday?? Will Jil return to her own label?","Best In Show: the ones to watch from the Salon International de la Haute Horlogerie of 2012: http://t.co/t8LbsM81","Denim & Supply Ralph Lauren Spring 2012 hitting Denim & Supply's online store and Macy's shelves at this very moment: http://t.co/8Ox93NC9","Announcing GQ's Best New Designers in America 2012. Prepare to salivate over the collection they'll be doing with @Gap: http://t.co/dS53gN8V","From the cover of GQ Style China to @JCrew_Insider, our \"Go-See of the Week\" Hao Yunxiang is crushing it: http://t.co/PFwptL0s","These gray flannel kicks from model-turned-designer Armando Cabral are our daily obsession: http://t.co/tkejcPLv - dress 'em up!","APC's Jean Touitou on his new West Village store, hip-hop, and collaborating with Kanye http://t.co/LN89x2K7 @jeantouitou","Street style blogger Mordechai Rubinstein aka @mistermort reveals the 10 things he can't live without http://t.co/TBn5Pexu","RT @BrianCoatsBC: some advice for new designers-if you are looking for attn sending an angry letter w crazy serial killer handwriting is ...","RT @kellyoxford: Just checking, did all of you guys read that sex article I wrote for GQ last year?\nhttp://t.co/ZU0Wnnxb","Here's your first look at the Norse Projects Spring 2012 lookbook http://t.co/KyzZ84Bz @norseprojects","Here's your first look at the Fuck Yeah Menswear book http://t.co/AqKJ04EF","RT @BrianCoatsBC: After a great weekend off including an actual holiday I think i have perfected the art of wearing sweatpants. #notashamed","A new batch of street style, featuring a guest cameo by none other than Theophilus London http://t.co/pscMSWVq @TheophilusL","RT @BrianCoatsBC: Check out our preview- we snuck out of #NYFW to do this-Magic Trade Show Las Vegas Shopping Guide- GQ http://t.co/rf1a ...","Kellan Lutz is pulling off the nautical thing. Kudos on ditching the golden locks, dude: http://t.co/sDlozOAW @kellanlutz","This lid from @ baldwindenim serves double duty in terms of representation for me... -SH http://t.co/t8q7exeH","RT @SHotchkissNYC: All the latest from our man @JakandJilBlog outside the shows at NYFW: http://t.co/m2oHHuoz","Jared Leto is Black-Swan-ing into a squirrel in this photo. This is only slightly confusing: http://t.co/2NUxFrWk @jaredleto","RT @SHotchkissNYC: Don't be tardy for Velardi. If you haven't seen it, check the fall lookbook: http://t.co/OBIXxbpk","Hey, Russell Brand: Your necklace is too long if you can tuck it under your balls. http://t.co/tvh3uRQK @rustyrockets","Our new Cain and Abel-esque feature: Fashion Fratricide. This week, @nickjonas slayed his brethren with a slim-cut tux: http://t.co/dD84Xr30","RT @BrianCoatsBC: Who doesn't love fur and bikinis on the same out rack? #returns http://t.co/2vRQl3JK","10 Fascinating Follicular Choices from Fashion Week: http://t.co/1VRGCDIk #NYFW","Week in Style: Jon Hamm keeps it classy, plus the mighty return of our 2011 Worst-Dressed Man in the World, @jaredleto: http://t.co/FgbP0Tak","RT @BrianCoatsBC: “@MJFIII: @BrianCoatsBC we just launched twitter- @ThomBrowneNY please spread the word  X” major- welcome to twitter!","In the rotation: the Rialto shades, from Garrett Leight, the son of the founder of @oliver_peoples: http://t.co/cwEPGeeS","Exclusive first look: Suitsupply celebrates the Olympic year in their 2012 spring/summer campaign: http://t.co/2ofO3nBl","There's some fresh new knits coming from the East Village you'll want to know about: http://t.co/wnIwe28i @mattheworley @orley","The new Cole Haan LunarGrand wingtip just launched and features some eye-catching contrast soles: http://t.co/YyqiXlHP @ColeHaanInsider","We talked w/ Michael Bastian before his #NYFW show. We also managed to snag his college ID card—blackmail. http://t.co/haCtsoJQ @mbastiannyc","Evening shot: James Brown. \"Hair is the first thing. And teeth the second. A man got those two things he's got it all.\" http://t.co/TYgPTvhh","Scenes from #NYFW: the ladies of Gant by Michael Bastian were distracting us from all the dapper duds: http://t.co/1c0DGceo","MOD TV put together a video that gives you a behind-the-scenes look at what makes Tommy Ton tick: http://t.co/bdPczWvS @JakandJilBlog @MODTV","This just in: Levi's Made & Crafted pop up at Smith + Butler in Brooklyn: http://t.co/CWeD5AVy @LEVIS @smithbutlerbk","If you needed proof that the backpack is still the men's bag of the moment look no further than the runways of #NYFW: http://t.co/nm4nDMuA","Bernardo Rojo sat down with GQ moments before Joseph Abboud mounted its first runway show in seven years: http://t.co/IHIeVLNi @JAApparel","Lugging your daily haul has never looked better as designers brought their bag game for fall: http://t.co/yJei73Rb @rag_bone @TommyHilfiger","RT @GQMagazine We spy the @gqfashion team in the latest batch of New York street style by @JakandJilBlog http://t.co/OCEY2r2y","Thanks for a great season of 5x7 @backyardbill @shipley_halmos @bastiangirl @jaredflint @nickelcobalt! http://t.co/4F65pG9U #nyfw","This just in: the Jeremy Scott Fall 2012 men's collection from #nyfw http://t.co/ofGDtwNm","RT @richardblandino: Emil in Gant presentation #nyfashionweek #model  http://t.co/mhGatoap","RT @richardblandino: Anderson / VNY working the piano scarf at Gant  http://t.co/GPxxsFha","RT @richardblandino: Love this #model Onnys @NewYorkModels1 at Gant #nyfashionweek  http://t.co/eMNz44tJ","The cool kids in school at Gant by Michael Bastian.  Love the combo of the green parka with burgundy blazer. http://t.co/ymjD6vdM","Mod meets prep at Gant by Michael Bastian.  Great stuff.  #nyfw - MS http://t.co/RIXFJ9mf","The waiters' t-shirts at Gaby by Michael Bastian #nyfw -MS http://t.co/cXFXmJAT","This just in: the Michael Kors Fall 2012 men's collection from #nyfw http://t.co/bgdBpfD0 @michaelkors","So is she... Which is rad.  http://t.co/GhdGL2dK","This dude is getting kitted out for his day live on the @levis runway - SH #nyfw  http://t.co/j9SinM0j","RT @BrianCoatsBC: Wow- best vday dinner with a coworker... @Lantzzer amazing! Amazing @mariobatali http://t.co/2Iistoxp","Hello @levis x @nike collab - SH #511skateboarding http://t.co/l7vB3daT","Frozen jeans @levis -SH #nyfw  http://t.co/sr9sz3h7","@levis are some cold dudes - SH #nyfw  http://t.co/AgNbQuZx","We've assembled all our reviews from New York Fashion Week in one handy guide. Consider this your cheat sheet to #nyfw http://t.co/df2vblDl","man, never seen so many girls on Blueprint in one room as the #JeremyScott crowd. -AR","Terry Richardson lights up Joe Jonas at Jeremy Scott - SH #nyfw  http://t.co/Tnobkdfv","http://t.co/zy5x4ipf - VIDEO: The full Michael Kors fall 2012 collection from New York. @michaelkors #nyfw","We got A$AP Rocky to critique the latest from Rick Owens, Raf Simons, etc. His conclusion? \"Dope as fuck.\" http://t.co/BMfD3RhC @ASAPMOB","RT @MichaelHainey: The @MichaelKors show in all its leggy, tanned, sexy splendor. #nyfw  http://t.co/mRWqCVRJ","RT @MichaelHainey: A Marc Jacobs coat to consider. #marcjacobs http://t.co/tIrYv7eC","RT @MichaelHainey: Marc By Marc Jacobs in 61 seconds. @MarcJacobsIntl #nyfw #marcjacobs  http://t.co/Xm7MG2dv","Hangin' with Pharrell at the GQ party in Vegas. He told me he dyed his hair green in honor of his new Mc Nairy line. JM http://t.co/Mro0Tm7N","Valentines Day / Trade Show mania w/ @BrianCoatsBC. The best. @GQfashion  #fb","You heard it here first...the tailored menswear stars of tommorow - Mattison. @projectshow - LL http://t.co/g1Y5vtDk","Just in: Every look from the Marc by Marc Jacobs Fall 2012 Collection http://t.co/So0JitqL","Jeremy Lin might not sweat in the clutch, but he's still deathly afraid of needles: http://t.co/WLdOtAQq @JLin7 #linsanity","Agreed. RT @GQMagazine Yes, these photos of Jennifer Aniston's new GQ shoot are worth another look http://t.co/K7JrcOPs","You heard it here first...the tailored menswear stars of tommorow - Mattison. @projectshow - LL http://t.co/SPzShEQV","You heard it here first...the tailored menswear stars of tommorow - Mattison. @projectshow - LL http://t.co/qhxVccy7","This just in: the Moncler Grenoble Fall 2012 men's collection from #nyfw http://t.co/BFlGeYoo @monclerofficial","This just in: the Siki Im Fall 2012 men's collection from #nyfw http://t.co/ljrcKr68","What did @shipley_halmos @bastiangirl @jaredflint and @nickelcobalt wear on day 6 of #nyfw? @backyardbill's on it http://t.co/4F65pG9U","This just in: the J.Crew Fall 2012 men's collection from #nyfw http://t.co/HToLTtX4 @jcrew_insider","Check out the stylish scene outside the shows in the latest dispatch of street style from @JakandJilBlog http://t.co/HASTNYuk #nyfw","Pharrell rocked a look from his new collab with Mark Mc Nairy at the GQ party in Vegas last night! Check out their collection on GQ.com. JM","@mattyseebs and @ejsamson swear they didn't plan this. #gqproblems  @ GQ Magazine http://t.co/HrbBz0ox","RT @GQMagazine VIDEO: Paul Rudd takes a beating from Jennifer Aniston on the set of their GQ shoot http://t.co/S4JRjCzt","Remember that tie shot? We've rounded up the best of Jennifer Aniston in GQ right here http://t.co/6rrPo8Jd","See Jennifer Aniston dominate Paul Rudd in their steamy shoot for GQ by Terry Richardson http://t.co/K7JrcOPs @terry_world","It's nowhere near NYFW, but pause cafe on the LES is the jam! Always cool friendly people. - SH http://t.co/Xg0u9MNw","Take a #nyfw break to check out Jennifer Aniston and Paul Rudd on the cover of our March issue http://t.co/K7JrcOPs","@brooksbrothers shetland wool sweaters in a great dusty palette #nyfw -MS http://t.co/hHZpk9xl","@brooksbrothers does modern Downton dapper.  Stellar shawl collar tux jacket and jeans #nyfw -MS http://t.co/EZdCHUML","@brooksbrothers Black Fleece pony hair hi-tops. #gameover #nyfw -MS http://t.co/uZgxczxk","RT @BrianCoatsBC: If you're at Project Vegas check out @NickWooster space. It's incredible. Love the custom Camo sofas too! http://t.co/ ...","This dude is very JCrew outside @jcrew - SH  http://t.co/3PFdPOqa","Purple is big accent color for J.Crew Fall 2012. #nyfw -MS http://t.co/zeoN1JIy","Great alternating cable knit cardigan from @jcrew #nyfw - MS http://t.co/Oj59bf19","So many amazing pieces for guys at the J.Crew show.  Love this chambray and suit look with patterned tie. -  http://t.co/9YA6m6ku","The Style Guy is answering your pressing sartorial questions. Get his latest dispatch here http://t.co/cUzTM7I2 @lordrochester","Every look from Michael Bastian's latest collection: http://t.co/cEXC5Kv6","RT @GQMagazine: Congrats @KateUpton on your SI Swimsuit cover. We'd like to think this shoot paved the way http://t.co/C6x41vyc","Jared Followill proves that a well-tailored suit is appropriate for any occasion, including the Grammys http://t.co/yQAcnV7Q @youngfollowill","Dierks Bentley made fans out of us at the Grammys last night with this look http://t.co/X5WQgYJQ #bestdressed @DierksBentley","Day two at @capsuleshow in Vegas. Check out the size of this space-a gazillion racks of inspiring duds. JM http://t.co/InxFnrHo",".@common wins our award for Best Dressed at the Grammys http://t.co/QBkLtm2P","Wiz Khalifa proving that untucked can be elegant in its own right. Best-Dressed at the Grammys http://t.co/bNPD2Kw3 @RealWizKhalifa","http://t.co/nhDmGw0l - VIDEO: The Michael Bastian fall 2012 collection, direct from #nyfw @mbastiannyc","RT @MichaelHainey: @mbastiannyc #diggingthisheadtotoe Awese show #nyfw http://t.co/DYmLs1qK","RT @MichaelHainey: Opening of @thombrowneny @thombrownenyc http://t.co/hmCPoFTK","Now THAT's a business card. @williamyan - SH - entrepreneurs take note http://t.co/aD8g7QXE","Our editors' favorite looks from @bandofoutsiders @TommyHilfiger @billy_reid @nautica @lacoste @dkny @rag_bone and more http://t.co/Hb3s9lEd","Final touches #nyfw SH http://t.co/RyHyGi3I","Arthur K amid backstage Bastian chaos. -SH http://t.co/zL5pUjmT",".@mrbradgoreski makes a cameo in the latest batch of street style shots by @JakandJilBlog's Tommy Ton http://t.co/PHDlHyyr #nyfw","Audemars Piguet watches from the @mbastiannyc show -SH #nyfw  http://t.co/tuE6o0fh","The man himself preps for his fall/winter show @mbastiannyc - game on #nyfw SH http://t.co/jIM2KzPy","Sweet bike, @bastiangirl http://t.co/sHJsSORE (and great shot, @backyardbill)","Exclusive: Behind the scenes with Michael Bastian http://t.co/NWU7nnEP @mbastiannyc","If the #nyfw runways are any indication, cargo pants are back and not going anywhere any time soon. Who's with us? http://t.co/EtnDDupm","This just in: the Timo Weiland Fall 2012 men's collection from #nyfw http://t.co/nJWM9v6J @TimoWeiland","This just in: the Simon Spurr Fall 2012 men's collection from #nyfw http://t.co/1ZdBD8he @SimonSpurrHQ","FYI: first time @ParkandBond shoppers get more when they shop with any @AmericanExpress card. Go to http://t.co/jzfkoLbg","RT @BrianCoatsBC: Love getting in the cab to Robert Geller's show and the taxi driver asks-\"you ready for the fashion?\" yessir. I think  ...","This just in: The full Y-3 Fall 2012 collection, direct from New York http://t.co/8ugTA1GM #nyfw @adidasY3","Taking a break from Fashion Week to bring you the Best-Dressed Men at the Grammys http://t.co/BAUGUXZO","http://t.co/1tyHZQuh - Video: The Moncler fall 2012 presentation from #nyfw @monclerofficial","http://t.co/NVz1A4px - VIDEO: The full Simon Spurr fall 2012 collection, direct from #nyfw @simonspurrhq","Exclusive look at the Naked and Famous jean that fades to red. Before and after. @capsuleshow - LL http://t.co/TZwuC6jO","You could pack your life up with this one bag from VSTR @capsuleshow - LL http://t.co/HrkJ8otD","Relwen will have us rockin' neon plaids this fall @capsuleshow - LL http://t.co/oS6OJbmE","Timberland brings some color to the scene for FW12 @capsuleshow - LL http://t.co/ZEnvcrh0","Overhead in the lobby of a hotel in LV - \"Karan from Donna Karan called.\" #fashionquotes - LL","Taking the tarp up at Timo Weiland.  Last show of the night then bed (or Grammy watching on FF) - MS #nyfw  http://t.co/PVWJMLYw","We need this in the fashion closet. Pile of washed bandanas. @capsuleshow - LL http://t.co/MncwF5qX","Dopp kit remixed from Topo. @capsuleshow - LL http://t.co/7M1sD5LN","The Wandering Eye: Gordon von Steiner shoots the most stunning and stylish women at the #NYFW shows: http://t.co/j7jbrpw3","Tweed puffer with a flash of royal purple. McNairy x BBC @capsuleshow http://t.co/FxMPOlk9","As much as I hate missing some of NY fashion week, the Capsule trade show in Vegas is killing it! So inspiring. Sending pics soon. JM","Strong finish at SPURR -SH #nyfw  http://t.co/NTXP4kFa","Typically razor sharp tailored sportswear from Simon Spurr - SH #nyfw  http://t.co/na2FbEuy","McNasty is killing it @capsule - LL http://t.co/Xv2zGTgt","This just in: the Patrik Ervell Fall 2012 men's collection from #nyfw http://t.co/ky6PkB31","king krule blasting at spurr. @sean_fennessey where is your summer night on a dock munching cool ranch doritos when u need it?-AR","5x7: During #NYFW, Jeff Halmos sits in \"a pile of garbage\" wearing \"really sweet 2012 glasses.\" http://t.co/RmSgx30s @shipley_halmos","Bad ass lineup at the always exciting Y-3  http://t.co/UOCuY520","Killer shearling bomber at Y-3 - MS #nyfw  http://t.co/eKnR7ggr","Trending: The cargo, in a slim silhouette miles away from the baggy bro styles you might expect: http://t.co/i2nsnsnS @dkny @TommyHilfiger","McNasty is killing it @capsule - LL http://t.co/DQ4Coupz","McNasty is killing it @capsule - LL http://t.co/NSLgIM4K","Rugs on rugs on rugs at Y-3 -MS #nyfw  http://t.co/t8zTuqnj","Supreme pin from several years back offers some helpful advice. -SH #nyfw  http://t.co/fkyg5RB0","Follow on @GQMagazine: RT Hello world! This is @atrak and I'll be your guide to the #Grammys today. I will be your portal to Bieber's hair.","Public School bringing back their big gun: the best fitting leather jacket.  Get in line guys. - MS #nyfw http://t.co/5KUTP80o","The guys from Public School are back and killing it.  Tailoring hits the ska streets.  Great stuff. - MS #ny http://t.co/O9xS4EB5","Epperson Mountaineering is dropping a suede book bag for FW12. Simple..yet so fresh. @capsuleshow - LL http://t.co/M4QoysDu","Autumn colored suiting at Carlos Campos.  Lots of leaf changing colors in the collection #nyfw  -MS http://t.co/pzzDxGQ3","@marlongobel brings the luxe with this croco bomber at #nyfw - MS http://t.co/ylm0cTnl","Sparkle prom Ken & Barbie from @marlongobel for #nyfw  - MS http://t.co/Ui4QY1Hz","This just in: the Robert Geller Fall 2012 men's collection from #nyfw http://t.co/E5WoL7A1","Striking navy and white at @marlongobel - Walkover kicks -SH #nyfw  http://t.co/kNxviQyM","Great show space for Marlon Gobel at #nyfw - MS http://t.co/7nHVVmE7","David Hart the man behind the coolest ties of the moment here looking sharp and sophisticated, Sunday at the http://t.co/dtQTvwDF","See the most badass apron ever by @gantrugger on @steliosphili. Yes, aprons can be badass. Photo by @shotchkissnyc http://t.co/pbwUAb4k","More AA men.  Relaxed knots and sharp tailoring side by side.  - MS #nyfw  http://t.co/q1TjbPeH","Antonio Azzuolo awesome inside out stitch detail blazer at #nyfw - MS http://t.co/Ut4Ft8TO","RT @MichaelHainey: And then there's badboy @BrianCoatsBC getting dirty on the, uh, runway after the Robert Geller show. #nyfw #sickshoes ...","RT @MichaelHainey: Robert Geller show in 31 seconds. @LaForce_Stevens #nyfw  http://t.co/eTH3Haai","The absurdly crowded Purple Mag party at Boom boom room. Alex Skarsgaard, representing.  http://t.co/wjUUuWFM #nyfw -mb & ar","colonial gay wedding photo found at the meatball shop -AR #bandofoutsiders #nyfw http://t.co/3cdNfaCV","just witnessed a real life male model tickle party at the #bandofoutsiders party -AR #wateristheessenceofmoisture","cookie-monster scott sternberg has killer snickerdoodle and mint ice cream sandwiches at his party. nomnomnom -AR http://t.co/kkBrtf5Z","See every look from the Band of Outsiders Fall 2012 Collection http://t.co/TD0bv1Zd  @bandofoutsiders","First look out at Siki I'm.  #Clement in black mixed media layers. #nyfw -MS http://t.co/tImHqbYm","@therichdale working hard to keep the world informed, at Band of Outsiders party  http://t.co/ErcvFpfL #nyfw #instagramishard MB","amazing grub from meatball shop to celebrate yet another awesome band show -AR #bandofoutsiders http://t.co/EPGs6jjG","Just posted a photo http://t.co/8KZf1zwA","Siki Im is taking place in a high school gymnasium.  Well they got my attention. #nyfw - MS  http://t.co/UVsnFBH8","Pioneer French schoolboy cool at Robert Geller - MS http://t.co/Ss9Jl0aK","This just in: the Loden Dager Fall 2012 men's collection, straight from #nyfw http://t.co/vK14yJK4  @lodendager","This just in: the Shipley & Halmos Fall 2012 men's collection, straight from #nyfw http://t.co/nClCTOaY  @shipley_halmos","This just in: the General Idea Fall 2012 men's collection, straight from #nyfw http://t.co/9EUh3xM9","Of the @rag_bone show, GQ's Jim Moore says, \"Anything tweed in this collection gets my vote.\" See other editors' picks: http://t.co/M4rthiKd","RT @SHotchkissNYC: Photo: Michael at Billy Reid. http://t.co/R9pwEfOd","Shooting the photographers: @Guerreisms @streetfsn @MISTERMORT http://t.co/zX0elzO6","This just in: the Lacoste Fall 2012 men's collection, straight from #nyfw http://t.co/s8HdT5AY @lacoste","5x7: a #NYFW photo journal with wardrobe wizards @shipley_halmos @bastiangirl @TobSor @jaredflint and @nickelcobalt: http://t.co/RmSgx30s","GQ Editors' Picks: See what's catching the eyes of the fashion team in New York from the Fall 2012 #NYFW collections: http://t.co/M4rthiKd","Gordon von Steiner shoots the most stunning and stylish women at the #NYFW shows (tough assignment, we know): http://t.co/j7jbrpw3","More cool trainers at Loden Dager #nyfw  http://t.co/9NjT3Jx0","Paul Marlow from Loden Dager takes a bow. #nyfw  http://t.co/8s7xxJgt","Loden Dager's suit game -SH #nyfw  http://t.co/W7kQRTKQ","Milling about waiting for @lodendager -SH #nyfw  http://t.co/zz1FX8fu","http://t.co/tODwZwUs - VIDEO: the full Alexandre Plokhov fall 2012 collection, direct from #nyfw","This just in: the Alexandre Plokhov Fall 2012 men's collection from #nyfw http://t.co/JNd9Ct7t","http://t.co/VXSGy3xB - VIDEO: The full Lacoste fall 2012 collection, direct from #nyfw @lacoste","RT @BrianCoatsBC: Very very excited to see @prabalgurung show today. Can't wait!","The latest roundup of the best men's style seen on the street at NYFW, courtesy of @JakandJilBlog : http://t.co/zF8VKuv4","This just in: the Billy Reid Fall 2012 men's collection straight from #nyfw http://t.co/B5qVAxGv @billy_reid","More @lacoste action -finale - SH #nyfw  http://t.co/0BUX6kOG","Winter Wonderland at @lacoste -SH #nyfw  http://t.co/8ibgbQ3R","RT @BrianCoatsBC: Fun day 1..Dear Diary NYFW Edition with Brian Coats http://t.co/PN5NIhoC via @GQ","Love the Life Aquatic orange stocking caps at John Bartlett. JM http://t.co/AygM7AjF","Just in: Every look from N.Hoolywood's Fall 2012 Collection @N_HOOLYWOOD_JP #nyfw http://t.co/tFpKx7jj","This just in: the Tommy Hilfiger Fall 2012 men's collection from #nyfw http://t.co/ikbWPu5f @tommyhilfiger","RT @MichaelHainey: Team GQ with  @teamvic Go @giants ! http://t.co/rLTMzXLr","RT @MichaelHainey: See the entire @tommyhilfiger men's show in 32 seconds #nyfw  http://t.co/OgJePmAj","http://t.co/hQCQiY9e - VIDEO: The full Billy Reid fall 2012 collection, direct from #nyfw @billy_reid","RT @BrianCoatsBC: @julieklausner Julie please tell me how he gets a parking spot in from of the met. Oh, cause you're driving a firebird.","My new backpack riding off into the sunset at Billy Reid #nyfw - MS http://t.co/fWkZasYQ","Suit silhouette play at Alexandre Plokhov - SH  http://t.co/VXzbXW9w","These boots at N. Hoolywood stole the show -SH #nyfw  http://t.co/fNagTX8U","Another look at the rugged tailoring and salty appeal at N. Hoolywood - SH #nyfw  http://t.co/051xFpFZ","Down on the docks old school cool at N. Hoolywood - SH #nyfw  http://t.co/eD6W2mnL","This just in: the Nautica Fall 2012 men's collection from #nyfw http://t.co/1jK7VUtT @nautica","@tommyhilfiger giving major entrance at #nyfw - MS http://t.co/67GlnEQe","We're counting on #NYFW's street style peacocks to pull off a few of these looks we drew up... http://t.co/wYr5GC0p #StreetStyleInventions","Jim Moore calls the @ToddSnyderNY collection the standout collection of fashion week so far. Agree or disagree? http://t.co/XGWFofAX #NYFW","Madeline Weeks calls this pick from the @RichardChaiNY show \"So simple, but very cool, and not tricky.\" http://t.co/74BARMx7 #NYFW","NYFW comes uptown for Tommy Hilfiger at the Armory #nyfw -SH http://t.co/sRbdFgQh","A #NYFW pick from GQ's Ted Stafford: \"The gray hooded puffer vest. Ideal layering piece for the work week.\" http://t.co/gi9Oe75S @dkny","This just in: the Todd Snyder Fall 2012 men's collection from #nyfw http://t.co/XGWFofAX","VIDEO: The Wu-Tang Clan at MILK studio's Fashion Week party last night. This is how it all went down: http://t.co/lGnj8TsS","This just in: the Rag & Bone Fall 2012 men's collection from #nyfw http://t.co/Hnar5fKR @rag_bone","Tommy Ton's Street Style: New York. http://t.co/zF8VKuv4 cc: @jaredflint @jpeskowitz @tmagazine @SartoriallyInc @NickWooster @SHotchkissNYC","Check out Todd Snyder's fall collection on GQ.com...so far, it's the standout of fashion week. Go Todd! JM","This just in: the John Bartlett Fall 2012 men's collection from #nyfw http://t.co/KelLi2Xx","This just in: the Tim Hamilton Redux Fall 2012 men's collection from #nyfw http://t.co/zZJCmZ62","@nautica nubuck utility vest #nyfw -  MS http://t.co/LmLb3IE7","Amazing tailored sweats and mountaineering vibe at General Idea - SH #nyfw  http://t.co/NOdZfL31","Cargo cool at General Idea.  Great puffer vests too. #nyfw -MS http://t.co/0e2TOdEp","Looking for the music from GQ's #NYFW video? Snag it here: http://t.co/hGO9vRMn","@designermannyc sketching away @rag_bone #nyfw - MS http://t.co/gnk3Apwy","House of Pain's \"Jump Around\" at @rag_bone finale - well played - SH","RT @BrianCoatsBC: dear @johnbartlettNY congratulations on a very well done show- haven't loved an ultrasuede jacket that much since Halston.","The double-strap monk is in and these brown Reiss beauties are it. Ts  http://t.co/1ZwwB3Fe","RT @MichaelHainey: See @rag_bone in 30 seconds. #nyfw  http://t.co/MdFGUiLm","Digging this guys gray textured tweed and flannel mix. Ts  http://t.co/6zNU65Jw","Just previewed Billy Reid collection with Billy. It's going to be a KICK ASS show! His first runway show and his best yet!","5x7, Day Two: @backyardbill snaps the wardrobe wizardry of New York's sharpest showgoers: http://t.co/RmSgx30s @shipley_halmos @nickelcobalt","This just in: the complete Ovadia & Sons Fall 2012 collection, direct from #nyfw http://t.co/bVzhifFs @OvadiaandSons","Editors' Picks: See what's catching the eyes of the GQ fashion team in New York from the Fall 2012 collections: http://t.co/M4rthiKd","RT @BrianCoatsBC: Designers are not afraid of showing in cold dark piers in the winter. #NYFW","RT @richardblandino: Miles M. w/ Richard Chai @ his after party http://t.co/xDjaHSUs","RT @MichaelHainey: One more @_neilbarrett All the materials are vegan or up-cycled, like the Hudson Bay blankets. #nyfw http://t.co/anab6arb","@johnbartlettny gives us a colorful eco-friendly camping trip for #nyfw  - MS http://t.co/7zOjrmtw","Tim Hamilton Redux gives us an urban army with a spot of sunshine for #fw12 #nyfw http://t.co/bcw0CXpz","Making the team courtesy of #libertine #nyfw -MS http://t.co/rz616N8E","This just in: the Joseph Abboud Fall 2012 men's collection from #nyfw http://t.co/IDPqeUTc","@toddsnyderny military meets evening, all topped off with the perfect parka #nyfw -MS http://t.co/C6SJ35IZ","RT @shipley_halmos: Keep up with us daily during #NYFW on the @GQfashion photo diary shot by @backyardbill (arm wrestling is tiring) htt ...","I like these jeans from gilded age. \nmw http://t.co/NpfhuLM4","And one more from Armando Cabral - killer kicks. #nyfw  http://t.co/5okTdo2M","Perfect pebbled boots at Armando Cabral - SH #nyfw  http://t.co/esHg710F","At Armando Cabral, we're good with gray - SH #nyfw  http://t.co/MbziX2Ar","@jaapparel model men.  Stay tuned to @gqfashion for the full show- MS http://t.co/EO94OVjq","Footwear update at Joseph Abboud... Haute hikers for days.  http://t.co/jjSBJLsd","This just in: the Shades of Grey Fall 2012 men's collection from #nyfw http://t.co/s8wnE5sg","This just in: the Duckie Brown Fall 2012 men's collection from #nyfw http://t.co/mzyNpGy5","This just in: the Richard Chai Fall 2012 men's collection from #nyfw http://t.co/8Pvf5o7r @RichardChaiNY","Better than fashion... We'll never tell. The view from Pier 59 Studios -SH http://t.co/9WjsgzCm","Obsessed with this blue tweed jacket at Native Son #nyfw -SH http://t.co/gooRdHF3","This just in: the Number:Lab Fall 2012 men's collection from #nyfw http://t.co/UgcHbj7b","http://t.co/7hb0h3F7 - VIDEO: the Duckie Brown Fall 2012 collection, direct from #nyfw","The Duckie Brown lineup #nyfw via @michaelhainey http://t.co/qUnZWGgF","Wanna rub elbows with an editor during NYFW? Try Kava Cafe: http://t.co/7BS3FweU - @MichaelHainey endorsed.","The right way to dress for biking to work in NYC. Love the tonal gray and matte blacks - from bike to backpa http://t.co/16ugVZf5","lotsa flat-ironed bedhead at #duckiebrown -AR","Power pleating at Duckie Brown for #nyfw - MS http://t.co/hx2bPbwk","RT @therichdale: zombie boy next to waris at #duckiebrown both of these things are not like the other","Street style trends are really out there this year--see the one everyone's calling \"Turban Outfitters\" http://t.co/wYr5GC0p","The Snap Judgement: GQ's Madeline Weeks reports live on the Gilded Age Fall 2012 collection. Get her first impressions: http://t.co/GvYIDsxD","The Snap Judgment: @MichaelHainey gives the lowdown on the DKNY Fall 2012 collection. Watch his live recap here: http://t.co/nTl1p9dD #nyfw","In this shoot from our Feb. issue, @sleighbells prove that with style, looking back is the best way to look forward: http://t.co/7YUDSFYM","This just in: the Tim Coppens Fall 2012 men's collection from #nyfw http://t.co/BMYb1ajB","@richardchaiNY gets his props post show #nyfw  http://t.co/n79sGfJN","5x7: Backyard Bill documents the daily wardrobe wizardry of New York's sharpest showgoers: http://t.co/RmSgx30s @shipley_halmos @parkandbond","Dope duffel coat @numberlab. #nyfw  -MS http://t.co/QjxSn5cW","The stage is set for the @numberlab show.  Looks to come. #NYFW  -MS http://t.co/YUvevvWP","The Vintage Shoe Company boots at Nicholas K are crazy good. -SH #nyfw  http://t.co/Lwo9FwHn","First look - @nicholask - Cowboys and cowgirls action #nyfw http://t.co/4eBT0HQM","RT @BrianCoatsBC: Oh finally the invite I've been waiting for! It's a must see do not miss show! #nyfw http://t.co/OpiU1b24","This just in: The full Blanc de Chine fall 2012 collection, direct from #nyfw http://t.co/maR2QTEo @blanc_de_chine","This just in: The full Gilded Age fall 2012 collection, direct from #nyfw http://t.co/JCF9TaJO","Seen and admired on the way to the Gilded Age show - A modern design gem in NYC's east village. Ts  http://t.co/fEPyJOGf","This just in: the DKNY Fall 2012 men's collection from #nyfw http://t.co/s8vQ9sMF","Killer collection tonight from DKNY--the perfect big city cool-guy wardrobe! Check it out on GQ.com.","Two standout Tim Coppens looks from #NYFW - JM http://t.co/wYyfxjzL","Tim Coppens is the name. Learn it. #NYFW - MS http://t.co/wyQpfveH","Loving this look at @dkny - cropped and crispy - SH http://t.co/eTLtLRwK","@dkny army. #nyfw - MS http://t.co/Te0aDDe4","This just in: the Hyden Yoo Fall 2012 men's collection from #nyfw http://t.co/6gwxawjX","Amazing bags from @coach collaboration with artist James Nares.  Can't share pics yet but put it on your radar for later this spring. #NYFW","Gilded Age's rough and tough speed demons for #fw12 at #NYFW -MS http://t.co/z6jauBjO","RT @MichaelHainey: Who's the crazy guy jumping up and down with his back to the camera? http://t.co/svhFoVz4\n#nyfw","This just in: the Steven Alan Fall 2012 men's collection from #nyfw http://t.co/TsnEGSXZ @Steven_Alan","Chatting with @RichardChaiNY on his new collaboration with @Filson http://t.co/3pymnb1P","Here's your first look at the world of Ralph Lauren for fall 2012 http://t.co/Rtrxlsdv #nyfw","RT @GQMagazine: You've seen our Lust List now tell us yours. Who are the women you'll be watching (maybe too closely) in 2012? Vote now  ...","RT @GQMagazine been following our Lust List? Now you can see every girl in one handy slideshow. (You're welcome) http://t.co/k2bZym2d",".@TimoWeiland @JCrew_Insider @GantRugger Thanks for the sneak peek at your collection! http://t.co/EpTbREJb #nyfw",".@GENERALIDEA2012 @TommyHilfiger @billy_reid @shipley_halmos Thanks for the sneak peek at your collection! http://t.co/EpTbREJb #nyfw",".@YigalAzrouel @OvadiaandSons @dkny @RichardChaiNY @AntonioAzzuolo Thanks for the sneak peek at your collection! http://t.co/EpTbREJb #nyfw",".@bandofoutsiders @SimonSpurrHQ @LodenDager @monclerofficial Thanks for the sneak peek at your collection! http://t.co/EpTbREJb #nyfw","EXCLUSIVE: sketches, inspirations, and first looks from some of our favorite designers showing at #nyfw http://t.co/EpTbREJb","RT @TimTebow: Thanks for all the help @lexgon28! RT @GQfashion: See the best-dressed at NFL's awards ceremony. @TimTebow killed it http: ...","Want to attend the @TommyHilfiger #nyfw show featuring @CobraStarship? @AmericanExpress cardholders can get tix here http://t.co/3UcvIpXQ","RT @BrianCoatsBC: Watch out #nyfw - this is how team GQ gets ready.. http://t.co/mJ6DAnPJ via @gqmagazine","First look - @nickwooster for @leffotnyc  http://t.co/SOwdLyCd","And so it begins. First up: @steven_alan #nyfw http://t.co/HQnu1gBq","Newbies... So hot right now @stevenalan - SH http://t.co/4uNKhxef","Style inspiration from Langston Hughes http://t.co/xjzOVbgw #BlackHistoryMonth","This blazer by Isaiah Hemmingway has got us itching for spring http://t.co/omja2AdD @IHemmingway #menswear","\"Anyone can probably pull of anything. The question is—Would you want to?\" @MichaelHainey as told to @ParkandBond http://t.co/ksuHGIcw","See the best-dressed ballers at the NFL's awards ceremony. @timtebow killed it, so did @AaronRodgers12 http://t.co/0gqqG0FV","VIDEO: How does the GQ Fashion team prep for Fashion Week? It goes something like this: http://t.co/GO6iDf98 #nyfw","ATTN: Jet-setters, we found the perfect kicks for traveling http://t.co/B2j0jKyX","Tommy Ton of @JakandJilBlog on street style and his big break http://t.co/oCvaM1rj","Check out our latest batch of Paris street style photos courtesy of our Wandering Eye photog @GVONSTEINER http://t.co/zgFchDpl","RT @BrianCoatsBC: This LL Cool Jay resurgence is really something.","Did you watch the premiere of #Smash? See more of @katharinemcphee (in less clothes) in her sexy GQ shoot http://t.co/OMcHsqyw @NBCSmash","\"Anna Dello Russo is the ultimate peacock.\" - @JakandJilBlog","\"A guy can't go too far outside his comfort zone without looking like a freak.\" - @JakandJilBlog on #menswear","Keep an eye out for a design collab between @JakandJilBlog and @clubmonaco coming at you soon. -SH","\"Toggle coats and sweaters... And smoking...\" @JakandJilBlog on his trends from Pitti Uomo this year - SH","Tommy and our host Josh talking shop at the SoHo Apple store http://t.co/mNPflY5X","Tommy's first show was Balmain - he danced in the rain afterwards. @JakandJilBlog #meetthephotographer","\"Has street style started a fashion arms race?\" - @jpeskowitz from @parkandbond - we're all in agreement of the affirmative here - SH","\"I think street style has brought clothing down to earth\" - @JakandJilBlog","At the soho apple store waiting on the start of \"meet the photographer\" with @JakandJilBlog - seats filling fast -SH","If you Like us on Facebook you'll love our video of the Lust List girls you won't find anywhere else but here: http://t.co/XrrHenmM","Yes. RT @GQMagazine These photos should explain why Joan Smalls is on our Lust List for 2012 http://t.co/tZlEdRac @JoanSmalls1","RT @GQMagazine Need a reason to watch the premiere of #Smash tonight? We've got two: Katharine. McPhee. http://t.co/OMcHsqyw @NBCSmash","RT @GQMagazine: If you read one story today, make it this incredible true tale: Chris Heath finds a secret world at the Zanesville zoo.  ...","RT @richardblandino: A Smalls step for mankind:  Joan Smalls video @GQMagazine #GQ #LustList #models\nhttp://t.co/aHL74sWG","@MISTERMORT good stuff at Pringle! JM","The next step in Alexander Wang's plan for global fashion dominance? Men's accessories: http://t.co/G6tncaVA @AlexanderWangNY","The fine folks @Bonobos took a break from interrupting your Spotify listening to launch their newest endeavor, suits: http://t.co/CsEol88r","Your Morning Shot: Gordon Parks. \"And now, at 85, I really feel that I'm just ready to start.\" http://t.co/MCVI3WAc","With a slimmer silhouette and updated profile, you're to want to rock these @Danner's long after the snow is gone: http://t.co/fb26QmJe","Everyone's favorite Brooklyn tailor, Martin Greenfield, will be posted up in the Ace Hotel next week: http://t.co/aCWzcvf6 @TheAceHotel","Black watch on trucker - SH http://t.co/llyjK2BE","RT @BrianCoatsBC: Shout out to @GQfashion newest find. \"bra-tenders\" #ugogirl http://t.co/wu1neI7h","Jonah Hill has finally seemed to find the ideal weight. The perfectly cut jacket helps the case, obvs: http://t.co/fWRVKKoi @JonahHill","Your Morning Shot: Paul Robeson. \"...As a citizen, I will always speak for peace, and no one can silence me in this.\" http://t.co/Nvo4x06N","Venerable downtown opticians Moscot have cruised out to Cobble Hill with the opening of a new store: http://t.co/fqk8HmNV @MOSCOT","The team at PROJECT and Nick Wooster are unveiling a second season of PROJECT Wooster in Vegas in a couple weeks time: http://t.co/rBPF2EwZ","Poppin' Tags: Michael Bastian for Barneys New York: http://t.co/FoIFosVg @mbastiannyc @BarneysNY","Random girl stops by for some serious fashion advice from Peggy Sirota on our shoot in LA!  http://t.co/RjYZSimY","Put this DaLuca strap on your next Rollie: http://t.co/aGjBNSbC","Nick is edging out Joe for most stylish Jonas bro. (Yeah, we know all their names! What of it?!) http://t.co/t1glwhf3 @nickjonas","So I bought the damn tie bar, now what? GQ creative director Jim Moore breaks down exactly how it's done: http://t.co/CULt5MmI","Spot the ballsiest Ronsonian style moves: http://t.co/ha0FrFqH @iamMarkRonson","Our intrepid photographer Ben Ferrari surveys the men of New York for the best winter street ensembles: http://t.co/tXK2uJKL...","Week in Style: Jonah joins the middleweights, Efron joins the lumberjacks, and Gosling still looks criminally handsome: http://t.co/eEI7jIKJ","Marcus Garvey: \"A people without the knowledge of their past history, origin and culture is like a tree without roots.\" http://t.co/Xa7GfmL4","All black everything from @miansai - winter wrist game - SH http://t.co/nPbpEhK9","The Cortez was once the most advanced shoe on the market; now it's a perfectly nostalgic sneaker for the street: http://t.co/zJ1xXA95 @Nike","Dear Cuba Gooding Jr., get it together man! We're officially banning you from wearing this wack three-piece: http://t.co/acM9z2KN","Sorry Mickey Rourke, you may have nailed the Williamsburg look, but this ain't how you're supposed to wear sunglasses: http://t.co/qwC2ntOq","RT @BrianCoatsBC: My #nyfw badge just arrived in a chic black box. Can't wait to not wear it around my neck like an agent at the CDC. ht ...","RT @MattySeebs: Courtesy of @GQfashion our first look at @AlexanderWangNY new men's accessories collection, launching tomorrow http://t. ...","@mbastiannyc to launch a new line of suiting at @BarneysNY later this month aimed at the workplace says @womensweardaily - SH","And the award goes to @Corey_Feldman for Worst-Dressed Man of the Month: http://t.co/zHB0hMZC","This is a little obvious, but...@CheechMarin what were you smoking when you picked out this suit, dude? http://t.co/NgXCjzZW","@Moscot opened their first store in Brooklyn, and we were the first to see it: http://t.co/fqk8HmNV - \"It's like coming home in a way.\"","Watch as @revenge's Josh Bowman shows off how to rock the parka look for this spring http://t.co/9Xalysm3",".@okcthunder's James Harden told us about his favorite things, like these kick-ass Louboutin kicks: http://t.co/96Lu2wFr @jharden13","This month, @Mark_A_Green is taking over \"Your Morning Shot\" to celebrate some of the most brilliant minds of all time http://t.co/xlQByXam","RT @BrianCoatsBC: Jim Moore @GQfashion to model during a run thru:what would u like 4 dinner? Model:I'll have filet mignon. JM: Oh, ok.",".@JonahHill, please remember this link when choosing your tux for the Oscars http://t.co/Z3kzKeFb Your boys at GQ.","New @moscot store in BK! 159 Court St. Opens tomorrow. - SH http://t.co/rJDXxuvN","George Clooney always kills it on the red carpet, but for the Oscars we think he should change it up http://t.co/0wOts2OM","Jean Dujardin looked great at the Globes, but we think he has the proportions to go with something bolder, like this http://t.co/36K1OY0O","RT @willwelch: Oh snap! Glenn O'Brien tweets! Definitely a difference maker, could be a game changer. Holler @lordrochester","If we were dressing the Oscar nominees, these are the designers we'd put them in http://t.co/ce5pVJJU","RT @BrianCoatsBC: U know u are the gay best friend when she texts you a pic of her new tranny heels. @ShannonSpillett #rosesranicetouch  ...","RT @GQMagazine Justin Saunders of @jjjjound collected a series of images, items, and art exclusively for us http://t.co/AdajveMI","Armie Hammer made a strong case for Next Big Leading Man status in a @gucci tux at last night's SAG Awards http://t.co/gckGZgY2","John Krasinski shows the right way to pull off navy at the SAG Awards http://t.co/JR02ivTL","Who wins battle leopard, @LilTunechi at the 2011 VMA's or @Shaun_White this past weekend in Aspen?? http://t.co/yVYxy9fw - Rawrrr.","We haven't seen @corymonteith look this good in, well, ever. Definitely one of the best dressed at the SAG Awards http://t.co/Qxgbej5p","Aaron Paul took a style risk at the SAG Awards--and we think he pulled it off. http://t.co/C7nDzMFf @aaronpaul_8","RT @GQMagazine Our scent critic ranked the 10 best-smelling cities on the planet (and the 1 worst). http://t.co/Ut3vtwM6","@ejsamson called my kit today transitional, what chall think? -SH http://t.co/zmET5XB5","Just because you got the girl doesn't give you free rein to dress like a schlub. Here's how to dress on date night http://t.co/AhYcKmfX",".@DarrenCriss in @versace gets our vote for best-dressed at the SAG Awards. Well done, sir http://t.co/Umfs8UIg","The 10 Best-Dressed Men at last night's SAG Awards http://t.co/NGy8PKfR","RT @BrianCoatsBC: Overheard at #milkstudio. \"WHERE THE HELL IS MY GDAMN CALMING TEA?!\"","RT @BrianCoatsBC: “@pointshootthink: Waiting to go home after day shooting for #GQ with @BrianCoatsbc @RichardBlandino http://t.co/lNjJO ...","RT @BrianCoatsBC: @jesseAmelia care to explain why she is hanging out by your desk all day @GQfashion? #creepy http://t.co/QJZ52ijq","#FF GQ's latest editors on twitter @mattyseebs @MichaelHainey","Gosling showed up in a perfect-fitting Gucci suit that would drive even Don Draper to his tailor. Welcome back, sir. http://t.co/PALuSBMz","Your Afternoon Shot: The Killers. Perfect ties. Perfect suits. Oh yeah, and those shades. http://t.co/dktpVPIS","Week in Style: the week everyone froze their balls off watching PoMo indies. (And, surprise! @Drake wore a sweater.) http://t.co/IoSNAIpL","See our exclusive look at some of the offerings from the Hugo Guinness for Coach collaboration here: http://t.co/nmzs6BrA @Coach","Bruce Pask has our vote for the best dressed dude in Florence, Milan, and Paris. Learn from a master: http://t.co/FiLtsg6w @themoment","Feeling Donegal tweed, but not ready to jump into a jacket? These Edward Armah pocket circles could be a gateway drug: http://t.co/H9z7xymT","Want to give your solid business suits a subtle lift? Get small with these tiny dot and check patterns: http://t.co/Hs9geRbj","This season we have to say that relative newcomer MAN stood out as our favorite at the New York trade shows: http://t.co/lMBEqimZ","RT @SHotchkissNYC: I'm obsessed with this @liberoferrero Portage: http://t.co/rIE8oER0 - acceptance is the first step to admitting you h ...","Your Morning Shot: Sean Connery. \"The best of my life is the moving. I look forward to going.\" http://t.co/MGxPDdIe","RT @BrianCoatsBC: Demi on whippets?? Really? I mean so much to say about that....","Thanks to @acontinuouslean and @bushmills we have a bag that holds hooch- SH http://t.co/s0pblj6L","Spotted and coveted at @MRket_show yesterday were these Gitman Bros. cashmere ties: http://t.co/0A08ADZC","Do you know the 4Cs to diamond buying? There's an app for that http://t.co/3ONVNrxm","We caught up with Kris Van Assche after Paris Fashion Week to get his 10 must-have essentials http://t.co/h45MNnpd @KRISVANASSCHE","Good news: These sunglasses work well on just about any face and are making a big comeback this spring http://t.co/qIVKSqNb","In case you were wondering, @_ASAProcky likes clothes. That hip-hop high-fashion agenda? It's on right now: http://t.co/O1LTNuxA","RT @BrianCoatsBC: Prada makes the same tie Boehner is wearing - we have it in the closet @GQfashion but it's 1/4 the width.","No negotiation necessary here - JFK in whites and a slim tie? Best in class. http://t.co/cgbESha0 - He's Your Morning Shot.","RT @SHotchkissNYC: Blogs get wider... http://t.co/fSCqqya1","Meet the scariest thing you'll ever put on your wrist, the @Nike Plus Fuelband: http://t.co/1fJonJ7T -","@JakeDavisFilms shot @UnisNewYork 's Eunice Lee in his latest \"Test Shot\" - Jake tells us how it came to be: http://t.co/wOvigVYf","RT @richardblandino: One good reason to watch #Remodeled     tonight on WPIX:  Olga Tavarez http://t.co/WwAmxu2J","This fall we recommend investing in a statement leather jacket. Here are our favorites from the Paris runways http://t.co/ztb39ROt","Here are the top 9 winter essentials to get you through the season http://t.co/aREz3jcg #menswear","An exclusive sneak peek of the A/W 2012 lookbook for one of our favorite New York brands @ovadiaandsons - http://t.co/l61hVLYB - sharp!","If there was an Academy Award for most stylish movie of the year, these would certainly make the cut: http://t.co/WlSnmDZ0","@Burberry gave us the exclusive first look at their Brit A/W 2012 collection, here: http://t.co/49F9E3MF","Oscar nominee Jean Dujardin looks pretty good in a plaid suit, don't you think? http://t.co/yIxXPtXb","RT @BrianCoatsBC: Don't have a selvedge jean? Use a sharp scissor to trim the surge stitch off the edge and voila! #tips http://t.co/4s7 ...","Lanvin: \"a perfect mix of luxury, masculinity, and wearability\"-GQ creative director Jim Moore http://t.co/NmAqiKte @LANVINofficial #PFW","RT @GQMagazine NEW VIDEO: Behind the scenes of Michelle Williams's sexy GQ shoot http://t.co/BX6ECo8L","VIDEO: GQ's Jim Moore and @MichaelHainey run down the best trends and looks from Paris fashion week http://t.co/FHfUdxqe #PFW","These @Pryourity camp caps have us excited for the spring! http://t.co/gUbcXtsv","Trend alert: Paris may be the City of Light but we saw a blackout on the #pfw runways http://t.co/cQA74Xv1 #menswear","Now that the Paris shows have wrapped up, get the full list of GQ Editors' Picks from #pfw here http://t.co/kjAQjB8P","Look who Tommy Ton spotted in his latest batch of Paris street style http://t.co/6l9RUTkL (cc: @MichaelHainey)","Trend alert: Guys, be sure to invest in some serious hardware when it comes to your shoes this fall http://t.co/gWxTBo2w","Gorgeous camel coats at the Margiela show here in Paris!\nmw http://t.co/fZwMe6fr","Here's your cheat sheet to Paris fashion week: All the vibes from our favorite shows http://t.co/UOxEfGyW #PFW","We rounded up the 100 best pairs of shoes from Milan and Paris Fashion Week. Warning: Major #shoeporn ahead: http://t.co/YermlgnE","Yeah so this is on my desk now... -SH http://t.co/XQpZ4oAd","Wearing my @ovadiaandsons tie tonight - with a personal touch. -SH http://t.co/GsKD4E28","VIDEO: The Thom Browne fall 2012 men's collection direct from Paris http://t.co/lJC7ZXpu #PFW","This just in: the full Thom Browne men’s Fall 2012 collection direct from Paris #PFW http://t.co/f4E8lYDP","RT @MichaelHainey: And more @Thombrowne #PFW http://t.co/gbbv36pq","RT @MichaelHainey: . @Thombrowne #PFW http://t.co/GBJLO9uV","This just in: the full Agnès B men’s Fall 2012 collection direct from http://t.co/y2BkrQqm","Surfing Givenchy style \nmw http://t.co/T7El6RhM","Here it is... http://t.co/f2U8m2oK","Love this picture from the Jean-Paul Goude show at the musée des arts décoratifs. So awesome!\nmw","VIDEO: The Paul Smith fall 2012 men's collection, direct from Paris #PFW http://t.co/WA0Xz3hC","RT @BrianCoatsBC: @NaiLCElebrity all hail the Queen of nails- don't let her catch u doin your own- \"so this is what we're doin now, chip ...","First show of the day is in: Lanvin's Fall 2012 Collection: http://t.co/xMKSvRNK","RT @MichaelHainey: Odd Job is alive and well and big pimpin' in Paris. #PFW http://t.co/wvaVbckM","Walking into what proved to be a very luxurious and masculine Lanvin men's show. Check out the slide show soon! JM http://t.co/VRGesecx","This Hermes canvas bag is super cool for men. I love it - it's so simple and classic and masculine. \nMW http://t.co/YVBYSpZC","Trussardi's fall collection was an excess-driven scene that might have attracted cocaine kingpin George Jung in Blow: http://t.co/6gr0pSV5","Thinking about going on safari this year? Skip it and save for this, instead: http://t.co/WkJErutS","RIMOWA's indestructible, lightweight Robocop-looking luggage is some of the best in the world: http://t.co/sjJ6sVT7 @RIMOWA_NA","Spotted at the (capsule) trade show was a lineup of lust-worthy leather jackets made here in the good ol' USA. http://t.co/CkVJszdX","This just in: the full Prada men’s Fall 2012 collection direct from #pfw http://t.co/QsRhhhhB","This just in: the full Raf Simons men’s Fall 2012 collection direct from #pfw http://t.co/VMz4adKu","Carven brought a Gallic eye to some Anglo-American basics like knits, duffels and our favorite: pocket protectors. http://t.co/TYpC8rhn","PROJECT picks: This Hamilton 1883 horizontal stripe is a handsome turn from the traditional, more Riviera than rancher: http://t.co/R2fLtQEv","The only way to get around the city on a snow day. #Mainepride -SH http://t.co/0Qkl5vRB","Draught Dry Goods hand makes this sleek, lightweight stitched belt that fits seamlessly into your daily rotation: http://t.co/9jk0fOBV","This just in: the full Christian Dior men’s Fall 2012 collection direct from http://t.co/8KLCmjb0","VIDEO: The Raf Simons fall 2012 men's collection, direct from Paris #PFW http://t.co/c3Dhea2Z","This just in: the full Kenzo men’s Fall 2012 collection direct from #pfw http://t.co/FoHMuft7","RT @MichaelHainey: Here is your Hermes finale, Ron Burgundy and all #PFW  http://t.co/hr5rTB9z","This just in: the full Ann Demeulemeester men’s Fall 2012 collection direct from #pfw http://t.co/y0jFEtPM","VIDEO: The Hermes men's fall 2012 collection, direct from Paris #pfw http://t.co/txqZUZE2","RT @MichaelHainey: Check out my report from Milan on GQ.com http://t.co/C1bfXKDy\n#PFW #mfw","The Kenzo show was really great . It took place at a train station and the inspiration was commuting . Very cool.\nmw http://t.co/pLIeU23N","Jason, designer of Brioni looking dapper in his three-piece while being interviewed during his Milan presentation. JM http://t.co/fEVnhLHr","Hermes show was strong, chic and totally cool! One of the best shows I've ever seen. Check it out! JM","Looks like winter is finally here. Don't forget our 12-point plan to looking cool this season http://t.co/eW9h2lKj #menswear","VIDEO: GQ's Jim Moore and @MichaelHainey discuss the best trends and collections to come out of Milan http://t.co/8MGqej71 #MFW #menswear","VIDEO: The Maison Martin Margiela fall 2012 men's collection direct from Paris @MMM_Official #pfw http://t.co/lj4BbgXR","RT @MichaelHainey: The men's finale .@Dior #PFW @Dior  http://t.co/67KRcR6O","Every look from today's Margiela show http://t.co/OecO95nZ #pfw","RT @MichaelHainey: #girlwatchinginParis at the men's shows. http://t.co/NK23oqlp","RT @MichaelHainey: Burgundy. Ron Burgundy. Kenzo stays classy http://t.co/JTSkbCsX","http://t.co/miyeMMDT - Today's Ann Demeulemeester show in 30 via @michaelhainey #pfw","This just in: the full Givenchy men’s Fall 2012 collection direct from #pfw http://t.co/z5uUZeNx","This just in: the full John Galliano men’s Fall 2012 collection direct from #pfw http://t.co/LQCofOe8","Jim Moore on @DriesVanNoten in Paris: \"The coats were strong, and Dries, being a master tailor, knows how to cut them.\" http://t.co/4PRYZCYR","The red sock showdown continues. Up next: http://t.co/oQO4KMOO's @steliosphili #gq #officestyle  @ GQ HQ http://t.co/TYXCOBY3","See what GQ's Jim Moore calls \"Jean Paul's rouge-ish and right-on fall collection.\" http://t.co/PeX6f1ff @JPGaultier","This just in: the full Comme des Garçons men’s Fall 2012 collection direct from #pfw http://t.co/DfTH3Xo1","\"The exploded-plaid-patterned tweed suits under all of that classic Yohji draping were spectacular.\" http://t.co/0THP63GX @YohjiYamamoto","VIDEO: The John Galliano fall 2012 collection direct from Paris #PFW  http://t.co/XTKFmzmq","This just in: the full Kolor men’s Fall 2012 collection direct from #pfw http://t.co/Kjv88bR0","This just in: the full Kris Van Assche men’s Fall 2012 collection direct from #pfw http://t.co/XGr8D2YB","April showers only really bring rain, and lots of it, so be prepared this spring and invest in a proper parka: http://t.co/Ds0MOIZW","RT @ejsamson: Who needs a tie clip? Not Kris Van Assche: http://t.co/cZQrfVV2 I dig it. #pfw @KRISVANASSCHE","Tommy Ton Street Style: Paris. Which look is your favorite? http://t.co/uCzswmph @JakandJilBlog","Louis Vuitton: \"Luxury meets sporty in a stunning collection. Head-turning.\" - GQ's Jim Moore http://t.co/4LDsoxFR @LouisVuitton_US #pfw","All winter, our intrepid photographer Ben Ferrari searches downtown for NYC's most interesting men: http://t.co/NJHiuNT1 @benferrariPHOTO","Week in Style: Radcliffe dressed like a boss, Rogen dressed like an Oberlin freshman, and Pitt looked dreamy as always: http://t.co/ceCQAv5t","VIDEO: The Kris Van Assche fall 2012 collection, direct from Paris #PFW @KRISVANASSCHE http://t.co/jq7OQSGV","DVN ties! -MW http://t.co/nP48gHaQ","The Dries Van Noten men's store in Paris. Looks so good! -MW http://t.co/YfxrnSqE","RT @BrianCoatsBC: U think u have good assistants but I bet they never made a diagram of the best way to order Starbucks. #okimspecific h ...","This just in: the full Junya Watanabe men’s Fall 2012 collection direct from #pfw http://t.co/A0UiQdRf","This just in: the full Yves Saint Laurent men’s Fall 2012 collection direct from #pfw http://t.co/sUVGtHrh @YSL","RT @MichaelHainey: @YSL last look #PFW http://t.co/H69suN8e","http://t.co/WGKb7DfO - this morning's Junya finale via @michaelhainey","RT @MichaelHainey: Someone to brighten a gray day. #girlwatchinginParis http://t.co/mhPHyYug","RT @tfserna: @GQfashion sell well on eBay.","RT @GQBound: @GQfashion to get through the Danger Zone?","RT @natasha_fashion: @GQfashion regurgitate?","RT @DougeyPhresh: @GQfashion navigate through all the shit his friends are gonna give him for wearing it...","Fill in the blank: This Adam Kimmel model needs this helmet to _____ http://t.co/DjOpROXw #pfw","Exclusive: Mark McNairy New Amsterdam A/W 2012 behind-the-scenes video: http://t.co/O3IAl1SX","More PROJECT picks: Oak Street Bootmakers Tall Boot. http://t.co/4DQZrOcM","We love @ernestalexander's approach to durable and beautiful bags, and this pop-color orange tote is a true winner: http://t.co/W3zRExXx","Your Afternoon (Street Style) Shot: Street Etiquette. http://t.co/XUM9h6xd","RT @MichaelHainey: @driesvannoten in 34 seconds. #PFW  http://t.co/cQjLGiNI","This just in: the full Maison Kitsune men’s Fall 2012 collection direct from #pfw http://t.co/qeb2fGE4 @maison_kitsune","This just in: the full Woolrich Woolen Mills men’s Fall 2012 collection direct from #pfw http://t.co/hdy8Ljr3","This just in: the full Louis Vuitton men’s Fall 2012 collection direct from #pfw http://t.co/3BECEeT9 @LouisVuitton_US","#ArcherFX RT @sean_fennessey Unfadeable Archer coverage. (We like Archer.) http://t.co/aDNQ4OeS","VIDEO: The Jean Paul Gaultier Fall 2012 men's collection, direct from Paris #pfw @JPGaultier http://t.co/QAUPHanY","This just in: the full Viktor & Rolf men’s Fall 2012 collection direct from #pfw http://t.co/25FOMQHg @Viktor_and_Rolf","RT @MichaelHainey: And here's Kim revealing to @GQfashion the source of a fabric for the new collection. @LouisVuitton_US #PFW  http://t ...","Red Alert at Jaeger-Lecoultre. This grand reverso 1931 rouge is hot. Ts  http://t.co/edGmhLdb","Ralph Lauren's ultimate new Safari watch. A favorite of the day for sure - perfect blend of rugged and refined. T http://t.co/htZUL9Eg","RT @MichaelHainey: Check out the shoes for Vuitton. @LouisVuitton_US #sickshoes #PFW http://t.co/j26B7xbF","RT @MichaelHainey: And here's the @LouisVuitton_US men's show in 37 seconds. #PFW  http://t.co/m74NhebD","Check out this amazing installation at Vuitton. So elegant and polished. Kim Jones is the perfect designer for LV! -MW http://t.co/oo5uaJRV","Meet the Nike+ fuel band - it measures your daily activity - hint: take the stairs -SH http://t.co/KfePrx66","The ultimate measure of activity: NIKEFUEL  http://t.co/2wwB92iJ","A really amazing-looking one. -MW http://t.co/RK43L20G","This just in: the full Rick Owens men’s Fall 2012 collection direct from #pfw http://t.co/qpTZpNLr","@jimmyfallon hosting @nike event -SH http://t.co/zWxpRUGe","@nike is about to unveil something big. -SH http://t.co/mH6xDo9X","Bikes are the favorite accessory here in Paris. You can buy all sorts of cool bikes at this store, Merçi. -MW http://t.co/xIl28zwS","Cloudy and gray and still beautiful. -MW http://t.co/yjlip0j9","RT @BrianCoatsBC: Dear Mr. Santorum- just because it's your thing doesn't mean u have to wear the damn sweater vest everyday. They're no ...","RT @MichaelHainey: Some kinda crazy thing the kids and Kanye will plotz for. @LouisVuitton_US http://t.co/IPbxNUvg","RT @MichaelHainey: Kim Jones @LouisVuitton_US gave us a preview of the collection yesterday. Here are some up close looks http://t.co/89 ...","RT @MichaelHainey: Giorgio Moroder doing the music at Vuitton.","RT @MichaelHainey: Pierre Hardy showed us what he's been doing...  #sickshoes @pierrehardynews http://t.co/iiADRkZr","This just in: the full 3.1 Phillip Lim men’s Fall 2012 collection direct from #pfw http://t.co/2WyD9shC @31philliplim","Prior to Pitti, we asked the elusive Boglioli brothers what every American man should know about getting dressed: http://t.co/cBFIpXbD","Audemars Piguet's ultra thin Royal Oak. Cheers on 40 years! Ts  http://t.co/iwjEynyN","SIHH in Geneva off to a clean start at A. Lange & Sohne. Saxonia in white gold is one beautiful watch. Ts  http://t.co/4IuVk2wU","Check out Ami's collection, up soon. It's one of our all re favorite collections. JM","Looking forward to the The Louis Vuitton show. We previewed with designer Kim Jones and the collection looks awesome! JM","RT @BrianCoatsBC: \"and furthermore, if you don't find me on set then I must be on location.\" @glemaud","This just in: the full Mugler men’s Fall 2012 collection direct from #pfw http://t.co/EYtVlNLk","This just in: the full AMI men’s Fall 2012 collection direct from #pfw http://t.co/MGZdDDaj","Old man plaids are back! http://t.co/Hgl1lC96 - here's evidence from Pitti Uomo","This Just In: New Milan street style shots courtesy of @JakandJilBlog's Tommy Ton http://t.co/nhIkXewb #MFW","RT @MichaelHainey: Getting ready for @gq_france Men of the Year. Here is my shirt back from the laundry. I'm tempted... http://t.co/6HIfj6BL","Read every recap from the top shows in Milan here http://t.co/OfRBPRO2 Which #mfw collection was your favorite?","We hit up @projectshow and uncovered the best of what's to come in #menswear this year: http://t.co/5ulcNqrE","Last look from Milan: The full Diesel Black Gold men's fall 2012 collection http://t.co/qkchCU9M We'll see you in Paris","RT @sean_fennessey: Bane ♥hearts Zegna. http://t.co/iQexqCdd","@mattyseebs calls out the stuff you need next fall from @capsuleshow in our Editor's Picks: http://t.co/rdqofDjM - camo trainers, y'all...","We are in Paris and ready for day one of what is hopefully a great French fashion week! JM","RT @MichaelHainey: Can anyone name this exotic creature, last spotted tottering slowly, slowly, slowly down via Gesu, in Milan?  #PFW ht ...","The Castello aside the Jil Sander showroom. A beautiful spot always in Milano. Ts  http://t.co/lPck4P7y","Neil Barrett's skin on skin  http://t.co/8jbTWGcU","@MichaelHainey #girlwatchinginmilan ?","RT @MichaelHainey: On our way to Paris, France, Europe. Stay tuned.... #mfw  #PFW http://t.co/woLYAhIO","Milan's best-dressed men dominated this year. Here's more photo evidence, brought to you by Tommy Ton: http://t.co/MqOygfy1 @JakandJilBlog","Catch up on #mfw with our Twitter diary, featuring a legendary face-off between @MichaelHainey + Brunello Cucinelli http://t.co/eh1cWgoI","These @goincase headphones are crazy comfortable and sleek. -SH http://t.co/PDLnKS6Q","The easiest way to get that GQ look: Let our creative director Jim Moore do the shopping for you over at @ParkandBond http://t.co/0LKuzugF","We shot an exclusive editorial on site at @capsuleshow in New York yesterday: http://t.co/9ygt1mIC - photos by @justinchung","RT @MichaelHainey: And who doesnt need travel-size Nutella? #mfw http://t.co/y3QqJQmv","RT @MichaelHainey: Who doesn't love happy hour at a Linate airport bar? #mfw http://t.co/PqE8rCe5","This just in: the full Ports 1961 men’s Fall 2012 collection direct from #mfw http://t.co/JmghPeqf @Ports1961","RT @GQMagazine: Michelle Williams covers our February issue. Get the full cover story and photos here http://t.co/IrtXf78U","This just in: the full Dsquared2 men’s Fall 2012 collection direct from #mfw http://t.co/77UO3R7s","This just in: the full Giorgio Armani men’s Fall 2012 collection direct from #mfw http://t.co/b4liwdHj @armani","RT @BrianCoatsBC: Dear co-editor, sorry i put your personal cardigan you left on the counter on an out rack. I'm sure it looks great on you!","RT @MichaelHainey: Was there ever a doubt Bruce Pask would show us how to stay warm in style?  @nytimesstyle http://t.co/qpd44akR","RT @MichaelHainey: Your morning weather report for Milan. Frost on the Ferrari has turned to snow on the Dodge. http://t.co/m6aRJpfT","RT @MichaelHainey: The DSquared show in 25 seconds #mfw @DeanandDan  http://t.co/nG4YV4wy","The BEST Milan fashion season in years! Bravo to all of the brilliant designers. JM","Dean and Dan going back to school for the Fall 2012 show. Ts  http://t.co/0tWKjt5X","RT @MichaelHainey: #youstayclassyMilan Ron Burgundy going strong at ZZegna http://t.co/AKFu0fWZ","Every look from the @versace fall 2012 men's collection: http://t.co/57n9A29M","@jakedavisfilms kicking back -SH http://t.co/JGvPC9ux","RT @GQMagazine Tommy Ton of @JakandJilBlog is snapping the best-dressed men in Milan. See his latest dispatch here http://t.co/nhIkXewb #MFW","Hosting aside, what did you think of Ricky Gervais's burgundy tux at the #GoldenGlobes? http://t.co/VmvQXUQF","Will Arnett's #GoldenGlobes look might have made our best-dressed list with this one style tweak http://t.co/GxhJ6lMS","Greg from @rivieraclothing and Jamie from @stndardedition cold weather ready #capsuleny  http://t.co/I3A2vKE4","Everything about Mark Wahlberg's #GoldenGlobes look worked last night. Everything except... http://t.co/FPFKMOlE","Feeling these dots at @deltoroshoes #capsuleny  http://t.co/Vo1iiNQv","Those are some oranges.. A Milanese dessert delight. Ts  http://t.co/E7uZTuj7",".@ZacharyLevi we loved the midnight blue color of your #GoldenGlobes tux, but what was up with those buttons? http://t.co/WNp14LXS","Joseph Gordon-Levitt knows how to dress with personality. #bestdressed at the Golden Globes http://t.co/2tQ0roQL @hitRECordJoe","RT @ejsamson: They call him \"The Wall.\" http://t.co/hn9eC1Tf","This just in: the full Moschino men’s Fall 2012 collection direct from #mfw http://t.co/lVjBUKXq @Moschinofficial","Prada: \"a stunning collection of austere and perfectly crafted sartorial looks\" - GQ creative director Jim Moore http://t.co/IAaAC94s #mfw","Now stateside, the GQ Eye's @SHotchkissNYC reflects on his first trip out to #pitti http://t.co/58KzuzK6","RT @MichaelHainey: The right way to wear color in the winter... http://t.co/WKppmF9R","RT @MichaelHainey: Uh a photo would help. For what is in store from Tods . Sorry all, pops is still learning how to work the dials here. ...","Ashton Kutcher hasn't looked this good in years. Way to clean up, @aplusk http://t.co/hurl6KEE","Missoni: \"men's at it's best.\" - GQ creative director Jim Moore http://t.co/CvViAtOY #mfw","RT @MichaelHainey: @Versace show from Milan in 28 seconds. Apologies for the darkness. It's all about the \"mood,\" don't you know.  http: ...","This just in: the full Umit Benan men’s Fall 2012 collection direct from #mfw http://t.co/K58nfviE","This just in: the full Alexander McQueen men’s Fall 2012 collection direct from #mfw http://t.co/DYLDprkW @ WorldMcQueen","This just in: the full Canali men’s Fall 2012 collection direct from #mfw http://t.co/oopX5Rvh","Derek from @rivieraclothing and Lawrence from @sartoriallyinc chopping it up backstage #capsuleny  http://t.co/VSAcPA7p","Best-dressed at the #GoldenGlobes: Brad Pitt in @Ferragamo http://t.co/GT81xOiP","Loving this belted wool number from H.W. Carter & Sons #capsuleny  http://t.co/8ODM3PCl","RT @MichaelHainey: Jason Basmajian put together a terrific collection at Brioni. Totally dig the presentation of worlds. photos followin ...","Ferragamo: \"A big success in all categories but the outwear reigned supreme\" - GQ's Jim Moore http://t.co/Gw3qwHql @Ferragamo #mfw","RT @MichaelHainey: Me, thanking Sarah Burton on behalf of men everywhere, for making Pippa's bridesmaid dress. @WorldMcQueen http://t.co ...","Manolo Costa killing it at @capsuleshow #capsuleny  http://t.co/Olxy9nuZ",".@adamlevine thanks for leaving the drop crotch pants at home for the Golden Globes http://t.co/4XhzVVO7 #bestdressed","RT @MichaelHainey: @WorldMcQueen and more. Really dig how Burton combines elegance and manliness. #mfw http://t.co/zbnLzcMZ","RT @MichaelHainey: File this under #sickshoes from @WorldMcQueen http://t.co/R6oQQrnv","Seen at the Palazzo Della Triennale. Ts  http://t.co/8TYsdQVU","Some stylish showgoers - @ryanplett and @rogueterritory #capsuleny  http://t.co/l29FePBc","RT @MichaelHainey: Sarah Burton nails @WorldMcQueen Let's start with this tux. Someone MUST wear this to Oscars. Who is gonna grab it? h ...","We told you, camo is still king for f/w 2012 -SH #capsuleny  http://t.co/CiPV6O0T","A new batch of editors' picks from Milan are up. This @armani coat is a must-have http://t.co/tyQikJay #MFW","This just in: the full Z Zegna men’s Fall 2012 collection direct from #mfw http://t.co/ov9GWHyX","This just in: the full Etro men’s Fall 2012 collection direct from #mfw http://t.co/SFqlqaed","@mattyseebs in winter whites at @capsuleshow - SH #capsuleny  http://t.co/bIN6fxk2","King of the House ish - Ian Velardi down robe. #capsuleny  http://t.co/Kd4n4j9e","Here are the guys that came up just a bit short in the style dept at last night's #GoldenGlobes http://t.co/NnGKJrcM","Shimon Ovadia of @ovadiaandsons getting ready for his close up.  http://t.co/K9Ckv9wn",".@michaelhainey is killing it in Milan. keep the #mfw tweets coming!","RT @MichaelHainey: Guerre representing outside Gucci @Guerreisms http://t.co/BfxoUYgz","@vafashiongirl thank you. yes our list of the 10 best-dressed men at the #GoldenGlobes is now up: http://t.co/kSjk8ebt","The 10 Best-Dressed Men at the Golden Globes http://t.co/kSjk8ebt @goldenglobes #GoldenGlobes","RT @MichaelHainey: And on the subject of blasts, here's @GQJAPAN 's Masafumi Suzuki going up strong today http://t.co/cT8y3Thr","RT @MichaelHainey: #Canali in 39 secs #mfw  http://t.co/5t9DfUbh","This just in: the full Dirk Bikkembergs men’s Fall 2012 collection direct from #mfw http://t.co/32P7eWtw @DirkBikkembergs","This just in: the full Gucci men’s Fall 2012 collection direct from #mfw http://t.co/dRpGe1yp @gucci","Loved this look from the men's Calvin Klein Collection show. New tweed suit with fitted crew neck and white butto http://t.co/bzgQF5PX","RT @BrianCoatsBC: When I'm out in the market it's always nice when my suit matches the showroom furniture. #Friday http://t.co/H2A4mokZ","@capsuleshow lookbook underway - backstage w/ the team #capsuleNY http://t.co/wpAzjHEn","RT @MichaelHainey: Your semi-regular #BeppeBlast . Advice for the day: \"you must stay warm but always look good.\" http://t.co/1AsDIhUo","RT @MichaelHainey: From Milan. #Etro in 23 seconds  http://t.co/vRpLN0HV","RT @MichaelHainey: #girlwatchinginMilan http://t.co/Pi2zdDlj","RT @MichaelHainey: #Gucci show from Milan in 18 seconds  http://t.co/sAh63ap3","Back in NYC early morning for @capsuleshow -SH http://t.co/nAViHcBJ","Etro's fall 2012. Kean's feathers flock together  http://t.co/IQexK3KS","Gucci's grand entrance to their Fall 2012 show. Upside-down tower of roses. Ts  http://t.co/0Su3Rqjh","We've seen this trend in almost every collection from Milan, but are you into it? http://t.co/eLwBKATi #mfw","One more from Milan: The full Calvin Klein men's Fall 2012 collection http://t.co/hN4xk0gy #mfw @CalvinKlein","This just in: The full Moncler Gamme Bleu men's Fall 2012 collection, direct from Milan http://t.co/POAe2c3e @monclerofficial #mfw","Back to #mfw! Here's the full Prada men's Fall 2012 collection, direct from Milan http://t.co/2bm29TLE","The #redcarpet might be over but we'll be rouding up the best (and not so best) from the #GoldenGlobes on @GQMagazine tomorrow.","@ZacharyLevi doing midnight right at the #GoldenGlobes.  We've told you navy is an update on the classic black http://t.co/zH1q8Ydq","Kudos to Duchovny for the shorter shirt collar but would b nice if everything else was in proportion.  A must for #GoldenGlobes & #redcarpet","Here's an advance look at the inspiration behind Z Zegna's Fall 2012 menswear line http://t.co/SxJtbidt @ZegnaUS","First Mila now Jimmy - Its a #MOTY moment at the #GoldenGlobes right now with @JimmyFallon","Our knockout of 2011 @MMilaKunis (http://t.co/jr6qwoyE) brings it in black @Dior at the #GoldenGlobes","Peter Sellers - funny man who dressed seriously well.  Just a point of reference for those comedians on the #redcarpet at the #GoldenGlobes","Shout out to our friends @SimonSpurrHQ for making @JonahHill look first rate at the #GoldenGlobes tonight","Brad Pitt in @Ferragamo at the #GoldenGlobes.  Great evening wear in their Fall 2012 show from today here: http://t.co/Ksb7NhHQ","@PaulaPattonXO looking as good as she did at our exclusive photo shoot (http://t.co/98GwLbiD) at the #GoldenGlobes, with a bit more fabric","Dolce & Gabbana: \"Elegant Italian style makes its comeback.\" GQ creative director Jim Moore http://t.co/IlT76miy #mfw @dolcegabbana","@ZooeyDeschanel, so adorkable with her tuxedo nails at the #GoldenGlobes","Brian Cranston rocking @johnvarvatos and looking good doing it. Unless Walter White needs it, a razor wouldn't have hurt #GoldenGlobes","Is Jesse Tyler Ferguson wearing tails?","Freida Pinto in #Prada - should bf Dev Patel have been on the runway today with these guys http://t.co/oNZzonFu ?","This just in: the full @prada men’s Fall 2012 collection direct from #mfw http://t.co/H1Yz3Dbp","Josh Brolin doesn't look a day over #Goonies in his @dolcegabbana","Exclusive sneak peek: Etro Fall 2012 menswear http://t.co/EmXRuftM #mfw","Say what you will but Adam Levine upgraded big time from this look http://t.co/jF7wbbLv for the #GoldenGlobes tonight.  #dropcrotchfree","#GQ Jan. blue suits model(http://t.co/VmobJCDk) @EwanMcGregor looking sleek in a slim shawl collar tux and tie at tonight's #GoldenGlobes","Not a surprise but Clooney looking classically dapper at the #GoldenGlobes.  Studs are a nice touch too.","Is @rickygervais following Milan's latest trend (see here: http://t.co/K9CMmodI)?Burgundy tux for this evening's #GoldenGlobes","Costume National: \"an inspiring collection\" - GQ creative Director Jim Moore http://t.co/X0SJ8px5 #mfw @CoSTUMENATIONAL","We're covering all the red carpet style at the #GoldenGlobes tonight so stay tuned.  -MS","Two days into #mfw and we're already seeing this major trend emerge: http://t.co/BfnRZwPj","How many celebs can you spot on the Prada runway? http://t.co/C7pjwkOa #mfw","\"Burberry's fall collection was one of Christopher Bailey's all time best\" - GQ's Jim Moore http://t.co/pTfo7tjh #mfw @Burberry","Zegna: \"their best show ever.\" - GQ creative director Jim Moore http://t.co/CCHTP9rj @ZegnaHQ @ZegnaUS #mfw","This is a collection for the urban pioneer: http://t.co/IWfo7iuD @armani","GQ's official editors' picks from Milan http://t.co/t8DoWLY2 @dolcegabbana @Burberry @_NeilBarrett_ @ZegnaHQ @CoSTUMENATIONAL @johnvarvatos","If the Tron arena had a live audience, here's what they'd be wearing: http://t.co/9xR7cHb3","Corneliani: proof that young glamour is back in #menswear http://t.co/FesSbBk0 #MFW #editorspick","Miuccia Prada all smiles backstage at the Prada show.  http://t.co/k5jEg1J3","RT @MichaelHainey: Mr Della Valle at #tods told me he recreated this shoe from his 20s, that it was what he and his pals all wore http:/ ...","RT @MichaelHainey: What #tods has coming your way. http://t.co/J5txp3iL","This just in: the full Trussardi 1911 men’s Fall 2012 collection direct from #mfw http://t.co/yj7r6m5c","This just in: the full Missoni men’s Fall 2012 collection direct from #mfw http://t.co/wQc5bG1e","RT @MichaelHainey: Was someone asking about the #monclerofficial sneakers? http://t.co/37qIvG34","RT @MichaelHainey: #calvinklein in Milan in 18 seconds http://t.co/L7nztfli","RT @MichaelHainey: #monclerofficial http://t.co/mMZaIj2D","RT @MichaelHainey: #monclerofficial the final look. http://t.co/RX1czSu7","RT @sean_fennessey: George Smiley walking the runway at Prada like a boss. http://t.co/Z3SUG6wY","RT @MichaelHainey: #Prada in 30 secs. #garyoldman and #willendefoe incl. http://t.co/AfoWCZe9","Prada look one! http://t.co/VKSKateG","Staging for Prada show. Looks Navajo or Southwest inspired. JM http://t.co/qzz9TwEE","Prada's Fall 2012 runway. Always something special and amazing by Miuccia Prada  http://t.co/clwmGaa8","(null) http://t.co/13ZNLUvH","Waiters taking empty glasses of vino as Prada show is about to begin. JM","RT @MichaelHainey: Pre-game field at #Prada  . Not exactly Lambeau's #frozentundra but it's the best I can do today. http://t.co/0XUBGbHo","@mrbradgoreski You can also check out all the shows here, sir: http://t.co/ibhc0tRe","Want more fashion week scoop? Be sure to follow GQ's official Fashion Tumblr: http://t.co/FY7Ly0qg","VIDEO: The Trussardi men's fall 2012 collection, direct from Milan @TrussardiNews #MFW http://t.co/fHijJsOM","VIDEO: The Missoni men's fall 2012 collection, direct from Milan #MFW\n http://t.co/vpFHUtFx","This just in: the full Bally men’s Fall 2012 collection direct from #mfw http://t.co/5mB40RzE @BALLY_SWISS","RT @MichaelHainey: #youstayclassyMilan Seeing a lot of burgundy on the runways.","This just in: the full Pringle of Scotland men’s Fall 2012 collection direct from #mfw http://t.co/VjfMboMn @PringleScotland","This just in: the full Salvatore Ferragamo men’s Fall 2012 collection direct from #mfw http://t.co/LUQWlkdw @Ferragamo","RT @BrianCoatsBC: \"mmmmm everybody knows a bday party without a dance is like a Betsey Johnson show without her cartwheels.\" @prabalgurung","VIDEO: The Pringle of Scotland men's Fall 2012 finale, direct from Milan #MFW @PringleScotland http://t.co/chN279Pn","VIDEO: The Salvatore Ferragamo men's Fall 2012 finale, direct from Milan. #MFW @Ferragamo http://t.co/Gn0tLqWP","VIDEO: The Bottega Veneta men's fall 2012 finale, direct from Milan. #MFW http://t.co/LgNY8l15","This just in: the full Bottega Veneta men’s Fall 2012 collection direct from #mfw http://t.co/9xR7cHb3","RT @MichaelHainey: Once more, with photo. #streetstylesummit @JakandJilBlog @MISTERMORT http://t.co/yMvC1ssa","RT @MichaelHainey: Oh, and I have the photos to prove it. http://t.co/R3MXSbP9","RT @MichaelHainey: Bottega = stacked heel. Purple. Feel it.","I'm in love! Even the dogs are chic and adorable in Milan. Ts  http://t.co/OiLgOwnf","Dessert please at Bastianello in Milano  http://t.co/aCmGeL2l","Cool bike! Only in Milan. Ts  http://t.co/9pXmbGDE","Buttoned-up and ready to go outside the Bottega Veneta show. Look forward to see what Tomas Maier will present fo http://t.co/NiBbbzRG","This just in: the full Roberto Cavalli men’s Fall 2012 collection direct from #mfw http://t.co/8WxlMOdX @Roberto_Cavalli","This just in: the full Neil Barrett men’s Fall 2012 collection direct from #mfw http://t.co/w8zHKYOL @_NeilBarrett_","This just in: the full John Varvatos men’s Fall 2012 collection direct from #mfw http://t.co/5WUwOECC @johnvarvatos","\"Sharp, artisinal elegance\" is how Angela Missoni describes her upcoming collection: http://t.co/IP1fG2SS","Exclusive sneak peek: The Fall @Ferragamo collection will have \"bold shoulders, crisp silhouette, and ample lapels\": http://t.co/ynRzXCAr","GQ Andrew's digging NPH's tie enough to commit a misdemeanor: http://t.co/K4zQrKDw @ActuallyNPH","We've got an exclusive sneak peak at the Fall 2012 Pringle of Scotland show right here: http://t.co/qQ5fcX1h","This just in: the full Jil Sander men’s Fall 2012 collection direct from #mfw http://t.co/b1Xyo5i8","RT @ejsamson: #ShoePorn at @ZegnaHQ http://t.co/CL8tgC4i #MFW","We've got an exclusive sneak peek at the @Ferragamo Fall 2012 men's collection right here http://t.co/ynRzXCAr #MFW","VIDEO: Neil Barrett Fall 2012 men's collection from Milan @_NeilBarrett_ #MFW http://t.co/bwX9MBPx","RT @MichaelHainey: #trendingatMilan as of Day 1: the coat. All about making a statement, from bombers to duffels to topcoats for work.","The Corneliani vibe: \"This is what Patrick Bateman wears to the apocalypse.\" http://t.co/hasvVrQW #MFW","VIDEO: John Varvatos Fall 2012 men's finale, direct from Milan #MFW @johnvarvatos http://t.co/kQIxBQ9F","This just in: the full Dolce & Gabbana men’s Fall 2012 collection direct from #mfw http://t.co/OE1YCRhM @dolcegabbana","Zegna's cozy cabin.  http://t.co/TZ69TSRM","Did you catch @JakandJilBlog's shot of @kanyewest at #pitti? http://t.co/8w7iYDxP","RT @MichaelHainey: Speaking of champions: All hail #Beppe. Lessons from the master in pattern mixing. And peak lapels. http://t.co/VMQ2NsdM","RT @BrianCoatsBC: when u leave ur coat at work and they label it- make sure to remove b4 u put your coat down in every showroom. #oops h ...","VIDEO: Burberry Fall 2012 men's finale, direct from Milan @Burberry #MFW http://t.co/7eUscc2N","RT @MichaelHainey: Brunello @cucinelli and I had a, uh, face off. http://t.co/URXQ0Sqg","BEHOLD: A life-altering shot of Nick Wooster from Tommy Ton's new batch of street style pics #MFW #legend @nickwooster http://t.co/95DyprT1","RT @MichaelHainey: Just has a quick coffee with Brunello @cucinelli . http://t.co/60nDWgGo","RT @MichaelHainey: My pal Masafumi Suzuki, Ed of @GQJAPAN , bringing his A game. Respect http://t.co/scdMNx9t","Dolce and Gabbana showed their  version of refined elegance Italian style. Dressing up and looking chic is cool again! JM","This just in: the full Costume National men’s collection direct from #mfw http://t.co/KFfqH44n @CoSTUMENATIONAL","Dolce & Gabbana's top it with the seasons must have topcoats  http://t.co/zg5SEs1F","This just in: the full Ermenegildo Zegna men’s collection direct from #mfw http://t.co/AwRqGHJI","This just in: the full Corneliani men’s collection direct from #mfw http://t.co/vQZq0OoA","RT @MichaelHainey: My pal Masafumi Suzuki, editor of @GQJAPAN bringing his A game for Day 1. Respect. http://t.co/gdWlqWHN","http://t.co/6oxOHV91 - Dolce runway show in 30 seconds #mfw","RT @MichaelHainey: Alps at sunrise. Dig. http://t.co/vhgTgolZ","Dark Victory at Costume show! Check out our editor's picks up soon. JM","That's some tasty wrist action. A dressy red strap Ralph Lauren and a bold black Cartier Santos. Love it. Ty's http://t.co/zpovQLEo","Milan shows off to a great start with the best Zegna collection ever! JM","Kicking-off the shows in Milano With Corneliani.  http://t.co/q1ApqIP2","First Look: Bally Fall 2012 men's collection http://t.co/9dGoGG6K #MFW @BALLY_SWISS","Electric blue resurrects the Internet's favorite cry-baby. Seriously, Dawson looks criminally good here: http://t.co/hodkchAS @vanderjames","Last chance to win a trip to NYC and a Seiko watch on their official FB page: http://t.co/5UUMXftL","RT @dieworkwear: Bunch of great brand reporting by Sean Hotchkiss at GQ http://t.co/cdbaUyUp","Was one sneak peek not enough? Fine, here's an exclusive preview of John Varvatos Fall 2012 men's http://t.co/aeAuQIvW @johnvarvatos","Here's your exclusive sneak peek at the Roberto Cavalli men's Fall 2012 collection http://t.co/ozm9PriN @Roberto_Cavalli #MFW","RT @MichaelHainey: Not a betting man, but I'm guessing this cover line will never get duplicated on GQ. Thanks @Cosmo! http://t.co/RsJ9FVbR","RT @richardblandino: Australian Beauty Nicole Trunfio: http://t.co/qdX3TAxj #go-see-of-the-week","cc @parkandbond RT @MichaelHainey Apparently The Man decided I was too hot for GQ's twitter. Something about #girlwatchinginMilan.","Loud and clear, sir. RT @MichaelHainey People of Earth: is this microphone working?","The Pitti Report: GQ's Jim Moore, Ted Stafford, and Justin Doss show their 15 favorite Fall 2012 trends from Florence: http://t.co/Yb51UGCK",".@seanfennessey enters the red sock/brown wingtip warz with McNastys. Watch out @ejsamson + @mattyseebs #GQofficestyle http://t.co/NJHxGfMM","The perfect pack: How does Tommy Ton prepare to match the most stylish men in Milan and Paris? http://t.co/GqtgZ1Nl @JakandJilBlog","Before award season begins, we recommend the stars—and you—consult our guide to the Dos and Don'ts of red carpet style: http://t.co/XJ2qNwSw","The Week in Style: The week that Ewan felt fashion-y, Darren felt blue, and we felt envy for NPH's tie. http://t.co/F8r9gwlZ","Check out all of Tommy Ton's street style photos from the stylish scene at Pitti Uomo in Florence: http://t.co/95DyprT1 @JakandJilBlog","It was one of the best Pitti Uomo shows  in years. Check out our Editors Picks to see some of our favorite finds. JM","Finished Pitti Uomo and heading to Milano. Getting excited for the start of the runway shows and a new season of cool fall clothes! JM","Coolest honey holder seen at Pitti Uomo. Very Murakami sez Jim Moore http://t.co/VKwjUJCW","Italians are masters at mixing 16th century architecture with 21st century technology--Valentino fashion show. JM http://t.co/djMWJl4D","Now that's a high-fashion hood ornament! JM http://t.co/7COX1DL2","Keeping it floral in Florence...  http://t.co/WHmqtjCf","Friday morning in Florence - SH #pitti  http://t.co/tay3eAC1","Tobacco soap from Florence's Santa Maria Novella, Italy's oldest pharmacy. Euphoric smell. Run, don't walk! JM http://t.co/ezYBundS","True or false: this dude is Instagrammin' a photo of his socks http://t.co/93hOtnYm #pitti","You've already swagger-jacked your grandfather's sweaters. Try dressing down your suit by donning his fishing hat, too: http://t.co/DfYt2Rck","Just trying to keep up with these Italians... -SH #pitti  http://t.co/2kYbNwFA","Sid Mashburn swung by to chat with the GQ team, and he's happy that \"that Lower East Side thing is finally gone.\" http://t.co/ahk0fGZU...","RT @BrianCoatsBC: So I guess the gold statue people do take breaks sometimes. I would chain that broom down though. #uneverknow http://t ...","Starting the day w/ Brunello is like waking up next to a supermodel... you know the rest of the day won't suck: http://t.co/a4Syr5QQ #pitti","The Webster...and many more fun SHOPS...at a Target near you - http://t.co/UEZvETRU – LL","Think of these as the new dirty dozen: twelve tweaks for 2012 that will make your wardrobe spring into, well, spring: http://t.co/DfYt2Rck","Cool punkt clocks. A little sleek design mix in with all the sartorial sweetness http://t.co/nkZ5JX6T","How to layer with style and ease. Love the blue mixed with the tweed coat. Ts  http://t.co/fyIoAIVe","One to watch: Lotta Chelsea boots out here... #pitti - SH","Thom Browne and loden? Match made in sart heaven #pitti  http://t.co/NXYT2fK3","Coolest dopp kit in the world? From @brooksbrothers black fleece - SH http://t.co/l5t41AEG","Yes that's a dude chipping at the Piatto booth - golf in 2012?#pitti -SH http://t.co/8CEnj7Nk","It's a shirt season #pitti  http://t.co/m84v7d2K","Brotherly love, Italian elbows #pitti - SH http://t.co/GTC72LTZ","\"More refined, less chunky is feeling new\" - Jim Moore http://t.co/E9D05vbV","\"old man fabrics feeling fresh again\" is our consensus over here #pitti http://t.co/f5s6LvHr","Italian feet... Don't try this at home. -SH http://t.co/HqzXDIsH","Brunello and Jim talk shop - SH http://t.co/ERXx9REp","That's some big purple jean at Jeckerson  http://t.co/8XKgcdrE","Just posted a photo http://t.co/ybIPtGCo","Good morning, Florence! JM http://t.co/0IQTO6y4","Yes folks we are in Florence! JM http://t.co/lAqXEWjy","RT @BrianCoatsBC My office just got a bit cloudy and foreboding thanks to @EricRayDavidson . #radphoto pic.twitter.com/mnCtcW7T mad clouds","This just in: the full men's Valentino collection direct from #pitti http://t.co/zI8Legsd @MaisonValentino","\"Today was a good day.\" - @JakandJilBlog - good news for everyone out there that loves street style - SH #Pitti","Valentino models - backstage snap part II  http://t.co/FT6Loqcw","Valentino models - backstage snap http://t.co/ARcYdV15","Coming soon. RT @ParkandBond We are eagerly awaiting the FW12 installment of @GQMagazine MH's Girl Watching franchise.","We always liked French clothes, we just weren't sure we liked the French. In AMI, there's a reason to love both: http://t.co/7dPd06KF","Coolest backstage venue in the world? Palazzo Corsini. Drinks anyone? http://t.co/VB7FIBpR","JD in black and white post Valentino, pre-dinner. Game on.  http://t.co/PIs49yPk","Take time to check-out the Gucci museo. An amazingly awesome curated  selection of vintage Gucci pieces. Loved it! TS http://t.co/Unj652KM","Alain - a super fresh feeling line at Flair in Florence - SH http://t.co/336BEzNH","The Inspiration: 30 Rock's Jack Donaghy's back. To dress like the man, use our handy guide to executive style: http://t.co/6CB1GjhK","Power prints Pitti edition: @detailseugene at Valentino - SH","Valentino bringing the digital drama this evening -SH #pitti http://t.co/r4o1g271","Anticipation at the Valentino men's show in Florence. Looking forward to this one. http://t.co/RojcHWWs","The pixel-y scene pre-Valentino. Far left our own Jim Moore chops it up with the @Sartorialist #pitti http://t.co/xZOtoQHb","Now that's a way to make some Extra virgin olive oil - Tuscan style. TS http://t.co/5Ke9abVi","10 Essentials: The chic twins behind WANT Les Essentiels de la Vie tell us their favorite book, blog, and field jacket: http://t.co/zb8DnPoK","Wish strawberries were this good in the U.S. Even in Jan. Italy has delicious fruit. Love the chic presentation too. TS http://t.co/WZMQA7WL","We are cruising on the expressway from Rome to Florence. Hoping to get some great Pitti finds today and tomorrow!","Bag busted so I had to do the dreaded plastic. Well at least it's the color of the season. JM http://t.co/7PP2xBSR","RT @BrianCoatsBC Love the girls @GQfashion giving u a good shoe. @brittanygk @morgankondash cc: @richardblandino pic.twitter.com/weoRstWh","rushing for a 9pm flight, Traffic is stressing me out. Must catch this flight to make the Valentino show at Pitti. Ts http://t.co/Bad4nPHR","Busy week ahead, but feeling well organized and ready for an awesome European adventure  http://t.co/0NDhT1jT","Busy European fashion week ahead... Need to get my tail out the door to make my flight to Florence tonight. Yikes..TS http://t.co/AyIBJqnU","My ankles are ready for Pitti, even if I'm not quite packed yet - SH http://t.co/M9mkyZiR","RT @richardblandino: A @GQMagazine favorite! RT @MarilynAgencyNY Congratulations to @AdrianaLima for reaching 200K followers on her Twit ...","Tommy Ton shoots the details on the owners of @nepenthesNYC, one of the coolest new stores in the world: http://t.co/ljM88u5r @JakandJilBlog","Brunello Cucinelli, one of the best-dressed men in the world, shows us how he prepares for Pitti Uomo in Florence: http://t.co/iXGdbBVt","Deal alert: first time @ParkandBond shoppers get more when they shop with any @AmericanExpress. Go to http://t.co/jzfkoLbg","RT @BrianCoatsBC: @DarrenCriss so happy you're on B'way in NYC- break a leg! Wanna come see your show. BC","These VANE x Sebago Camo Exo-Boots scream \"not another boating chukka\" with their digital-camo uppers. Check them out: http://t.co/kntwVTnK","Your evening shot: Dennis Hopper. \"...Sometimes, in a career, moments are enough.\" http://t.co/vVHRUQ1I","In the rotation: Chester Mox passport cover and slim wallet. @SHotchkissNYC shows his set before jetting to Florence: http://t.co/dGCUadmk","Spotted by Madeline Weeks in Santa Monica: Killer Levi's store w/ vintage tees by Sharon Segal at Fred Segal. Rock on! http://t.co/7fUhPBew","Time's running out to win a trip to NYC and a Seiko watch. What are you waiting for? http://t.co/6940OIAF","GQ Rules Video: Suit Your Shape. What every man needs to know about proportion: http://t.co/GZcpQmXW","As F1 driver Lewis Hamilton shows, you want clothes you can pile on while it's cold, and disassemble once it warms up: http://t.co/aZjVuKDH","Is the cold finally here to stay? We're looking forward to these 5 sleek black boots for the cold months ahead: http://t.co/ehZT5w34","RT @BrianCoatsBC: I got a few looks tonite bringing home my new @A_Ingelmo duffel bag- now I just need a weekend-away invite. http://t.c ...","RT @BrianCoatsBC: @BStyleINC I was just telling a story about shopping with you at Gucci. #ohnohoneyidontdostairs","Everything was going as planned on Ricky Rozay's new mixtape \"Rich Forever,\" until track 6: http://t.co/B7iGCUgK - you do the math...","One man's search for a suit at the San Francisco outpost of Freeman's Sporting Club... the new frontier: http://t.co/d0rDS35V","Guess who is wearing these shoes: A) http://t.co/jAobMFjC B) Your little brother C) Daniel Craig http://t.co/r08921Pu @iamwill","@levis is looking for fresh faces for its 2012 campaign, and all you need is Instagram: http://t.co/WyMVUEas","The most stylish moment in a Best Buy ever, brought to you by Ryan Gosling: http://t.co/HM9J6UEr","Stay warm, look cool: Creative Director Jim Moore and Deputy Editor @MichaelHainey show you how to winterize in style: http://t.co/0sQc3W0p","Week in Style: Ashton gets dressed on his own, Bruno gets graphic, and yet another Gosling moment: http://t.co/QRzGgZTI @aplusk @BrunoMars","If you feel silly applying lip balm, just remember: chapped lips are never a good look. We recommend this: http://t.co/PWuzR38i","What we're putting into heavy rotation right now: this wool vest from Outlier http://t.co/25WwWTsW @Outlier","Style Icon: Jacques Cousteau. You better believe it http://t.co/MrXalhRm #menswear","RT @BrianCoatsBC: If you are shooting and can't find a suede brush these work just fine. #tips http://t.co/O62rs6Of","RT @CJRichardsNYC @briancoatsbc my bike was parked outside the studio RT @CJRichardsNYC: Vroom instagr.am/p/ecCIm/ that would've helped man!","RT @BrianCoatsBC: First shoot of the new year. Models discussing #teabow, premarital sex, and seven deadly sins. What happened to cars a ...","No rhinestones, no crazy pocket flaps... Yes, we're sure these are @truereligion jeans, and they've won us over: http://t.co/xU7wFNUD","Freebie alert: Enter to win a trip to NYC and a Seiko watch on their official FB page: http://t.co/4VPcI3y6","GQ Office Style #12: A red sock and brown brogue battle between @ejsamson and @mattyseebs. Winner: Stalemate. #GQ http://t.co/7kFGCLwk","\"It's not what they say about you, it's what they whisper.\" Sage advice from the always stylish Errol Flynn: http://t.co/s29iQjuM","These @sorelboots could be the sharpest and most unexpected of the season, they're Back in Black: http://t.co/D7ObPH2x - GQ endorsed.","So an attractive woman showed the Tumblr universe a new way to wear a guy's shirt, and then, well, this happened: http://t.co/gPj88Svm -","The post where we reveal the first preview image of @mmcnairy 's F/W 2012 lookbook: http://t.co/mLLDbLlb - feat. steezy old man style","GQ's @therichdale went rogue today and made a strong case for hats in the office. Check it! http://t.co/BMrb751k","We can't decide what's more impressive about Canadian import Joe Fresh: The slick design or the price tag http://t.co/gbXofSan @JoeFresh","It's a shawl bomber, no a varsity jacket... Our editors love this @LEVIS Made & Crafted navy and brown stunner: http://t.co/CgtZJBF6 -","You like your head, right? Treat it to a @Steven_Alan cashmere beanie: http://t.co/S1yZ5zHH - we're kind of obsessed with them","The @buyvansshoes and @DQMNYC General Store in SoHo attracts everyone from skate enthusiasts to sneaker freaks: http://t.co/7TCkGjDk","Must... not... tweet... about... Gosling... whelp, f%$k: http://t.co/7TCkGjDk - damn, he's good.","RT @BrianCoatsBC: You can tell the world is changing when u hear a straight guy call a baby a \"fashionista\" cause of his \"rockin chapeau.\"","Stay ahead of the pack and start shopping for your spring gear now. The first essential? One of these blue suits http://t.co/XGk5HQf8","Ever wonder where Brad Goreski gets his signature glasses from? @MrBradGoreski reveals all in his 10 Essentials http://t.co/woR8RZ6m","Before his @bravotv show premieres, Brad Goreski gave us his list of 10 essentials http://t.co/Dhj8Pswy @MrBradGoreski #BradWorld","RT @BrianCoatsBC: U can tell it's a fancy hotel when they make an origami fan out of the paper towel rack. #chic http://t.co/VxBFPTCE","Scored some extra cash over the holidays? GQ's Jim Moore handpicked the items you should pick up right now http://t.co/TXxIFTlu","RT @BrianCoatsBC: Dear AA attendant w giant red jacket and all black underneath. Thx for bringing back AK2! #louisdellolio @sashacharnin","Get a head start on spring shopping with our picks for the best silk knit ties http://t.co/UADD7xoc","#Menswear tip: Stand out in a sea of blue denim with a pair of gray jeans. Here are our favorites to buy right now http://t.co/QQSv4Z3U","RT @SHotchkissNYC: When Jay-Z said \"I got that hot bitch in my home\" he was talking about the fixture he picked up at @SchoolhouseElec:  ...","RT @BrianCoatsBC: Guy in elevator to girl at Milk studios, \"hey good luck with your face, Happy Holidays!\"","After numerous false alarms, it's finally cold. So bundle up with the GQ 2011 Guide to Outerwear: http://t.co/tgGfxQN6","Your Morning Shot: they don't come any cooler than the The Clash's Paul Simonon: http://t.co/uwxkxCq0","What are your favorite #menswear trends from 2011 that you'll bring over to the New Year? Here's our top 12 for '12 http://t.co/F5TLxzoS","Looking for a New Year's Eve outfit? We got you—the best tux jackets under $400: http://t.co/vZ4Bk82H","When we heard about this new store from the team behind Naked & Famous, it pretty much blew our... well... jeans off. http://t.co/sRhmrAII","RT @SHotchkissNYC: Me and Matty S. call out the trends we're hanging onto for 2012: http://t.co/w8RIwXIf",".@newbalance teamed up with Boston's Bodega, Barcelona's Kilates, Seoul's Kasina, and Tokyo's Mita on NB's 581 model: http://t.co/oJ7cbC0H","The Year in Style, 2011 Edition—killer colored suits, Slayer-concert hair, the cult of Gosling, and everything else: http://t.co/r9lm2LSX","Go shopping with GQ creative director Jim Moore for those post-holiday pick-ups: http://t.co/M9Jb1xtI","We love Epaulet's rifts on the classics, and this navy moleskin cutaway collar overshirt is a perfect example: http://t.co/zJ398n8h","RT @BrianCoatsBC: I used this in high school-that was a few years ago - an mom still has it in a cabinet. @LombardoTreena http://t.co/0S ...","Enter to win a free trip to NYC and a new watch, from your boys at GQ and Seiko http://t.co/XahMlp5B","The 25 Best Menswear Moments of 2011, including Tumblr's takeover and rappers setting a new standard of high fashion: http://t.co/FotTB3IO","The most badass look of 2011, courtesy of Mr. Daniel Craig. http://t.co/47rfLQUp","RT @BrianCoatsBC: Apparently germaphobes run in my family. At least the sign is a festive color. http://t.co/8DxUlf6U","Ryan Gosling, killing it in green (from the best style moments of 2011). http://t.co/YXEhX2aP","The Coolest New Stores of 2011: Take a closer look at some of our favorite new destinations, courtesy of the GQ Eye: http://t.co/h21APF8U","Odin New York has relocated, but they're still stocking their spot-on menswear plus their latest scent, 07 Tanoke: http://t.co/K7WC2cFH","Yo @DwyaneWade, what suit is it gonna be today?","Wanna be the steeziest dude on the slopes this holiday season? Let us introduce Italian brand Duvetica: http://t.co/4mXdgteu","We spoke with UNIONMADE co-founder Todd Barket about demolition and what his customers are buying this holiday season: http://t.co/k7aYHlu3","Your Morning Shot: Yves Saint Laurent. \"Fashions fade, style is eternal.\" http://t.co/knTUSZTk","Robert Pattinson's colored suit makes our list of the best looks of 2011. http://t.co/G9j007WG","Your Morning Shot: John Updike. \"We do survive every moment, after all, except the last one.\" http://t.co/ieObgiwR","No Year in Style recap is complete without @mrbradgoreski. http://t.co/coBwBxQt","Darren Criss' strong suit is dressing like a sporty prepster. We dig it. http://t.co/GegGZqGQ @darrencriss","Year in Style: Andrew Garfield and how to wear a tux. http://t.co/J1jWAsqY @iAndrewGarfield","He perfected brooding in Boardwalk Empire, and now Michael Pitt brings his looks to Prada's Spring 2012 ad campaign: http://t.co/ydaWKrOw","Year in Style: Joe Jonas is damn sly with the layering. http://t.co/2cJM8ZAr","Ben Ferrari's Street Style: The best and boldest bootwear of the season, shot in the wild. http://t.co/LnTEglPW @benferrariPHOTO","How to survive Manhattan holiday shopping. Because while we hope you're not out there, you, like us, probably are: http://t.co/kqsbVeZB","Buying holiday goodies for a Greek shipping heir? Well, you might want to consider MIANSAI's solid gold iPhone case. http://t.co/CoNwuxXK","Stuff We Like: UGG boots. Yes, UGG boots. Hear us out: http://t.co/YcCEX0sR","We hate to give out this award, we really do, but this year's Worst-Dressed Man in the World is Jared Leto: http://t.co/J5oR7vrH @jaredleto","Stuff We Like: Bedwin and the Heartbreakers at Odin, from the mind of designer Masafumi Watanabe. http://t.co/L2vK3N1R","Your Morning Shot: Stuart Sutcliffe. http://t.co/UdQ1J9HR","@LuckyMagazine fun post ladies, but @SHotchkissNYC: this pose? (http://t.co/D8o6ARWf) NAGL, bro","Year in Style: Three young guys with the best style this year, including Joe Jonas, Darren Criss, and Andrew Garfield. http://t.co/v9SCHYpH","David Beckham and the art of the Red Carpet pose. http://t.co/NxcIyKIh","RT @BrianCoatsBC: No one wraps a rad watch like @WattsUpPhoto. #shhhhh #MerryChristmas http://t.co/qaZv19kJ","Robot Stallone has been sent back in time to stop himself from making The Expendables. He was too late. http://t.co/B9kJ31gW","Don't experiment with manlights, like Rob Lowe did. http://t.co/I91BIK0L @RobLowe","Last-minute gift ideas http://t.co/GbdAm2lR (Here's one for the lady: Burberry Body fragrance: http://t.co/fOuhRjo5)","Derek Blasberg took a break from teaching women how to be classy to give us his 10 personal essentials http://t.co/9rwcVLNu @derekblasberg","#menswear obsessives take note: These are the best new stores of 2011 http://t.co/gVWe1Izv","Year in Style: Patrick Dempsey, with women literally hanging off of him. http://t.co/4cutycLc","Year in Style moment: Penn Badgley's post-gym, perfect hair. http://t.co/aHm5FmID","Year in Style: Al Pacino needs help finding his cell phone. http://t.co/GjMtSwAy","Our recap of a year in David Arquette's street style. http://t.co/bLDZK1AD @davidarquette","Nick Wooster dresses up as Santa. That is all. http://t.co/mXr509p9 @NickWooster","Rob Lowe makes our Best Moments of 2011 in the Year in Style recap. http://t.co/vt2JRHtB @roblowe","Don't rent an ill-fitting tux for NYE. We found these affordable tuxedo jackets to wear when ringing in the New Year http://t.co/O1dUFfOr","RT @BrianCoatsBC: Merry Christmas @GQfashion. Party at bkn bowl enjoy the salad! #verycondexmas http://t.co/8letTHYX","We got Nick Wooster to give us his holiday wish list. We also got him to wear a Santa hat http://t.co/mXr509p9 @NickWooster","Year in Style: Mark Ronson earned the fluffy bow tie look. http://t.co/VNnbjXDT @iammarkronson","Best Dressed of the Year: Common, pattern-mixing like crazy, and pulling it off. http://t.co/E9BcJ37B @common","RT @GQMagazine Bonus pix from our sexy shoot with Mission Impossible star Paula Patton http://t.co/eAVoijGo @PaulaPattonXO","Anderson Cooper and a llama made our Year in Style slideshow. http://t.co/NRuLPLtk @andersooncooper","Our editors played \"Caption This\" with our favorite Al Pacino moments of 2011. http://t.co/i9npAgEK","VIDEO: Paula Patton strips down for her GQ shoot. @robinthicke you are one lucky man. http://t.co/xARDQNlo","One of our favorite moments of Year in Style, featuring @SarahKSilverman and @RainnWilson. http://t.co/PSTIq1Yy","RT @BrianCoatsBC: Dear girl in front of me walk/texting. At least you are moving fast in a good heel. #approved!","Want to visit New York City? Check out the Seiko + GQ Sweepstakes on Seiko's FB page.  Enter to win, and a new watch! http://t.co/AZQrR5wn","Year in Street Style: Don't model your hairstyle after your favorite Sega Genesis game. (cc: @jaredleto) http://t.co/O7KNVzX2","Is Russell Brand a giant? Or is that man just very small? http://t.co/aFcDqEHr @rustyrockets","Proof that there is such a thing as too much gray in your wardrobe http://t.co/XXUd9Ng5","Who else but David Beckham to kill it in the season's biggest trend? http://t.co/GbrL9HBq","Chris Colfer looking trim, neat, and understated. Keep it up, kid http://t.co/b8w1lMaJ @chriscolfer","Why so sad, Lenny Kravitz? http://t.co/No2nvJoP","@JakandJilBlog went H.A.M. with these onstage photos of Kanye West and Jay-Z's Watch the Throne tour at MSG: http://t.co/LyDEcWVE","We had no idea Colin Farrell was able to look this put together. We like it http://t.co/Pjwy8m05","Josh Duhamel and Fergie? Notsomuch. http://t.co/Y60l1Qfc","Brad and Angelina show the right way to match your outfit to your date's http://t.co/Cx1IwJwi","Nick Offerman of #parksandrec proves that it is possible to look put together and  uncomfortable at the same time http://t.co/LtpqfL1W","Chris Paul had the right idea with this knit tie, but a quadruple (or was it quintuple) windsor? 'nice try bro?' http://t.co/AdDUJGUR","Robert Downey Jr in paint-dipped sneakers? RDJ wins Biggest Balls of the Week http://t.co/le4C9Kay","Looking for a last-minute holiday gift? Try these affordable yet super stylish watches, all under 200 bucks http://t.co/cUzbzhcq","Just a friendly reminder that there are only three days left to shop the GQ at Park & Bond pop-up shop here in NYC: http://t.co/sktwXgr7","Your evening shot: Anthony Perkins from GQ, December 1967, page 111: http://t.co/X9gn52PJ","Self Edge is a friendly shop. It's also a knowledgeable one: they know a hell of a lot more about denim than you or I: http://t.co/AkEsZ3Ji","We'd say straighten the tie, but w/ matching gloves, shirt, and checks, that shit was definitely intentional: http://t.co/Fj72tOpT @iamwill","If you're looking for Christmas gifts or for an affordable yet stylish timepiece, check out this GQ-approved batch: http://t.co/TTONIz9X","Week in Style: Colin Farrell pulled himself together and Robert Downey Jr. proved, yet again, he's got giant balls: http://t.co/dfpCyvLw","Enter to win a free trip to NYC and a @seikowatches watch on their official FB page http://t.co/XahMlp5B","These kicks are perfomance-driven but not so tricked-out that they venture into Spider-Man costume territory: http://t.co/tVkpQzUl","In continuing to up the style ante south of your hems, we're shouting out these colorful shoe laces from Stolen Riches: http://t.co/MQ9ogyx4","Your Morning Shot: Michael Caine. http://t.co/1XiTqZdV","RT @BrianCoatsBC: time to run now...or at least the gym Sneaker of the Week: Adidas H3LIUM ZXZ: The GQ Eye: GQ http://t.co/UsnjXw6c via  ...","Here's an odd Year in Style photo of Alec Baldwin wearing zip-off pants. http://t.co/zNym9YZ4","RT @richardblandino: Hey @TysonCBeckford you are a lucky man!  Go-See of the Week: Shanina Shaik: The GQ Eye: GQ http://t.co/BiUaaK2n vi ...","Year in Style moments: Ashton Kutcher and Demi Moore, RIP. http://t.co/7xs4cGdT @mrskutcher","2011 Menswear Moments: We got drunk on Boardwalk Empire's wardrobe: http://t.co/dsAF4gwS","Menswear Moments: Aaron Levine gives @ClubMonaco street cred, and everything @acontinuouslean touches turns to gold: http://t.co/NzdoZXzq","Year in Style moment: Is Pete Wentz playing with himself? You decide. http://t.co/VHoVVz9N @petewentz","RT @BrianCoatsBC: overheard in the Conde Caf- \"You look stunning today!\" \"Thanks honey I Feel stunning today!\" #atleastshespositive","2011 menswear moment #5: Gosling became so effortlessly cool we had no choice but to begrudgingly send dap his way. http://t.co/uKlibVrC","What's your favorite #Menswear Moment of 2011? We came up with 25: http://t.co/r5eVnvIi","Our favorite thing about Joshua Jackson is... Diane Kruger. http://t.co/TtIOukiP","Year in Style Moment: Robert Pattinson probably whispering something dirty into Reese Witherspoon's ear. http://t.co/IwZYOtWe","\"I'm not a blogger... I am a full-time gangster who goes where the paper is.\" —Fuck Yeah Menswear http://t.co/xk8Zzc46","Our writer visits No10_Showroom in Paris, an incubator of emerging fashion talent. http://t.co/NmvADmt2","Get your wallets ready: Wolverine 1000 Mile x Leffot NYC's boot auction is here. http://t.co/0UlYn6ON","\"I find it most validating when I see my photos go on Tumblr.\" — Tommy Ton of @JakandJilBlog gages his success. http://t.co/xk8Zzc46","Levi's and Filson team up for a very All-American look that we love wearing right now. http://t.co/zccS4NcQ","The Street Style photos where we're distracted by the hot girl next to the guy. http://t.co/AwBLNvHp @johnlegend @chrissyteigen","Odin debuts new scent '07 Tanoke,' inspired by coastal California landscapes. http://t.co/RZszFleg","GQ presents: an Oral History of Menswear, from @TheSartorialist to @MisterMort. http://t.co/xk8Zzc46","We meet the man behind Uniqlo, who truly believes his clothes are 'made for all.' http://t.co/SlJf7EQh","\"Men's fashion doesn't move as fast. Men's is more about subtlety and the fit.\" — @TheSartorialist on menswear http://t.co/xk8Zzc46","EMM Group, the new kings of New York nightlife, reveal the things they can't live without. http://t.co/SvFHRZEe","Tommy Ton captures the street style of Union Los Angeles, \"the coolest store in the world.\" http://t.co/TIzCHahs @jakandjilblog","Our creative director picks the things you need to buy now, all at @ParkandBond. http://t.co/rpSs2D7m","Rules of Street Style: People will always take pictures if you wear a see-through blouse. @jaredleto http://t.co/grkQPtWr","What stage show do we mention in the @Bonobos Gift Guide? 1st 50 ppl 2 guess get 30% off. More info: http://t.co/IA65cKDe #SecretCode","Calling all LA readers: GQ photog @ericraydavidson is exhibiting his masterful #NYFW photos in your 'hood. Check it: http://t.co/kqYPH3xl","Meet the most schizophrenic, but insanely practical shirt ever: this club collar beast from Ledbury's http://t.co/TwBpwVy2","Two of the sweetest sartorial joints in London: Trunk and Albam. Don't know 'em yet? Get acquainted: http://t.co/QE5QlQgq @albamclothing","RT @GQMagazine GQ meets the man behind clothing giant UNIQLO, Tadashi Yanai http://t.co/SlJf7EQh @UNIQLO_JP @UniqloUSA","GQ Office Style #12: @markwby officially enters the office style warz with this fly Howlin' by Morrison fair isle http://t.co/llzJGXiR","Chris Pine, we hereby award you and this outfit with \"Best Off-Duty Famous Person Look\": http://t.co/B2HTWgnW #shawlcollarvictory","Rules of Street Style: Don't wear pants worn by Benihana hostesses. http://t.co/EiTHsG4G (cc @alancumming)","Here's how our new hire @MattySeebs stepped up his office style game: a ballerific Italian leather bag from @coach http://t.co/q0z0MHhU","How many of Russell Brand's clothes came from the girl's section of Forever21? We calculate. http://t.co/XdsemvJ0 @rustyrockets","Matt Damon sports @bandofoutsiders @ClubMonaco @CalvinKlein @Converse in his GQ cover shoot. See the photos here http://t.co/OAzL7SRC","Re: our Lambert tweet, we were thoughtless and apologize. We\nshouldn't make stupid jokes about people's testosterone. As always, we\nlearn.","Promotion: How do you wear your Brooks Brothers? Shoot a pic to promotions@gq.com and you could win extra cash for your holiday shopping","Each month the editors pick items from the issue and make them available at @ParkandBond. Here's what we chose for Jan http://t.co/oZmyTFhM","An oral history of #menswear blogging, told by the pioneers http://t.co/xk8Zzc46 @acontinuouslean @JesseThorn @Sartorialist @JakandJilBlog","Now presenting our January cover star: Matt Damon http://t.co/Gzu8QEo0","RT @BrianCoatsBC: Behind the scenes @GQMagazine- the gorgeous @jodiebolandmkup hard at work on ankle tanning. #goodskills  http://t.co/g ...","Did you see CeeLo's outfit in this picture? No, neither did we. http://t.co/Y7Xdg0jL @ceelogreen @amberheard","Rules of Street Style: Don't wear fishermen's waders out of the water. http://t.co/NHpS2fxn @lennykravitz","Rules of Street Style: invest in a good tailor. That means you, Adam Sandler. http://t.co/hbPSu6d6 @adamsandler","Year in Style: Adam Scott makes our favorite looks of 2011. http://t.co/e3w5qZdd @mradamscott","Year in Style: If you wear a past-the-knee trench, you'll look like you're about to flash your weiner. http://t.co/lCJOeXIz (cc: Jared Leto)","The bandana as pocket square: a look nabbed from behind-the-scenes of a GQ photoshoot. http://t.co/IlVai651","A Harris Tweed Motorcycle Jacket, made for the most interesting man in the world. http://t.co/pMzZkKuW","Holiday shopping not done yet? That's what the MoMA shop is for. http://t.co/wM4oZFSZ","This year, we mourned the loss of Robert Pattinson's hair. http://t.co/L0emEgRW","As if we didn't like them enough, Shipley & Halmos now have chocolate bars. http://t.co/qfvw0MF0 @shipley_halmos","Our editor selects the latest Watch of the Week. http://t.co/AnnoC5iN","Scientology and stunning sartorialism. A behind-the-scenes look at 'The Master' with Joaquin Phoenix. http://t.co/hfpKEbKM","Deal alert: first time @ParkandBond shoppers earn more when shopping with their @AmericanExpress. http://t.co/jzfkoLbg","GQ office style, courtesy of our one-and-only deputy editor, Michael Hainey. http://t.co/mdS9Nipc","Our weekly style recap shows our favorite guys (Harry Shum Jr., Jon Hamm, David Beckham) turning up the contrast. http://t.co/wx2lVvEP","\"My father used to say, 'Let them see you and not the suit. That should be secondary.\"—Cary Grant http://t.co/YdQfud7y","Say what you will about the man's work, but @RyanSeacrest is a champ when it comes to black-tie dressing: http://t.co/LNdSNfbB","A stylish medicine ball is a real thing. http://t.co/PowytmC1 #GQBestStuff","For the best-dressed guy on the field: a Warholian baseball bat. http://t.co/2dEh48nx #GQBestStuff","Rapper Wale on wearing a Tiffany blue crocodile backpack: http://t.co/1hu6zAbp #GQBestStuff","Wherever the after-party is, Mark Ronson's DJing it: http://t.co/uZVngNua @iamMarkRonson","Whether in the park or on the pavement, you'll get some serious yardage out of these sweaters from @TheBKcircus: http://t.co/kObMwBPo","GQ's @ejsamson and @SHotchkissNYC gave @Fashionista_com their holiday wish list. Please fwd to Santa: http://t.co/rhl0HoQF","Check out these ties from style jack-of-all-trades Brett Fahlgren at Bloomingdale's: http://t.co/VdR0buaN","This just in: GQ favorite Confederacy opens their second store in LA. http://t.co/wkaWum0T","Mashburn and a bunch of friends made a color they're calling \"Optical Bright Fluorescent Yellow GN.\" Get the Nylites: http://t.co/w1iOp4rf","Stash your passport without looking like a tourist. http://t.co/tGOIHGse #GQBestStuff","Your afternoon shot: JFK in a convertible in summer. http://t.co/Bwhf5pDg","Give winter the fingers—wear these fingerless gloves: http://t.co/oDWO3Tt4","RT @BrianCoatsBC: “@richardblandino: Just caught @TheEllenShow spying on me and @BrianCoatsBC in an editorial meeting! #shhhhh http://t. ...","Check out Calvin Klein men’s fragrances at GQ at Park & Bond pop-up store. 414 W. 14th St. 12/8-12/18, 11am-6pm. http://t.co/vGwrgNXa","Here, some excuses to buy a $520 ashtray (even if you're not a smoker!). http://t.co/LVWUoqaM #GQBestStuff","Katy looks so cute here that we barely noticed the stupid, six-foot-long chain on her husband: http://t.co/IrtKdrrW @rustyrockets @katyperry","The Week in Style: The week David Beckham, Jon Hamm, and Harry Shum Jr. turned up the contrast. http://t.co/wx2lVvEP","The unflashy, unchunky, unexpensive, but still strapping, watch. http://t.co/lKevXCyh #GQBestStuff","At the end of the day we love to relax, and burn one down. Ya know, a nice, street-legal, MALIN+GOETZ Cannabis candle. http://t.co/CQYNrk3B","A maroon tuxedo, and 24 other great Ryan Gosling moments of 2011. http://t.co/L1feIHrA","Life lessons from The New York City Beard Competition: make sure your beard doesn't stink. http://t.co/amWQ5f0l","The GQ at Park & Bond Pop-Up holiday shop is a dream destination for well-dressed men. Get the details—and a tour—here: http://t.co/CmPcAB0w","GQ Office Style: Senior Editor Will Welch dominates the black-on-black-on-black look. http://t.co/JQyB22Eu @willwelch","Go-See of the Week: Zuzana Gregorova. Don't let the good looks fool you—this girl is bad-ass. http://t.co/hwMQzq9I","Visit the @ParkandBond store & get a gift w/a $100+ purchase when shopping with any @AmericanExpress Card. 414 W 14th NYC thru 12/18","Your afternoon shot: Bob Dylan, on a motorcycle, telling you how to be a successful man: http://t.co/ooAXXyDv","No joke, graphic sweaters have never looked better. The guys from The Lonely Island show how it's done http://t.co/GOshD27V @lonleyislandnew","@AdrianaLima did you know you're Kate Upton's favorite model? http://t.co/nI98xpXe Don't make us choose. @models @Modelinia @cutblog","RT @richardblandino: Hey @KateUpton did you that you're http://t.co/zqMPEFFl's BODY OF THE YEAR?\n#models #GQ\nhttp://t.co/oUM492NE","We threw a party with @parkandbond last night to celebrate the opening of our Pop-Up Shop, @NickWooster gave us a tour: http://t.co/CmPcAB0w","Chef Sean Brock is a devotee of @billy_reid. You should be, too. http://t.co/sfFzihdg #GQBestStuff","The GQ/Park&Bond pop-up store in NYC is off the hook! It is one stop shopping for EVERY man. I promise. Run don’t walk!!! -JM","RT @GQMagazine Meet our Body of the Year: Sexy supermodel Kate Upton http://t.co/gWgt4vYZ @KateUpton","A step ladder you won't want to store. http://t.co/S2pGewMS #GQBestStuff","You know, extension cords don't have to be ugly. http://t.co/67lgucDk #GQBestStuff","Photographer Ryan McGinely exclusively burns the Santal 26 candles by Le Labo. http://t.co/RqwXd1CD #GQBestStuff","Gosling and Eva Mendes seem like a nice match. If you were building a Winners of the Human Gene Pool fantasy league. http://t.co/PQgvj36b","Spotted: Chace Crawford and @BrianCoatsBC at the GQ at @parkandbond pop up shop http://t.co/XGD9ZjKG","Deal of the day at the GQ/Park & Bond pop-up shop. 45 bucks for this sartorially sweet tie bar combo - TS http://t.co/ktnuP4eg","RT @therichdale: that moment when u are staring at someones weird glittery shirt and they think you are checking them out. -AR","got a david hart blue plaid tie obsession brewing deep in my soul. - AR http://t.co/g3VfkQza","Ryan Gosling's comparisons to Steve McQueen more realistic when he was snapped wearing this outfit. http://t.co/NBah6x7o @gucciofficial","Rugged bare-bulb style is cool, especially when you add personality to the look. http://t.co/rGwL710E #GQBestStuff","Alejandro Ingelmo wins the Best Duffle Bag of the Year. For this year and 2023. http://t.co/yXhni9am #GQBestStuff","Unvarnished industrial-chic for your home, all in this killer chair. http://t.co/X9fm1ZWI #GQBestStuff","George Clooney is in dire need of some new denim. http://t.co/mQqodwsK","Wondering how to pull off brogues? Let a GQ contributor show you how in our latest segment of Office Style. http://t.co/Wx50HdiS","Satchels for dudes? It's a thing, according to Jerome Dreyfuss. http://t.co/dQl0SjPT","Lapo Elkann, leaving his silver Mercedes in the West Village. The life. http://t.co/GzmvXymd","Attention all you lucky New Yorkers: the GQ and @ParkandBond pop-up shop launches tomorrow. http://t.co/Sx9jmD6z","The GQ Eye discovered the craziest backpack in the game. http://t.co/b1V82KIj","Malin + Goetz and Gant in Maine? Yes, it's true. http://t.co/KgJRdrH8 @portlanddrygood @malinandgoetz","We document Jonah Hill's dramatic style evolution. http://t.co/sDYvQpK3","Our Stud of the Year, Peter Dinklage, serves up this morning's style inspiration. http://t.co/DyqQdtqr","Gosling, Kimmel, and a ukulele. Plus, a YouTube commenter's reaction: \"My vagina just exploded!\" http://t.co/wN1jamio @jimmykimmel","Odin owner Eddy Chai reveals his best get of the year http://t.co/0ijx8UOd #GQBestStuff","Our watch of the year is unflashy, unchunky, and unexpensive http://t.co/lKevXCyh #gqbeststuff","Tortoiseshell glasses and a tank top: only stylish if you're Ryan Gosling. http://t.co/9ux03rXz","This Alejandro Ingelmo duffel has us looking forward to our first interstellar vacation. http://t.co/yXhni9am @A_Ingelmo #beststuff","VIDEO: Who better to pose with our Stud of the Year Peter Dinklage than a bunch of lingerie models? You're welcome http://t.co/QgQT87Sx","VIDEO: Watch NBA dunkers @blakegriffin @russwest44 @mindofAI9 @ShannonBrown in action at their GQ photo shoot http://t.co/4wh1k0Gb","RT @GQMagazine The wait is over. We now present to you The Best Stuff of the Year: 2011 Edition http://t.co/3qDlW4zj","Ryan Gosling started 2011 with a great style moment: the January cover of GQ. http://t.co/fNHZbsl5","It'd be waterworks if we lost this amazing Black Watch/orange umbrella from @acontinuouslean and London Undercover: http://t.co/jMIpxSJN","Ryan Gosling's best moments of the year, including that time he wore a pajama shirt to Cannes (and killed it). http://t.co/JD9X5hDP","These APC bags are the perfect holiday gift. http://t.co/DFfl9CTs","RT @GQMagazine Beard Award winner and restauranteur Rob Evans dishes on the best places in Portland, Maine. http://t.co/qs2gyL1o","\"It's like you're Photoshopped!\" and other great Ryan Gosling moments from 2011. http://t.co/9fTPdTMA","Street style looks from this weekend's Pop-Up Flea in Manhattan. http://t.co/ZQilR9zs","Buffalo plaid accessories, including this bag from @JackSpade, are everywhere this season. http://t.co/K9hwJ2nw","GQ's official guide to Ryan Gosling's 25 greatest style moments of 2011. http://t.co/fkIneSZX","European-sartorial-commuter-biking fantasies: fulfilled. http://t.co/KexlrMqZ @needsupply","Justified's Timothy Olyphant proves buffalo plaid has a new sophistication. http://t.co/ZfnCIaUn @olyphantastic","Classic wingtip brogues you don't have to break in, courtesy of @VintageShoeCo. http://t.co/nvrqJATi","A sartorial stocking stuffer: O'MAST: The Documentary, which delves into the lives of Naples' famous tailors. http://t.co/5NNTObJf","Deft pattern-mixing, perfectly tailored suit, well-coiffed hair—Adam Scott has mastered the GQ look. http://t.co/Q8tWnr3z @mradamscott","Andre Saraiva has officially visited BLK DNM: http://t.co/K0lSn7hJ","Check out the new @BespokenNYC bar exclusively at #ODIN http://t.co/rl3b8Q5i","\"Well, don't you look like fun.\"—what we hope the David said when he met this femalian creature. http://t.co/PcLiDmM0 @davidarquette","Couple style done right: Jesse Tyler Ferguson's bow tie references his boo's shirt without going overboard http://t.co/fExPwF4C @jessetyler","This is the look GQ's @therichdale would most like to steal from this week's Week in Style: http://t.co/uGnLcxN6 @mrbradgoreski","Congratulations @adamlambert: You're a funnel-shaped hat away from being the Tin Man impersonator in Times Square. http://t.co/YnSD11dB","Stop by Michael Williams and Randy Goldberg's \"dream store for a few days,\" the 4th Annual Pop-Up Flea, starting now: http://t.co/tpQemSMJ","It may be (finally) getting cold, but that isn't keeping these men from looking their best: http://t.co/QCf0UgIj","Proving the equation that menswear + Victoria's Secret models = winning combination: http://t.co/nOf9l6qN","Sneaker of the Week: Vans x Spitfire Era Pro—the feel of a saddle shoe, and just the right amount of SoCal attitude: http://t.co/xwVqpZV7","The Week in Style: Adam Scott killed it, Snoop showcased his Jedi skillz, and Bieber wallowed in manhood purgatory: http://t.co/6uDbCaNq","BLK DNM's Johan Lindeberg on Perfume 11: \"It feels like the new 1968, when new values were being created all over...\" http://t.co/T5aFlpNw","GQ Office Style #8: @ejsamson conquering the world with this John Varvatos chukka boot and striped H&M sock combo http://t.co/IhLwd45u","That lady who plays \"Jill\" on Jack and Jill made it on our list of the Five Worst-Dressed Men of the Month: http://t.co/ciP3sZIg","Your Morning Shot: Christopher Walken. http://t.co/7KO15aFQ","RT @BrianCoatsBC: love these-Sneaker of the Week: Vans x Spitfire Era Pro: The GQ Eye: GQ http://t.co/PD4tn0RM via @gqmagazine","RT @hipenfold: Clean up or miss a flight #imsorryfengshui","What animal would Jean-Ralphio of #parksandrec wear to the Oscars? Lady Gaga http://t.co/bzE1Cf8V @rejectedjokes @ladygaga @parksandrecnbc","True scene: two 20ish guys talking on 43rd St. in NYC: \"Dude, my grandma's outta town for a week. Do the math.\" A high-five is exchanged. MH","Adam Sandler unfortunately demonstrates why every man needs a tailor http://t.co/U9A90bWX","#menswear tip: not all broken-in leather jackets are created equal. Just look at Mel Gibson http://t.co/rO96BTca","Is that Rupert Grint or a Cougar Town cast member? http://t.co/ZAcv61oC @rupertgrintnet @Rupert_Grint_Us","Your Afternoon Shot: Christopher Walken really just wants to hold hands and sing: http://t.co/7KO15aFQ","Take a last look at November with our list of the 5 Worst-Dressed Men of the Month http://t.co/ZAcv61oC #menswear","That cologne your high school girlfriend gave you doesn't cut it anymore. Here's how to upgrade your scent http://t.co/Rn1ZuaSD",".@ComplexMag lists the '10 Types of Men's Style Bloggers,' including our very own GQ Eye. http://t.co/0J9dGygR","Who has more swag, Drake or Kanye? You choose. http://t.co/EBCtYRXo @Drake @kanyewest","This just in: a unisex fragrance by @shipley_halmos and @DSandDURGA. http://t.co/4mDJcY9u","How do you wear your Brooks Brothers? Shoot us a pic at promotions@gq.com to win some Holiday cash to complete your signature look.","What's Erin Heatherton's real last name? It's all too appropriate for this Victoria's Secret goddess. http://t.co/BvRu0vpq @erinheatherton","The LA Lakers' Shannon Brown makes the grey suit and saddle shoes look easy. http://t.co/m4N8a5fO @ShannonBrown @tommyhilfiger","We do http://t.co/0Cooa17T RT @senorborge \"Who knows how to tie a bow tie?\" #menswear","Andre Iguodala of the 76ers kills it in Ralph Lauren Black Label made-to-measure. http://t.co/btLxsfHM @mindofai9","The NBA's Russell Westbrook going for the dunk. Dressed in Prada. http://t.co/lzugDsI5 @russwest44","RT @richardblandino: It was a blast hanging out  @GQMagazine w/ you @ErinHeatherton !!!  Play date soon? xo http://t.co/xpydXqAn","One-minute film wonder Jake Davis reveals his inspirations, including headgear, movies, and a cookie. http://t.co/km01b1kI @JakeDavisFilms","The Victoria's Secret Angels dressed in Santa hats singing Jingle Bells... and also some other news: http://t.co/e0LQ35YH","Morning style inspiration on this, the last day of Movember. http://t.co/N7sEOPpo","RT @BrianCoatsBC: Ok so I think it's time for a belt edit. #snakesonaplane http://t.co/P1U78tHT","RT @SHotchkissNYC: @JakeDavisFilms hits us with his \"10 Essentials\" - http://t.co/ISr5rI5g","Your Morning Shot: on the final day of Movember, we salute Ernest Hemingway - gent, scholar, amazing mustache: http://t.co/ETuKKPuy","@Grownandsewn has teamed with Japanese label SHIPS to create one of NYC's coolest current pop-up shops: http://t.co/0dJkx0ut","RT @willwelch: Should I be offended that @GQfashion just followed me yesterday? Doubleyou Tee Eff, dudes!?!?!","RT @CARDIGANnewyork: @GQMagazine @GQfashion http://t.co/tfuyd2hR Thanks for the A.C. 1896 Love! You guys RocK!","RT @willwelch: Did I show yall the best photo I ever took with my iPhone? Cee Lo Green, Soul Machine:  http://t.co/5abnemEL","Our fashion team loves these rugby scarves from Brit brand @SmartTurnout - they're the perfect seasonal style upgrade: http://t.co/9NsaN0Fe","Reggae legend Jimmy Cliff gave an intimate performance at Miss Lily's new venue last night in New York; we were there: http://t.co/mwjbGsOx","VIDEO: Go behind the scenes of Novak Djokovic's GQ Men of the Year photo shoot http://t.co/XRNya7o0 @DjokerNole","Next level lounge/workout gear inspired by the first modern day Olympic Games in Athens: A.C. 1986, now at Barneys - http://t.co/XFkohRWl","Our Ace of the Year Novak Djokovic in a very sharp Topman tux http://t.co/XRNya7o0 @DjokerNole @TopmanUK","Your Morning Shot: George Best hated to advocate alcohol or women to anyone, but they always worked for him: http://t.co/BI3Ua5Fo","RT @BrianCoatsBC: Sleigh bells ring- Rudolph is already showing on tv and now the Conde Xmas tree is rising.. http://t.co/wu7R6kTZ","We love this L.L. Bean-inspired wool tie from the Knottery, and at $25, it's one of the better fall deals out there: http://t.co/9Ri8mHxo","Shop like a GQ editor this #CyberMonday with our handy guide http://t.co/2blt97Ui","Screw those #CyberMonday deals and check out these awesomely expensive splurges. http://t.co/nKNPmr2y","A tuxedo jacket with jeans is a sharp look for any holiday party. Here are your best options: http://t.co/JqJaCHwY","Steve Carell makes a case for the return of the turtleneck (and fake mustaches?) in our Men of the Year issue http://t.co/6w2d1ftG","Seen here http://t.co/PD0sNXvp RT @LandsEndPR #landsend Men's Down Vest was featured by @GQMagazine and is only $25! http://t.co/EwscKYwq","Our friends at @7FAM are giving tips on how to look your best this holiday on their FB page. Check it out: http://t.co/2XrziWYh","Frank Ocean on fashion tips from Kanye: \"Always choose your sneakers wisely.\" http://t.co/JF43l5GX @frank_ocean @KanyeWest","Your Afternoon Shot: January Jones wishes she'd been nicer to her parents: http://t.co/GBauSdHV - we think we can forgive her if you can...","Shopping at your desk on #CyberMonday? Make a pit stop at http://t.co/oQO4KMOO and check out our holiday gift guide http://t.co/GbdAm2lR","GQ Office Style #7: @steliosphili doin' the tartan thang with this Gitman Vintage tie http://t.co/ZQutbcpe","Everyone's favorite \"arm party\" purveyor, @miansai, has a new online home: http://t.co/s9VpaArj - stop by for winter wristwear","How to tie a scarf, how to layer. All that and more in our GQ Rules how-to videos. Sign up for free here http://t.co/HTjucHYd","It's time to admit it: Sock season is officially upon us. Luckily designers have created some stylish options http://t.co/fngRDKCU","Take a break from all that winter shopping by flipping through next spring's runway collections http://t.co/ibhc0tRe","Are you following us on Tumblr yet? What are you waiting for? http://t.co/HOcTbqbT","If you feel dumb wearing a hat and scarf, remember this: runny noses are an even worse look. Try these on http://t.co/iDN5beq7","A puffer vest is a perfect shopping companion when the weather's cold but stores are a sauna. Here are the best ones http://t.co/iiTN8nOI","Shopper's porn: We've rounded up some sick splurges, like an $18k watch and a $2800 backgammon set. Why not? http://t.co/nKNPmr2y","I've been wearing this @aetherapparel Atmosphere jacket every day for a week, and it's my new favorite: http://t.co/JSjElT1o - SH","Shameless plug: Be sure to follow our other half @GQMagazine","Don't know what to wear to your holiday party? Take a cue from the stylish celebs at our annual Men of the Year bash http://t.co/AL6g2uw5","A Top Coat is the perfect holiday gift for a man. Here are some of the best of the season http://t.co/ztG00Mtp #BlackFriday","Shopping on #BlackFriday? Make time to update your outerwear before the temperature gets any colder. Here's our guide http://t.co/ksZwN5Z6","RT @GQMagazine: Are you man enough to shop on #BlackFriday? One writer has a tip for making the experience bearable: Get drunk first htt ...","RT @BrianCoatsBC: Go for it kids- Sneaker of the Week: Pierre Hardy Limited Edition Poworama http://t.co/T41MlNuN via @gqmagazine","Sharp holiday gifts don't have to cost a fortune. Check out these budget friendly steals for as little as 8 bucks http://t.co/nvzLVeut","@TALLIAORANGE is giving away items from their latest Fall collection. Enter now on their official Facebook page http://t.co/e5P5nKmT","We're thankful for all our Twitter followers! Now let's make this Facebook official: http://t.co/XrrHenmM","It's a holiday weekend, why not go camping? Here's what you need to pack (sorry, hot model not included) http://t.co/fdDRd54e","RT @GQMagazine This Thanksgiving we're thankful we don't live in the Worst-Dressed City in America http://t.co/20Vm1uVD","RT @GQMagazine The Sexy Women of GQ #thingswearethankfulfor http://t.co/wCeGgd9i","Get outfit inspiration from across the globe in our guide to Street Style http://t.co/IJZ3xbCo","The GQ Holiday Gift Guides, aka your #BlackFriday game plan http://t.co/GbdAm2lR","@TBTYH touché","RT @GQMagazine Looking ahead, these are the best new American cars of 2012 http://t.co/7zEXqe53","Upgrade your style this season with fall essentials from Tallia Orange: http://t.co/qqV4cN3Z","Ever wonder if we practice what we preach? Find out what a GQ editor really dresses like here: http://t.co/xms7QJWY","RT @GQMagazine From carving the bird to choosing the wine, here's the Man's Guide to Thanksgiving http://t.co/ZcXivV06","PHOTOS: The 20 sexiest women on http://t.co/oQO4KMOO in 2011. Give us thanks later: http://t.co/HaXai63B","You'll spot many a GQ editor sporting Club Monaco. Here's what we're buying this season http://t.co/Cafxvyem @ClubMonaco","Because we're in a giving mood, here are bonus pics from our sexy shoot with Kat Dennings you won't find anywhere else http://t.co/4ckP3opB","If you're brave enough to step foot inside Macy's this holiday, these are the items you need to buy http://t.co/HEZP9veJ @Macys","Banana Republic's a brand the GQ editors always go back to. Check out our favorite items of the season http://t.co/hv3fMtP6 @BananaRepublic","The Wayfarer has had its moment. It's time for a new pair, don't you agree? http://t.co/jDVhm01Y @parkandbond","You can get the GQ look at Urban Outfitters. Trust us. Check out our top picks from @UrbanOutfitters here http://t.co/BwGDkQdl","Our editors went shopping at Saks Fifth Ave and found the items every well-dressed man should own. Get 'em here http://t.co/pGxflPpl @saks","RT @ToddSnyderNY: Nick rocking Todd Snyder Military Cargos in photo 2 @GQfashion @NickWooster @AndrewPollardNY @ProjectShow @marcustroy  ...","@NickWooster and @AndrewPollardNY schooled us on their recent trip to Japan for @ProjectShow: http://t.co/KIc0nH4q - photos by @marcustroy","Nordstrom can get pretty hectic this time of year. Go straight for the items our editors hand-picked for you http://t.co/8SE6pCDc @Nordstrom","Want to shop like a GQ editor? Here's what our fashion team is buying at Barneys http://t.co/bWQOJhtc @BarneysNY","You don't need a big budget to get the GQ look. Check out the best stuff @Target has to offer a well-dressed man http://t.co/GPvTZMoG","We went to the biggest department stores so you don't have to. Check out our 2011 Shop Like a GQ Editor guide http://t.co/2blt97Ui","The penny loafer is making its comeback, thanks to Salvatore Ferragamo. http://t.co/yhPqydWx","Time for a denim upgrade: try this @dieselusa super slim pair for a change. http://t.co/etSl0t2F","Hunter presents a healthy, delicious alternative to fast food breakfast. http://t.co/b5Iv2uER","Can't figure out what to get him? GQ's creative director has you covered. http://t.co/roCywYga @parkandbond","Black Friday is approaching: skip the lines and shop @7FAM for everyone on your list. http://t.co/gP2RYxQD","Jay-Z is wearing this t-shirt in our Dec. issue. You can get it now at @parkandbond. http://t.co/X8ypjx3G","An umbrella that's too chic to be left behind. Perfect for the hard-to-gift guy on your list. http://t.co/onrMHVFQ","Our pals over at @BoylstonTrading just launched a sick collab with bag purveyor @Lexdray. http://t.co/4VaIg7QI","The GQ Eye is utterly unimpressed by the men at the American Music Awards... except for @adamlevine. http://t.co/hwRXkcSt","Bundle up in style: our editors pick the best hats and scarves. http://t.co/0zAsEFRa @nudiejeans @clubmonaco @paulsmithdesign","Thanksgiving is coming up, so our editor booked his personal training appointments. At least he's in good company. http://t.co/H6hbJbUc","Start your morning off with some style inspiration from a classic: Frank Sinatra. http://t.co/5yPgOzCn","Shirt shopping for a dapper man? Look no further. http://t.co/a7GreJyg @parkandbond @calvinklein","RT @BrianCoatsBC: Yes Willy Wonka is catering this shoot. #bacondoughnuts  http://t.co/agfc5bVj","Brad Goreski knows that sometimes modernizing a classic look just means playing with shades of gray. http://t.co/LgxifA5S @mrbradgoreski","We think Aussie model Sarah Stephens makes a pretty good case for workwear this fall, but we'll let you decide: http://t.co/PoAv7mtI","Is it even possible to look more put-together and proportionate than NPH does here?\nhttp://t.co/4mfpYWRA @ActuallyNPH","Fair Isle done right: in petrol blue, ivory, and a Bohemian-inspired print. http://t.co/c7dIxfMX @ParkandBond","The best we've seen Kellan Lutz look so far. This is how to pull off something fashion-y: http://t.co/zSAoyWax @kellanlutz","The best we've seen Kellan Lutz look so far. This is how to pull off something fashion-y—understated everything else. http://t.co/zSAoyWax","RT @gqmagazine Now, you can use a touchscreen AND keep your gloves on with these Etre FIVEPOINTs: http://t.co/sFs6186z","Who wore it better? http://t.co/9DgM6ouo @jtimberlake @NicoleScherzy","GQ's looking for fashion interns. Suddenly, carousing with models is within your grasp: http://t.co/uc40kOnX","Simple rule of thumb, guy: Your bow tie shouldn't pop out over your lapels. You look like a doofus. http://t.co/HbJKnUhZ @joejonas","Heads up, West Coasters. You can score a free iPod Shuffle when you spend $200 at the new @PerryEllis store at Los Cerritos Center","Last Night's Party: GQ EIC Jim Nelson with Justin Timberlake, Jimmy Fallon, and Jay-Z: http://t.co/AL6g2uw5 @S_C_ @jtimberlake @jimmyfallon","The Week in Style: this week everyone got all literal with this Twilight thing. http://t.co/5hrI8roq","GQ Office Style #5: our web editor @sean_fennessey, watching the throne with this Seagull '63 Air Force reissue: http://t.co/6OeSKwTX","Argyle socks are a surefire way to give personality to any outfit. http://t.co/kQYgo0ay","Jim Moore is calling this shirt \"the gold standard of oxfords.\" Find out why. http://t.co/X6jMeuly @ParkandBond","@smush_captain nah. Just PringleTweeting.","@IsabelWilkinson  I wish.","Super great to see @bandofoutsiders Mr Scott Sternberg there. xx MH","Also: @Diplo was good on what the kids these days call the Wheels of Steel. Whatever that means. MH","What else can I tell you about the bash? Zach Quinto is tall. He was worried about his hair starting on fire so he shut off the heat lamp.MH","And a special shout out to @EuniceLee of @unis on her birthday. xx MH","@mylistishere Just the whole thing. Could not have been more awkwaaaaaaaaaard. MH","@MinnieARHarding Yo","Also got to say it was great to see Elizabeth Moss, Jessica Biel, Rose McGowan tonight. MH","Know how I looked like an idiot at Men of the Year? Talking to Sarah Silverman. Oy. I mean, could I have sounded like more of a dork? MH","Know who everyone wants to meet at the Men of the Year party? Jon Hamm. MH","Know what I am doing right now? In my room eating Pringles. That's me killin' it OG style. I come from the streets. It's who I am. Word. MH","Know how else we killed it? Justin Timberlake and Jimmy Kimmel in the house known as Chateau Marmont. MH","Know how we killed it at Men of the Year Party? Jay-Z kept the PJ idling on the tarmac and stayed 4 hours. MH","RT @GQMagazine: First photo from our special guest instagrammer @joelmchale #gqmoty11 http://t.co/FKmXIgd7","Twitter, the Man of the Year DJ seems to be taking requests! RT @diplo: Should I open with N bombs in paris?","RT @diplo: Aziz ansari jus introduced me to justin timberlake as his manager david goldstein and left me #gqparty","Jay-Z has arrived. Men if the Year. Is. On. MH","@nagoya9 Will do, Garth. MH","@nagoya9 That's okay...I don't know who I am, either. MH","Prepping for our Men of the Year party. Slipping into my best Oleg Cassini suit. Last wore it to JFK's bash. Jay-Z's mind shall be blown MH","Chrissy Teigen at #GMHCFF2011. Fashion, drinks and beautiful women. Perfect night so far. LL http://t.co/UmgLWlrc","An update on the polo shirt—tipped, smaller collar, slimmer fit. Get it now. http://t.co/37ZAnlxa @ParkandBond","Follow tonight's GQ Men of the Year party at #GQMOTY11, and check us on Instagram (gq_magazine) for exclusive party pix all night long","Gorgeous. RT @GQMagazine See the complete portfolio of The Survivors of Music, shot by Mark Seliger http://t.co/SSCgRnkn","Did you think Brandon Flowers' mustache moment was a mistake? Yeah, he did too: http://t.co/F1P340Nd @BrandonFlowers","The coolest holiday pop-up shop in New York is the @aetherapparel pimped out AETHERstream in SoHo: http://t.co/hce6fHn1","From glow-in-the-dark denim to the heaviest pair ever created, these are hands down the craziest jeans in the world: http://t.co/Red27rPZ","We're not saying you should burn your tux, but maybe your life would be a bit simpler: http://t.co/XlqfSn1N - Newman is your PM Shot","Tip: Don't worry about matching your winter hat to your outfit. It's supposed to stand out, just like these options: http://t.co/oekfjpl3","@ovadiaandsons tipped us off to these crushable trilbies from Paul Stuart - now they're our Daily Endorsement: http://t.co/GVfJlNxp","Pimp my airstream - come see the @aetherapparel crew at prince and mulberry http://t.co/9qiC18ek","Be the life of that holiday party without the ugly Christmas sweater. http://t.co/7qQW1Z2t","Isn't it time you invested in the perfect 'anti-holiday sweater'? http://t.co/U8ibRiQj @MBastianNYC","A lot of models drop by the GQ offices each week, and the beautiful @CrisUrena is our current favorite: http://t.co/jfqZAhIe","Like the suit Justin Timberlake is wearing on our Dec. cover? Here it is, via @parkandbond. http://t.co/fnWMAsht @jtimberlake @calvinklein","Give Marc Jacobs his damn clothes back: http://t.co/kUgbS8xf","Some afternoon reading: an interview with the great Bruce Weber. http://t.co/fexngRuY","Time to ditch that schoolbag and get a real man's backpack. http://t.co/4aKwO4MO","New C.P. Company owner Enzo Fusco wants to bring the Italian brand back to life, we went across the pond to see how: http://t.co/RMwpZeHZ","NSF's spring lookbook just debuted and it's as easy and cozy as ever. http://t.co/0SitJ8Yq","The GQ Eye admits his crush on supermodel Jessica Stam. http://t.co/YMBEuWao @jess_stam","Good style doesn’t have to break the bank. Real people show off their looks in @KmartFashion’s new campaign: http://t.co/F5RstMiG","RT @gqmagazine: Mila Kunis was just too hot to put on our cover ONCE this year. Don't you agree? http://t.co/8QFrl3C6 #GQMOTY11","Is there such a thing as a snowboard for a grown man? GQ's guide to slope style: http://t.co/WDFpZJob","Our editor picks the perfect t-shirt for the December installment of GQ Selects. http://t.co/tPW84qMf @blkdnm @ParkandBond","\"I created my self-concept from the debris of Internet culture.\" @BebeZeva talks to GQ about her fashion blog. http://t.co/RptAl1JK","GQ Office Style #3: A killer Gitman Vintage tie spotted on our own @ejsamson  http://t.co/go6gPfSu","RT @BrianCoatsBC: new take on location scouting- where is your Occupy______ happening? I'm in the 99% but it's still a fashion picture.","Thom Browne is brown baggin' it and still looks cool. Some guys... http://t.co/Sgj8BbGq","What are the GQ editors buying this month? Check out our December issue edition of GQ Selects http://t.co/5CYNFze9 #menswear","RT @GQMagazine Arctic Monkeys frontman Alex Turner on his new rockabilly look http://t.co/oiCjKsRs @ArcticMonkeys @AlexTurnerSays","PHOTOS: Justin Timberlake and Jimmy Fallon's Men of the Year photo shoot for GQ http://t.co/Ei37G7Xq #GQMOTY11","GQ Office Style #2: Check out these sick Sid Mashburn monkstraps on our own @mark_a_green http://t.co/Tc30kNUZ","VIDEO: Behind the scenes of Justin Timberlake & Jimmy Fallon's GQ shoot http://t.co/9mjT5gSc #GQMOTY11 @jtimberlake @jimmyfallon","@GantRugger Holiday 2011 as shot by recent Eye feature @noahem - http://t.co/blXb2t8D","Gentlemen: TODAY is your last day to sign up for GQ Rules and enter to win a $10,000 wardrobe from @ParkandBond. http://t.co/xvH5pAGw","RT @BrianCoatsBC: love these kicks! Sneaker of the Week: Saucony Jazz Low Pro: The GQ Eye: GQ http://t.co/jsnrOVsi via @gqmagazine","Our Dec issue is just hitting newsstands but you can shop some of our favorite items from it right now @ParkandBond http://t.co/5CYNFze9","RT @GQMagazine GQ selects Justin Timberlake and Jimmy Fallon as Showmen of the Year http://t.co/9mjT5gSc #GQMOTY11","Our \"Sneaker of the Week\" is the always stylish and versatile @Saucony Jazz Low Pro: http://t.co/Xa8p6kRp - how do you rock 'em?","RT @SHotchkissNYC: @GQfashion we got an Instagram feed (sing to the tune of Cool Runnings) - Follow: gq_magazine","@ericsull kicks off our first edition of Office Style in a minimalist @bandofoutsiders tie http://t.co/axdyrXkc","@ericsull kicks off our first edition of Office Style http://t.co/axdyrXkc","Two more menswear bloggers you need to know now. http://t.co/5jngCahF","RT @GolfDigestMag We've seeded 32 HOT golfers in an NCAA-style bracket. Now YOU to vote for the HOTTEST of them all: http://t.co/XL2X99tF","Tomorrow is your last day to sign up for GQ Rules' killer videos and enter to win a $10,000 wardrobe from @ParkandBond. http://t.co/xvH5pAGw","While we were hitting the shows during fashion week, Santa Margherita released its Chianti Classico Riserva. Details: http://t.co/FydUsgns","RT @gqmagazine: Men of the Year 2011, starting with Jay-Z, who talks his Maybach and @kanyewest. http://t.co/ENbN48gT #GQMOTY11","It-Brits Turnbull & Asser set up shop in Midtown Manhattan. http://t.co/3aqLPHii","Introducing: GQ's Men of the Year 2011. http://t.co/8rjJdTNS #GQMOTY2011 @jayz @jtimberlake @jimmyfallon @mfonline","Some morning style inspiration, courtesy of Man of the Year 2011 Shawn Carter. http://t.co/mzFo5cw8 #GQMOTY11 @jayz","Our editor picked these Saucony kicks as our Sneaker of the Week. http://t.co/Xa8p6kRp @saucony","RT @BrianCoatsBC: Forgot to tweet this yesterday- this sat outside #Conde for a while . #Treschic.  http://t.co/0cixzTvq","Drake: \"People only talk about me and sweaters... Hopefully Missoni hollers at me and we get a sweater line popping!\" http://t.co/rvLQMxPZ","Adam Scott shows that contrast shoelaces are a good way to punch up an outfit: http://t.co/uij4yDAW @mradamscott","Real men wear Pepto-Bismol pink: http://t.co/b9s1rb9y @iamMarkRonson","Who's the better watcher of the Throne, Kanye or Jay-Z? http://t.co/e3vxRq2n @kanyewest @S_C_","Good rule of thumb from the Week in Style: You should always tuck your bangs into your beanie. http://t.co/9UFjsOqz @justinbieber","Enter the Tailor Made Style Sweepstakes for the chance to win a Corneliani suit and an iPad 2 http://t.co/207xJpyM","Exclusive GQ update on the whereabouts of @UnknwnMiami--the LeBron-affiliated shop that's going to change the game.  http://t.co/wvWdt1AV","Classic, effortless style as always, by 30 Seconds to Mars: http://t.co/CfPSqPVA @jaredleto @30SECONDSTOMARS","Our photographer Ben Ferrari stalked the streets of New York and found some men who are welcoming the cold in style: http://t.co/TroWd0An","Get a glimpse of @KmartFashion's new campaign showing off real people and their personal style: http://t.co/F5RstMiG","Week in Style 11.11.11: An oversized Brad Pitt, a shrink-wrapped Yeezy, and a very tailored Adam Scott: http://t.co/5NoTvKdk @mradamscott","#FF @mbastiannyc @gantrugger @parkandbond @mmcnairy @jakandjilblog @giltman @diplo @simonspurrhq @rag_bone @bandofoutsiders @kanyewest","#FF @Guess @RitzCarlton @FashionIndie @BoylstonTrading @Lisalla_M @ColbertMD @MarcVetri @Jcrew @NickWooster @MarlonGobel @TourneauTimes","Sorry, dude. If you can't grow a full beard, don't grow one at all. Instead, shave wisely: http://t.co/i85ehMzo","Jessy Heuvelink from @JLindeberg_ likes soft shoulders, here's why: http://t.co/8nvBjkrN","Seen our chat with @jpeskowitz from @parkandbond about the new Nepenthes shop-in-shop? Read up! http://t.co/Rq6qZz0d - SH","Shop the @JohnVarvatos Holiday Gift Guide for the perfect cashmere sweater, shearling jacket, and more: http://t.co/rr9BFRtu","Go to Façonnable to check out their gallery with GQ, the ART+STYLE exhibit! At 636 5th Avenue, supporting http://t.co/vmTZ62X6.","My absolute favorite tee right now is from @numberlab and @luisfern5 - http://t.co/kIH0pacp wearing one right now. -SH","Yeah, we know you've been meaning to buy a new wallet. Here's the one to get: http://t.co/t5KGAV2N","Donald Sutherland KILLING it in tweeds in our Morning Shot from earlier today: http://t.co/skyxZfIr - do ya thing, DS","J.Crew's Frank Muytjens gives us an inside look at his new capsule collection Wallace & Barnes http://t.co/YfsUGnRB @JCrew_Insider","RT @richardblandino Let it Rain!  @iza_goulart on the #VSFashionShow runway - HOT!!! pic.twitter.com/8b8aEqhV","Tip: The right socks can make a toned-down winter wardrobe really pop. Here are some suggestions http://t.co/fngRDKCU","Beard conditioner is a real thing. Seriously. http://t.co/i85ehMzo","Digging the Wandas performing at #LandsEndCanvas event. @landsendpr http://t.co/ENXDNCEY","Zachary Quinto and Chace Crawford looking sharp at last night's #versaceforhm party http://t.co/oq8d8tMN @ZacharyQuinto @Versace @hm","Cole Haan is releasing a new wingtip in its SoHo store. You don't wanna miss it. http://t.co/KZonJx0I @colehanninsider","RT @BrianCoatsBC: Dinner at #wtt as witnessed by @Ida_Kay . That's some good wings yo! http://t.co/Q4pxJxiP","RT @gqmagazine: \"I don't give a crap if he was gay or not.\" Clint Eastwood talks to GQ and Leo about 'J. Edgar' http://t.co/c6sv328a","Park and Bond brings an exclusive brand, Nepenthes, to their site. You need to check it out. http://t.co/Rq6qZz0d @parkandbond","Glenn O'Brien's 'How to Be a Man' is on Gildas Loaëc's must-have list. http://t.co/7EwraGQv @maison_kitsune","The comprehensive GQ guide to outerwear. http://t.co/tgGfxQN6","Fur isn't just for ladies. Get in on the action with a mouton collar jacket. We found the best at every price http://t.co/uHdmeRoe","Just in case you missed our watch of the week. (It's a good one). http://t.co/tRtVhXzx @jcrew_insider @tourneautimes","The co-founder of @maison_kitsune reveals his must-haves, including a light-up Daft Punk table. http://t.co/5zFxinYi","A top coat is essential in any well-dressed man's winter wardrobe. Here are your best options this season http://t.co/ztG00Mtp","A recap of last night's epic Versace x H&M party, with guests Prince and Nicki Minaj. http://t.co/oq8d8tMN @nickiminaj @versace @hmusa","A sherpa-lined denim jacket is a great way to extend that rugged look through winter. Here are 5 standouts http://t.co/j4A8jpmQ","Good morning from Marlon Brando and your pals at GQ. http://t.co/xjpQInjl","No, shaving more often does NOT make your hair grow back faster. http://t.co/i85ehMzo","Prince just tore that place down - finale? c'mon... Purple Rain @Versace @hm - goodnight y'all - SH","RT @JakandJilBlog: There's a dude wearing a WATCH THE THRONE tee and dancing to N***AS in Paris while shopping at H&M \\versace sale. SWEET!","Models in the show dash from work straight to the bar - they're just like us! #VersaceHM SH","Crazy enough, but kiiind of feeling that red suit @Versace and @hm SH http://t.co/P55hr1YU","Cheers when Prince enters the room - GOAT status. #VersaceHM SH","Menswear in the house at @Versace and @hm - @MISTERMORT @JakandJilBlog and others. SH","Models on models on models - in the stands. #versaceforhm SH","Here's a gross grooming tip: don't pop ingrown hairs, dirt in your nails can infect them! http://t.co/i85ehMzo","Bryan boy is practically a pro at this whole deal by now. #versaceforhm","RT @BrianCoatsBC: Very very excited....#hova  http://t.co/ooI15VGc","Full vampire regalia on the red carpet... Yay or nay? Yeah, that's what we thought too. #versaceforhm SH","Jessica Alba stopping traffic in a black and gold glittery number SH @hm @Versace","4 words: Mark Ronson. Pink suit. @hm @Versace red carpet. #wealth SH","Alex Wang in (surprise!) a black T by Alexander Wang shirt at the @Versace and @hm festivities. #ifitaintbroke SH","\"My face is melting\" Nicki Minaj in her serious getup on the red carpet at @Versace and @hm party. SH","A puffer vest is perfect for those chilly autumn nights. We've rounded up our favorites at every price point http://t.co/iiTN8nOI","WARNING: don't wear a suit near supermodel Lisalla Montenegro. She may rip it right off of you http://t.co/tzqTVrdw","Lisalla Montenegro: My favorite job is @Maybelline. It's always fun and creative and the girls are fantastic http://t.co/MiJQnxIU","Victoria's Secret bombshell Lisalla Montenegro reveals what guys should never do on a first date http://t.co/MiJQnxIU @VictoriasSecret","Are you on Google+? So are we. Come join us http://t.co/aCnuOhC4","Who says you have to sacrifice style on a camping trip? J. Edgar star Miles Fisher shows how it's done http://t.co/fdDRd54e @MilesFisher","RT @richardblandino: Get to know your #modelbehavior w/ Lasilla Montenegro of @IMG_Models  http://t.co/ZOe8vrKG","From puffer vests to topcoats, we've got you covered this winter with our Ultimate Outerwear Guide http://t.co/tgGfxQN6","The Boss knew how to work the several-day-old-scruff, and he's Your Morning Shot: http://t.co/UFOC9bob","Leonardo DiCaprio demonstrates how to dress for a morning talk show. Just in case you need to know. http://t.co/4Wk4OJ8g","Style advice from GQ Editors and a chance to win a $10,000 wardrobe from @ParkandBond. Welcome to GQ Rules. http://t.co/kJbEjpj8","Pretty great. RT @dannyinaustin: @GQfashion I wear a beard but only because my wife loves it. She says it makes me look like someone else.","Like men's style? Here's seven things you should see on the web today: http://t.co/sCPt1Gvk","Our Style Guy on the power of facial hair: \"Beards show you're the independent type and possibly self-employed.\" http://t.co/i85ehMzo","The boys over at Boylston Trading Co. have caught our Eye. http://t.co/TsaKHTs5 @BoylstonTrading","Italian winemaker Santa Margherita celebrated the release of its Chianti Classico Riserva at Fashion Week. Learn more: http://t.co/2SMVvm4j","For those casual days, we're endorsing the Left Field NYC Terry Crossgrain Crew. http://t.co/Rq6feRkf @left_field_nyc","Go to Façonnable to check out their gallery with GQ, the ART+STYLE exhibit! 636 5th Ave, supporting http://t.co/vmTZ62X6.","Your Morning Shot: ATL's favorite retailer, @SidMashburn, reminds us that \"creativity is a team sport\": http://t.co/49LpdSgd","Cam Gigandet makes the best case for guys going platinum blond. Agree or disagree? http://t.co/w41ZKmmU","Hair tip: If you're going platinum blond, the key is to not overdo the styling. You got that, Jared Leto? http://t.co/w41ZKmmU @jaredleto","OK, we may be a little obsessed with Ryan Gosling's style, but the man is killing it in this look http://t.co/u6Zrq2WX","In this look, Snoop Dogg wants to make it impossible for you to ever forget his name http://t.co/PNbbuZid @SnoopDogg","A DB suit with no tie is a ballsy move, but Joe Manganiello pulls it off. http://t.co/wcijrgHJ @joemanganiello","Looking for a fashion reason to care about LSU vs Bama? How bout the awesome houndstooth ribbon on-field? -WW  http://t.co/8ZQDu8X7","Bieber raps over \"Otis,\" Kenneth Cole redesigns the AIDS ribbon, and we endorse a show about sex addicts: http://t.co/Ridx8sJm","Props to Common for mixing patterns the right way. Nice combo http://t.co/bbZcCMZV @common","Aw, Justin Timberlake and Amanda Seyfried look like they're on their honeymoon http://t.co/aSEwaVBa @jtimberlake @SeyfriedAmanda_","Is Sonic the Hedgehog making a comeback in Germany? Nope, that's just Jared Leto http://t.co/kjvSmo5A @jaredleto","Russell Brand: We're still not feeling the dozen-zippers look, but we'll give you credit for covering up your pubes http://t.co/5oAraprL","Our Daily Endorsement? This sport duffle from @TumiTravel and @selectism - camera bag, laptop case, tote - all in one: http://t.co/JY4WORkR","John Cho showing the right way to punch up a classic suit. Nice move http://t.co/L2ZmDDmR @JohnTheCho","Tom Warren @FordModels @GQMagazine #models  http://t.co/h56XYlTP","This could be the most normal we've seen Jake Gyllenhaal look in years. We like it. http://t.co/iPimfVr0","Yo, Mitt (@mittromney), we think you need a new bag: http://t.co/wEJExN5o","If you're thinking about going platinum blond we recommend letting your roots run wild like Mark Ronson http://t.co/w41ZKmmU @iamMarkRonson","Mitt Romney REALLY needs a new bag: http://t.co/wEJExN5o","Hey @iamwill what's up with the wings, dawg? http://t.co/4VaK0yRv #NAGL","RT @BrianCoatsBC: Love this weeks sneaker? Sneaker of the Week: Karhu Fulcrum Star: The GQ Eye: GQ http://t.co/QYP0jaVM via @gqmagazine","We strolled around Central Park with Aussie model Emma Ishta, bundled up in some of fall's finest menswear staples: http://t.co/9ebtPVvK","Platinum blond hair for men: do or don't? One GQ staffer makes a case for it http://t.co/w41ZKmmU","RT @GQMagazine Remember that super sexy photo shoot of Kat Dennings? There's now video, too. You're welcome http://t.co/mgBcTwzj","RT @dewaynejones: It's BAD SEX premiere day!  Tune in tonight at 9pm on Logo #FF @BadSexonLogo @BrianCoatsBC  @ChrisDonaghue @JeffersonI ...","Think you had a rough week? Check out what we caught some celebs wearing. Now presenting The Week in Style http://t.co/q4gAemgt","At the Guess + GQ event! Everyone's here! @TheophilusL @TheSayersClub in LA! Check out more @GUESS http://t.co/ea8smOvY #CoolBeatsGUESS","Kicking back in Palm Beach this fall/winter? Stop through the new Wanderers pop-up and grab some @deltoroshoes - http://t.co/fa0EFywT","James Van Doren, co-creator of iconic skate shoe brand VANS, passed away last month at the age of 72: http://t.co/J0VEmjp6 - R.I.P. sir","Erykah Badu broke into song at her GQ photo shoot. Good thing we had a video crew on set to capture the moment: http://t.co/viyPWp8B","@Ferragamo rolled out their new Tramezza SE shoes with NY Giant @TeamVic last night at the 5th Avenue store: http://t.co/28qZ5WPg","A crisp corduroy suit that won't break the bank from the crazy cats at @supremeny and Adam Kimmel: http://t.co/88G7k2Io - going fast!","Erykah Badu on her personal style: \"I enjoy it. It's art, for me. It's a functional art\" http://t.co/viyPWp8B","The fellas at @ApolisGlobal just opened the new must-hit spot in LA's Art District, here's a behind-the-scenes video: http://t.co/sht4yn5E","For less than the price of a pizza, you can grab these @thetiebar cotton pocket squares, maybe the best deal going: http://t.co/Buyh696T","@willwelch hold up. you WASHED your jeans???","RT @GQMagazine 5 rules for the right way to behave at a wine tasting (like rule #1: don't be an asshole) http://t.co/XImg7aQX","Tonight: an exclusive event with @TheophilusL @TheSayersClub in LA. Check out more @GUESS: http://t.co/ea8smOvY #CoolBeatsGUESS","The Morning Shot where actor Michael Caine (in a beautifully cut DB) tells us to act like ducks: http://t.co/MZzO52xJ","When it comes to style, do any of the 2012 Republican candidates pose a real threat to Obama? Glenn O'Brien weighs in http://t.co/bcjAVZWr","RT @BrianCoatsBC: I'd like to thank Ms. Gloria of the TSA for not taking my @miansai. The grey cord is my fav and not a weapon. http://t ...","Bikes on bikes on bikes (@levis commuter at S12 event) SH http://t.co/rTWMcNHV","Reason umpteen to join Movember: the dapper dudes at @ParkandBond are doing it. http://t.co/pnBg9cCG","Street Style from the shows by STREETFSN. Warning: Feelings of style inferiority may occur after seeing this. http://t.co/lsAzEb9p","In support of November, @parkandbond got the scoop from Nick Wooster on mustaches. Enjoy. http://t.co/ALklGStP","RT @refinery29: @GQfashion @glamour_fashion @cutblog @johnjannuzzi @wwd Someone have a rock we can hide under?","RT @johnjannuzzi: I hope there are pickles. @GQfashion @refinery29 @glamour_fashion @cutblog @wwd","Snooki told us she's starting a clothing line http://t.co/41jw7Qm0 Thoughts, folks? @refinery29 @glamour_fashion @cutblog @johnjannuzzi @wwd","Snooki: “This is the first real interview that I ever did in my life!” We’re honored, Snooks. http://t.co/41jw7Qm0 @Sn00ki","Shearling-lined suede boots, courtesy of J. Crew. You can't go wrong. http://t.co/jmAvbtMT","RT @BrianCoatsBC: @bevysmith all hail the Queen! Happy Birthday Gorgeous! Xo BC","For your convenience, we compiled our creative director's favorite things and put them in this nifty slideshow: http://t.co/EdeHH550","Five reasons to own a sherpa-lined denim jacket. http://t.co/Ou9ic0Q0 @HUGOBOSS @gantrugger @JoesJeans @Levis @TrueReligion","The GQ Eye investigates the sleek new Barneys CO-OP at their Madison Ave. store. http://t.co/XFxJCTAN @barneysny @barneysfashion","Test shots featuring Jake Davis from the UNIS campaign. You're welcome. http://t.co/rU9VkJhO @unisnewyork","Meet the Worst-Dressed Man of October http://t.co/oxlWkM5R @rustyrockets","These Outlier Tailored Performance pants kept us dry in this past weekend's weather - you'll want a pair this winter: http://t.co/EghfKFae","Your Morning Shot: Ray Charles with some fall layering inspiration - he never wanted to be famous, just great: http://t.co/yD2LdqIE","Dear Jared Leto: Enough with the nip slips. http://t.co/YLN7rH3K @jaredleto #worstdressed","Benicio del Toro must have lost his luggage. How else can he explain this airport outfit? http://t.co/2nRcBsze","Sorry 50 Cent, but you're guilty of making a style move that hasn't been cool since 1983 http://t.co/XnYlVfR2 @50cent","GQ + GUESS are hosting a party w/ Theophilus London at LA’s hippest new club. Get tickets: http://t.co/ea8smOvY #CoolBeatsGUESS @TheophilusL","Most guys make our worst-dressed list for trying too hard. Adrian Grenier did the exact opposite http://t.co/Yd7T1Zqg @adriangrenier","RT @BrianCoatsBC: Happy Birthday to Peggy Sirota from team GQ. #cupcaketasting #major  http://t.co/DtQCK9wC","What you slather on yourself (skin, hair, junk) should be as all-natural as what you eat. A guide to organic grooming http://t.co/dJWBPEWR","NY Giant @TeamVic hosts a private event tonight with GQ for the @Ferragamo Special Edition Tramezza launch","Too cold to go without a jacket but not cold enough to sport a parka? We've got the perfect solution: http://t.co/hzUun3t5 #menswear","RT @BrianCoatsBC: Picture on a pack of socks but he's not wearing socks? #sportieLA http://t.co/iYDv4syD","Take one last look at October with our picks for the 5 Worst-Dressed Men of the Month http://t.co/r4zUqQgz","\"excuse me sir do you have any shoelaces ?\" JM #SportieLA.  http://t.co/FotCaodX","\"Vespadrilles\" at #SportieLA. JM http://t.co/iM2e9DK2","RT @BrianCoatsBC: This old lady from the billboards is still driving around in her pink car! #loveLA  http://t.co/eGuxHfBy","A gift from Bethenny Frankel made Andy Cohen's top ten list. http://t.co/2Q1oM3Ft @bethenny @bravoandy","Fully endorsing Brooklyn Denim Company. http://t.co/x1MP4yPi","What do Andy Cohen and Anderson Cooper have in common (besides their initials)? APC denim. http://t.co/mmHCW4Hk @bravoandy @andersoncooper","Best news we've heard all day: GANT is launching a men's fragrance. http://t.co/Iqicp4vm","The insanely practical gift any gentleman will love: a dashing tie case. http://t.co/o8N9BlEI","True story: Andy Cohen's white Blackberry was inspired by Rachel Zoe. http://t.co/qxL3VBDI @rzrachelzoe @bravoandy","Daily style inspiration, courtesy of Serge Gainsbourg. http://t.co/79ywQXYg","Join Façonnable + GQ on Thurs 11/3 for the opening of the ART+STYLE exhibit. 6pm @ 636 5th Ave supporting http://t.co/vmTZ62X6: RSVP7@GQ.COM","Bravo's Andy Cohen reveals the ten things he can't do without—and the Real Housewives didn't make the list! http://t.co/G1imHSmP @BravoAndy","The epitome of cold-weather style: the camel topcoat (by @burberry, as worn by @TheophilusL). http://t.co/CNTIr6cs","You could still win a $10,000 fall wardrobe just by signing up for GQ Rules. What are you waiting for? Enter here: http://t.co/HTjucHYd","RT @BrianCoatsBC: \"my mom wore this dress to my bar mitzvah.\" @samspector  http://t.co/5eFYTHTO","RT @BrianCoatsBC: Sorry Mr. Lauren but it's time for a new pair. #chicbutleaking #notchic  http://t.co/a32yZANq","RT @BrianCoatsBC: Flight delayed#condecallsRT @bobbytauk:Just landed @Chicistan @cfda @prprofessor @thedoc318 @bobbytauk @gaywasp @paulw ...","Sexy corduroy is no longer an oxymoron, thanks to Glee's Harry Shum Jr (and Ralph Lauren). http://t.co/hCCZ8fMS","How many zippers do you think had to die to make Russell Brand's outfit? http://t.co/ztiEPtRn @rustyrockets","This is exactly what @JonahHill should be wearing at this point in his career/if he worked at a restaurant in Brooklyn. http://t.co/THoEGIAL","\"Like the Boys\" returns this week with Corinna Studier, a German model who looks dashing in double denim: http://t.co/8NYKRGdf","This month we declared Brooklyn the Coolest City on the Planet—need more proof? Check out these men on the street: http://t.co/Xk65bQEh","Sick of being the backside in an ill-fitting horse costume? Shop the look of these 10 stylish Halloween alternatives: http://t.co/Xd9F76dp","Just how did Miami Heat superstar @DwyaneWade become one of the game's most stylish players? GQ's @willwelch asked him: http://t.co/qNtwj4WI","Because Brooklyn can do more than hipster: check out Smith + Butler for tailored rock 'n roll. http://t.co/jFCh9uqC @smithbutlerbk","Andre 3000 is number 10 on our Most Stylish Musicians of All Time list. See the top nine here: http://t.co/3V7oMn68","Week in Style: Johnny Depp, Jonah Hill, and T.I. parse out what to wear in a crazy-ass fall like this: http://t.co/xN5mZPjI @JonahHill @Tip","Your Morning Shot: Bryan Ferry. \"All those rappers, they're the only glamorous people working in music now...\" http://t.co/tT9bbjWc","NYC's up-and-coming designers can be found at Alter, one of Brooklyn's stores you can't miss. http://t.co/5uUrYnTA @alterbrooklyn","Moleskin isn't for journals. It's your new favorite suit, shown on Glee's Harry Shum Jr. http://t.co/1bByGJIt","Billykirk leather, Hill-Side ties, and more at In God We Trust, one of our favorite spots in Brooklyn. http://t.co/QnGhsM1V @ingodwetrustNYC","RT @BrianCoatsBC: I think this is the cutest thing I will see all day. #armanijunior #imeanreally http://t.co/PyvQ2ukh","RT @GQMagazine Dwyane Wade breaks down his top 5 favorite suited looks of the season http://t.co/r0rLHyBG @DwyaneWade","Long underwear is not just for hiking (especially if you're a New Yorker). Harry Shum Jr. shows how to layer: http://t.co/QvSKErn0","Sweater vests: the cool way to layer without bulking up your suit (as shown on Harry Shum Jr). http://t.co/SGgnI2H7","Why do girls get to have all the fun? Here are slutty Halloween costumes...for dudes. http://t.co/6TOcFdLj","RT @BrianCoatsBC: Had a blast with my GQ dinner date- the always stylish and handsome @mrbradgoreski . Now put the bread down sweetie.","Don't be fooled by the name: The Brooklyn Circus is not for clowning around. http://t.co/UJ7gW0rV @thebkcircus","See Ashton, Carmelo, and all the celebs from last night's GQ Gentlemen's Ball http://t.co/baVzVhVm","Dwyane Wade on personal style: \"When I first got into the league, I tried to fit in. Now I don't care.\" http://t.co/qNtwj4WI @DwyaneWade","Brooklyn's Epaulet is known for roughed-up Americana style, with prep brands like Gant and Gitman Vintage. http://t.co/f07oBgS8 @epaulet","We've said it before, and we'll say it again: the wool tie is what you need for winter. Here are 4 options http://t.co/mEpOMOgG","Few have evolved in style like @JayZ, who ranks #27 on our list of Most Stylish Musicians. http://t.co/YBH5exV0","Worried about ruining those dress shoes in the winter slush? You're wearing the wrong pair. http://t.co/l3bWUDDq","Bob Marley makes our list of The Most Stylish Musicians. http://t.co/eonB509X","@numberlab is opening a new shop in NYC dedicated to their tech/tailored staples: http://t.co/wwyD4B22 - we investigated","Bruce Springsteen, the very embodiment of American style, makes our list of Most Stylish Musicians of All Time. http://t.co/Q2jH8WTg","Liam Gallagher takes style cues from the past... and kills it every time. http://t.co/fKfX3P9g @liamgallagher","We award the best dressed at the @Racked Awards last night. http://t.co/MthvcKsa @epaulet @rackedny","We have an exclusive look at UNIS' fall suiting. You need to see this. http://t.co/LWewBvCX @unisnewyork","Half of the GQ fashion dept swears by the parka-suit combo. And so does Glee's Harry Shum Jr. http://t.co/0RkieBo2","A look at Ernest Alexander's Fall RTW collection on the GQ Eye: http://t.co/9rfObOQf","Thanks to Stevie Wonder, who taught us what it is to be a player. http://t.co/fZuh3sTc","Like camo, but afraid to rock it? YSL's got you covered. http://t.co/7Rq5OgR1","Beck has been one of the most stylish men in rock for nearly two decades. http://t.co/eoebVdph @beck","Ten men's stores you can't miss in Brooklyn: http://t.co/f07oBgS8 @smithbutlerbk @epaulet @thebkcircus @ingodwetrustNYC","Boots and trousers CAN be worn. But boys, please proceed with caution: http://t.co/Wee0f53f","Underground hip-hop phenom Spank Rock talks to GQ about the things he can't live without, including Black Bart Simpson. http://t.co/DcILZu8T","RT @BrianCoatsBC: Shout out to @Coach for a rad bunch of accessories showing tonite at The Ace hotel. Well done. And a pleasure seeing @ ...","The shoe labels you need to know right now, including @FlorsheimShoes @JimmyChooLTD @PierreHardyNews. http://t.co/9BOGreZw","Next week: Mystery artist, Mystery city! Have you @GUESS'ed where? Go here for the huge unveil http://t.co/ea8smOvY #CoolBeatsGUESS","Morning style inspiration, courtesy of George Harrison: http://t.co/XV5S4qmh","For all you hipsters out there currently rocking geek chic, pay due homage to Elvis Costello. http://t.co/VZawqryd","Springsteen, Jay-Z, Iggy Pop, and more debut on our list of The Most Stylish Musicians. http://t.co/fKfX3P9g","Tying your scarf like an 'artiste'? It's cooler than it sounds, especially on Glee's Harry Shum Jr. http://t.co/oPZdRInu","Hamilton Leithauser of The Walkmen is so stylish, no explanation is necessary for his place on our list. http://t.co/fKfX3P9g","@SHotchkissNYC checked in with Tommy Guns' owner Russell Manley at their new Brooklyn outpost: http://t.co/I1REylaf - and he's a GQ fan","Liam Gallagher is not only one of our best-dressed musicians, he's an award-winning clothing designer. http://t.co/ETuKKPuy","RT @BrianCoatsBC: Wait is that an itch you have down there?? Thank God I received this product. #weirdswagatGQmag http://t.co/zDo6q1hO","RT @richardblandino: The gorgeous Chanel Iman stopped by @GQMagazine today.Can't wait 2 see her new wings n the @victoriassecret show.#m ...","If anyone ever made the case for stylish shaggy hair, it was George Harrison. http://t.co/tz60lIOd #stylishmusicians","Brandon Flowers: feather fetishist or style badass? The latter, we think. http://t.co/fKfX3P9g @BrandonFlowers","We sent the GQ Eye to investigate Hickoree's, one of the coolest stores in Brooklyn. http://t.co/9pm1k9il","Our Daily Endorsement: the @Danner Light Patterson, a military spec, limited edition boot with a conscience: http://t.co/Rqa54Z5h","With a touch of old school cool, Thomas Pink is offering shoeshines with a purchase at their Madison Ave flagship: http://t.co/JAJsGp4D","The GQ editors list the Most Stylish Musicians. Today, numbers 40-31, including Bob Marley, Elvis Costello, and more: http://t.co/fKfX3P9g","This is how a gentleman ties his scarf (as shown on Glee's Harry Shum Jr). http://t.co/PD0sNXvp","Fashion plate Kid Cudi makes our list of the Most Stylish Musicians of All Time http://t.co/QpXVRtdz @AdoreTheKidCudi","Your daily dose of morning style inspiration, courtesy of Levon Helms. http://t.co/miJb9M3C","The preppiest act on our Most Stylish Musicians list: Ezra Koenig of Vampire Weekend http://t.co/pT5S7MyZ @arzE @vampireweekend","Is it (finally) getting cold outside? Fret not — we picked out these topcoats to keep you warm. http://t.co/FdOI8HoP","Levon Helms, the dapper drummer from The Band comes in at #48 on our list of The Most Stylish Musicians of All Time: http://t.co/miJb9M3C","We gotta hand it to Jack White: the man's consistent http://t.co/RAi8Y6tT #stylishmusicians","Fancy yourself a gentleman? You're going to need the proper footwear. We're kind of obsessed with these: http://t.co/fdIZLl9W - SH","Only one member of the Strokes makes our list of the Most Stylish Musicians of All Time. So far. http://t.co/elNsrRXC","How could we forget? RT @GQMagazine Harry Shum Jr isn't the first #Glee star to appear in GQ. Remember these photos? http://t.co/8CfeeJ9m","Caleb Followill may make more headlines, but it's little bro Jared that catches our eye in  style http://t.co/FWBJzCvE @youngfollowill","The flannel suit is a winter staple, but here are three ways to wear it with 'tude: http://t.co/foQKz0D0 #menswear","Our own J.D. was the subject of @JakeDavisFilms latest \"Test Shot\": http://t.co/1wAhklVm","Ermenegildo Zegna dipped into his personal archives to create the Monterubello Solo Tempo, our \"Watch of the Week\": http://t.co/DN15RCoY","The first rule of winter style is a no-brainer: Colder temperatures call for heavier fabrics, from head to toe: http://t.co/eW9h2lKj","VIDEO We asked Harry Shum Jr to bust a move at his GQ shoot. Prepare to be amazed http://t.co/xpv04AhJ @ShumSquad @HarryShumArmy","Our daily endorsement is this beautiful fall footwear from @ROTMShop - hide your credit card, in fact, burn it: http://t.co/fdIZLl9W","T.I. looks as comfortable in an Armani suit as he does in jeans and an oversized tee #stylishmusicians http://t.co/eF2rIRu9 @Tip","Carhartt's elevated offshoot, @CarharttWIP is invading NYC's SoHo this week, we chatted with the creative director: http://t.co/cWgu7ssW","Sorry haters, we think Drake's one of the most stylish musicians of all time. Who's with us? http://t.co/9vuLs8TL @Drake @drizzydrakeorg","Meet Chuck Wepner, the dude who inspired the movie Rocky, and a dope new tee shirt from @NOMASNYC: http://t.co/6T8pBWjs","In honor of our music issue we're counting down the Most Stylish Musicians of All Time. Today: 50-41 http://t.co/h3Yt3KOc","Your Morning Shot: \"The Rum Diary\" drops later this week, so naturally we're looking to H.S.T. for some inspiration: http://t.co/HqvBFUnR","Glee's Harry Shum Jr. shows you how to winterize your wardrobe in style http://t.co/eW9h2lKj @iharryshum @GLEEonFOX","RT @theselby: Michael Hainey  writer, artist and editor @GQfashion  Brooke Cundiff  @parkandbond at their  home http://t.co/Lw7aGiJn","RT @BrianCoatsBC: I can pack for a week trip in 10 min...but i'm not sure if there's anything i dislike more than unpacking that damn su ...","Jim Moore says, \"...the plastic watch shows you've got confidence. You put on the Casio and that gives you attention.\" http://t.co/XAMZ6Hct","Guys, THIS is what you should be wearing to Thanksgiving. Courtesy of Southern gent @billy_reid : http://t.co/6dFJssp0","We tracked down the Hipster Cop to talk to him about his personal style and how the protesters are dressing: http://t.co/nuin6TJz","Give your feet a lift with these shoes that are equally as quirky as they are practical: http://t.co/OfxgRJrz @grensonshoes","While you switch out your silk ties for wools this season, don't forget your bow tie: http://t.co/lLnRBC7K","Is the word \"foodie\" stylish? These guys say no http://t.co/jDlvSvx6","Dude, Zach, we like you, but if you look this stiff, you should probably change. First, lose the vest. http://t.co/xtCbrsEW @ZacharyQuinto","Jim Moore explains why you should embrace the pom pom hat: http://t.co/IMRkQHRB @parkandbond","RT @BrianCoatsBC: \"thinking of doing a staged reading of my new diet concepts.\"  #overheardinLA #lactoseintolerant","This briefcase is just as perfect for carrying your \"walking office\" as it is for holding gym clothes: http://t.co/8UD7oA9E @parkandbond","We at first thought Russell Brand was looking pretty badass here. Then we realized a couple things... http://t.co/0nHPUnlW @rustyrockets","Masafumi told me he's wearing a \"four piece\" suit (pants, vest, jacket, tie). See the details. MH http://t.co/O0Lc5BHV http://t.co/pVBEEr1V","The Week in Style: the week everyone attempted badassery—with varying degrees of success: http://t.co/IWbJIzZK","Big day at GQ. The new editor of GQ Japan -- and street style god -- Masafumi Suzuki came by. MH  http://t.co/EOj49SZn","With this black on black stitching, it's that jean you could wear with a tuxedo jacket or a sweatshirt. http://t.co/ZUcdt8Ol @SimonSpurrHQ","You'll want this tweed jacket for the fall, no matter what look you're trying to rock: http://t.co/Ha4cWiP0 #gqselects @parkandbond","Beautiful women = nice. Beautiful women in dub monks = nicer.  Introducing \"Like the Boys\" - Menswear's better half: http://t.co/sUwkvy52","We take you behind-the-scenes of the killer collab between @Versace and @hm - http://t.co/pV56lfKv","Cali boys @ApolisGlobal have a new downtown LA Flagship on deck, and their fall lookbook is (unsurprisingly) rad: http://t.co/8teAHmx5","@MBastianNYC at it again. This Gant sweater vest is geeky in the best possible way http://t.co/0qcnObJt #GQSelects","Thank you Michael Kors for creating a puffer jacket that doesn't make a guy feel like the Michelin Man http://t.co/TSYPp6sj @MichaelKors","One word to describe this Michael Bastian suit? Genius http://t.co/zJ517vkC @mbastiannyc #GQselects","RT @BlondieOfficial Debbie featured in next month's GQ: gq.com/entertainment/…","Looking for some instant cool? Throw on this Rick Owens leather jacket: http://t.co/8plTToKO #GQSelects","Downtowners be sure to hit the new Patrik Ervell and Graham Hudson pop-up at 57 Walker St. Ladies collection too. SH http://t.co/YkFWk66G","Check out (and purchase) Jim Moore's favorite sportshirt of the season http://t.co/GEap9nR6 #GQselects","Food-obsessed? Make a trip to Brooklyn, the Coolest City on the Planet. (Yes, we know it's actually a borough) http://t.co/9Nr9Nzp5","In honor of our cover man Lil Wayne, check out 20 years of Weezy fashion http://t.co/6WCcP9ff @LilTunechi","Whips, chains, and Champagne: the must-have Halloween libation from @JPGaultier and @Piper_Heidsieck - http://t.co/ECRXtIRw","John von Sothen finds the coolest little custom @Vespa_Official shop in Paris: http://t.co/AwkUNbpn","Surf spins on iconic military staples? Leave it to Rick Klotz, the team, and the 'WOR' collection, our Look of the Day: http://t.co/7MZCZGZI","RT @BrianCoatsBC: Shout out to @Hotfmnigeria my coolest new follower. What's up Abuja? BC","RT @BrianCoatsBC: For some reason I drink twice as much coffee on shoots. Also this LA burn-off could hurry the hell up so I'd be more a ...","RT @gqmagazine: Ad campaigns and television shows prove it: we're in a sad, new era of masculinity. http://t.co/kdAzAGuG","Let GQ's Creative Director Jim Moore do your shopping for you. http://t.co/8plTToKO","This selection of tartan plaid ties makes us with this was one of OUR 10 Essentials. http://t.co/p03V0491","Tie maven David Hart shares the best cup of coffee in NY, his pinball machine, and some dapper neckwear. http://t.co/8mOf8vVy","Tommy Hilfiger and Bass present the \"Weejun\" loafer. Weird name, sick shoe: http://t.co/rJwdPZ3K","This bomber jacket has YSL style at a fraction of the price. http://t.co/VMfz1WFF","Savile Row expert Patrick Grant gives his thoughts on the menswear industry. http://t.co/cKxwR5Wa","Before he was a presidential hopeful, Rick Perry was a country singer! Hear his album now: http://t.co/TDvXVV2G","Your daily dose of style inspiration, courtesy of Keith Richards, a self-proclaimed \"minstrel.\" http://t.co/mCRjJupC","RT @parkandbond: Our partners in style over at @GQfashion pick their favorite pieces for the month of November - http://t.co/dFPYUilk","Video: behind the scenes of our music portfolio by Mark Seliger featuring @Eminem @LilTunechi @BrandonFlowers and more http://t.co/O1QJGjGz","RT @shipley_halmos: @GQfashion That shot is on our inspiration board every season! http://t.co/mbmJASa4","Richard Avedon's killer style often outshined his subjects', he was Your Morning Shot: http://t.co/VPh69ciF","Cool Brit from @Wilhelminamodel Mr. James Smith #GQ #models  http://t.co/H9kanHoR","Nick Wooster: \"I'm sick of myself. Aren't you people sick of me yet?\" If you answered no, click here http://t.co/ZrnLpSwR @NickWooster","Quite possibly the coolest candle going, straight from the boys at @BlindBarber: http://t.co/FzmFdi5Y","Our Nov issue is out next week, but you can buy some of our favorite items from it right now on @ParkandBond http://t.co/SDNz6fkH","RT @gqmagazine: In our Nov issue we honor music's survivors: the legends and legends-in-the-making who refuse to quit http://t.co/O1QJGjGz","RT @BrianCoatsBC: \"U should try Ralph Lorraine.\" #really? guy in a prominent Madison Ave boutique? Even mom knows how to pronounce that.","Magician David Blaine, Adam Kimmel ready-to-wear, and some big ass Great White Sharks: http://t.co/ojjfIzDw","Our \"Obsession of the Day\" are these charcoal gray @CLAE_Footwear Ellingtons with a bold red sole: http://t.co/JYJlYMs0","Missed Drake on #SNL? Check out our Look of the Day http://t.co/65j720Ii @Drake @nbcsnl","@Drake and Andy Samberg (@thelonelyisland) in matching COOGIs? A clear lock for \"Look of the Day\": http://t.co/Opqp2KNT","Add @_agnesb_ 's Howard Street boutique to our favorite NYC retail venues: http://t.co/SZPqIGsU","Here's your first look at Norman Hilton's fall lookbook, shot by Fred Castleberry of @UnabashedlyPrep http://t.co/wejhBO2R","Watch it. RT @GQMagazine New Video: Behind the scenes of Elizabeth Olsen's sexy GQ shoot http://t.co/gMTyhSCc","Do you like animals and amazing hair? @NormanHilton 's fall lookbook shot by @FECastleberry will fit the bill: http://t.co/ZM3tNjzy","Few looks are better-suited to battling the cold than a mouton collar jacket. Especially these: http://t.co/iXd0cKvs","Talking tweeds, Tricker's, and this season's must grab shades in our Morning Mashup: http://t.co/lJOL5sRN","RT @GQMagazine If you follow at least one of our tips on how to present yourself at the office, it should be this: http://t.co/jFGXcYb7","@TommyHilfiger \nAmazing day and dedication. Tommy, you rock for being such a big part of making this happen! JM","RT @TommyHilfiger: Over 100,000 people honoring Dr. Martin Luther King, Jr. in Washington DC, breathtaking. http://t.co/RwQIicVr","Learn how to step up your style this fall and enter to win a $10,000 wardrobe from @ParkandBond at http://t.co/HTjucHYd","@JohnstonMurphy goes H.A.M. (literally) with their new lineup of holiday luggage: http://t.co/TShBMhyA","RT @richardblandino: Go-See of the day, Jacob Sones @FordModels @GQMagazine @models #GQ #model  http://t.co/WIHEk0J2","Take a lesson in samba from Victoria's Secret model Izabel Goulart in this video by @gvonsteiner: http://t.co/GkSIQ3CV","Some of our favorite pieces from the October issue are available for purchase right now at @ParkandBond http://t.co/wmMuAr2r","Argyle's a sure way to turn heads this season, but we're not talking about a sweater vest: http://t.co/FE0ADrKd","Count us in RT @GQMagazine Living the Euro lifestyle can save your life. Seriously: http://t.co/hLb4aNDV","RT @BrianCoatsBC: here comes the future- funny/scary..Kids: iPad Baby Can't Work a Magazine - @Gawker http://t.co/nwUxQO1W","Are you man enough to pair your suit with a pair of these bold socks? http://t.co/BiaWQ6e9","RT @BrianCoatsBC: dear dude on the train this morning- maybe rethink the cologne bath you took and save it for tonite when you hit the M ...","LOL RT @GQMagazine Do this exercise to avoid the dreaded turtle neck (Not the one @GQFashion keeps raving about) http://t.co/IQPKZMw8","Gentlemen, leave the backpacks for the boys and get one of these no-nonsense briefcases http://t.co/o53w8hxA","RT @GQMagazine Make sure you don't look like this guy while reading this tweet. Your life depends on it. http://t.co/YfPDcGz5","Who doesn't? RT @GQMagazine On the eve of Footloose, our writer makes a bold confession: He frickin loves dance flix http://t.co/1QjSBXdt","Remember that video of Brazilian bombshell Izabel Goulart we told you about? There are photos, too. You're welcome: http://t.co/1vxlVjdi","Not everyone is born with Superman's jawline. For the guy that could use a boost, try one of these glasses http://t.co/5r8lKrPU","Video: Victoria's Secret model Izabel Goulart tells us her ideal guy then breaks into a sexy samba. Just watch http://t.co/GkSIQ3CV","Bring this photo to your barber on your next cut. Thank us later. http://t.co/M6BmTf0I","Turn heads at your next conference meeting with one of these refined watches: http://t.co/IdM2daqo","This lower-body stretch is a sure fire remedy for joint problems. Just try not to giggle at this awkward pose http://t.co/9pXdJAGP","So what's up with that extra pocket sewn on suits these days? Allow us to explain: http://t.co/uBAeSRXs","RT @BrianCoatsBC: still at the office working- wondering what the editors over at Chic Chic magazine are up to? @fiercegrandma","RT @BrianCoatsBC: Got these today- hectic packaging but excited for a \"hair masque.\" #really?  http://t.co/OkxBDgUp","RT @theRealRichTong: Photo: for those of you who’d like another flavor of GQ, there’s GQ fashion. http://t.co/0Y4Qw9C1","Office Style Tip: When it comes to pocket squares, think outside the box. Try one of these bold patterned ones http://t.co/Gm8Z8XnK","Urban Outfitters and Dockers are doing a mobile shop, hitting major college towns. Bring the keg. http://t.co/GNa05QbX","Our street style photographer catches the best of Paris and Milan. http://t.co/At022SVh @jakandjilblog","RT @gqmagazine: Photojournalist Ken Regan hung out with Bob Dylan and Mick Jagger. We get the story behind the photos. http://t.co/aWJ42Sdp","Office style tip: Know Your Shirt Collars, especially the collar of choice this season http://t.co/QSh5cGOg","Chef Sam Talbot of NYC'S Imperial No. 9 shares his must-haves, including seafood-friendly red wine, Cartier, and more. http://t.co/4Gsb7h3I","Throwback soul singer Mayer Hawthorne shares his ten music style icons. http://t.co/0S0L7GY9 @mayerhawthorne","Office Style Tip: Go brash and bold with your shirt and tie combos. Here's some inspiration: http://t.co/SkMu8qQS","\"Blind faith in your leaders, or in anything, will get you killed.\" - Bruce Springsteen http://t.co/BIjOld5d","Burton & Carhartt's collab is perfect for the snowboarder who actually snowboards http://t.co/dJXuckhP @burtonsnowboard @Carhartt","We chatted with Mick Fleetwood about tequila, tutelage and touring with the 'Mac in 2012: http://t.co/srUkI9Nj","Get a head start on your winter weather staples with one of our favorite boots of the season http://t.co/0Pe2AsTq @RedWingShoes","Make a trip out to Philly to find pitch-perfect menswear shops and much more: http://t.co/IwepyxpX @visitphilly","Your daily case for the turtleneck's comeback. Are you with us yet? http://t.co/k1Uz99wJ","If you dig dapper yet eccentric style, flip through the Fine and Dandy Lookbook for inspiration http://t.co/0phoXsID","Must-have of the day: Ovadia & Sons Snuff Suede Milford Double Buckle Shoe http://t.co/EJdKKjGN @OvadiaandSons","Meet the best-dressed men in Europe with our fresh batch of street style shots from Tommy Ton http://t.co/At022SVh @JakandJilBlog","Exclusive: a first look at Uniqlo's brand-new flagship store on Fifth Ave http://t.co/LWO5oCT2 @UniqloUSA @UNIQLO_JP","Adam Kimmel, Leo Fitzpatrick and Nate Lowman in looks from Kimmel's fresh collab with Carhartt http://t.co/WhDZPGIF @Carhartt","This is how to dress for the office. Right now. http://t.co/iBkWVchJ","\"Simon Spurr is dope. Thom Browne is dope. I'm also real into Rag & Bone\"-Carmelo Anthony http://t.co/zSXyMM7E @SimonSpurrHQ @rag_bone","Kanye West joined Russell Simmons at Occupy Wall Street today. http://t.co/MLjath8D @kanyewest","Enter to win a fly new set of wheels, courtesy of your friends at GQ. http://t.co/O0rnzLGu","Deconstructing Beyonce's \"Countdown\" with co-director Adria Petty: http://t.co/00B8JU8l","Yeezy drops in on Occupy Wall Street rocking plaid, and accessorizing with gold chains, and Russell Simmons: http://t.co/qOknbZ3s","We talk haberdashery with the (Oxford-educated) dudes behind Ledbury. http://t.co/dQvsH1dn","A rugged bag, inspired by the outdoors, that's big enough to fit your MacBook. http://t.co/ewuPqeEs","Presenting a backpack, as art: Amber Jensen's Sketchbook series: http://t.co/L9g4LREE","Director Adria Petty defends Beyonce's 'Countdown' video to GQ. http://t.co/Oe633yzp","A camo brogue. We're serious (and it's awesome). http://t.co/7zLfUOEm","Our street style photographer captures the best of fall in New York. http://t.co/UUh5R3tv @benferrariPHOTO","GQ's five best ways to conquer the turtleneck sweater this fall. http://t.co/sg3JQHh9","So, what exactly goes into a thousand dollar pair of sunglasses? We check out Leisure Society's new jams (@ShaneBaum): http://t.co/csXIqm6j","These Leisure Society shades take luxury to a whole new level. http://t.co/IHpxDKHE","@shipley_halmos paid tribute to a few of their favorite artists with these hand-drawn album covers: http://t.co/B2TkXwRG","Your Morning Shot: Safe to say Paul Newman never much got into the practice of losing: http://t.co/1TaI3R7u","RT @BrianCoatsBC: I mean its a concernRT @martinjmarks: 'Chins down, children! You're not 4 years old anymore!' -- @BrianCoatsBC, to a g ...","We can't even enumerate all the things that are wrong with Jared Leto's outfit: http://t.co/dCElDDQF @jaredleto","RT @BrianCoatsBC: hmmm. interesting- it was his thing but not really for everyone Run on the Steve Jobs Turtleneck - @Gawker http://t.co ...","Wow—did dancing really make The David this ripped? http://t.co/NJQuokA1 @davidarquette","Donald Glover visits the GQ fashion closet to talk rap, Twitter, and how he can be the most famous Donald in the world: http://t.co/whf4TDmn","Ne-yo: Wearing a hat backwards, hovering on your scalp, is not a good way to dress down a tux jacket. http://t.co/AuVr1SNP @NeYoCompound","The perfect Timex watch as we head into Saturday, our \"Watch of the Week\": http://t.co/SHudhQp1","RT @BrianCoatsBC: \"I'm leaning like Pisa\" @CAMILLASTAERK @glemaud @MarcKroop","RT @BrianCoatsBC: Sweetie \"crop full body\" @CAMILLASTAERK @glemaud  http://t.co/RWtx7Mq5","RT @BrianCoatsBC: @GQfashion wants an exclusive on this bag. @item_idem is giving u Mondrianmessenger. @glemaud @CAMILLASTAERK  http://t ...","Feel good item of the day: Steve Jobs' favorite black turtleneck is selling like wildfire: http://t.co/H69KF0H0","Now presenting: (Occupy Wall) Street Style http://t.co/GeU5l9BH #occupywallst","RT @BrianCoatsBC: Just arrived- my new 'thornproof' tweed suit from #Jcrew. After it's tailored and gets cold I'll be ready.  http://t.c ...","Remembering a bright, young, fashion mind in Vogue Hommes International's Francesco Cominelli (words by pal Tommy Ton): http://t.co/rSTHsIcl","Get a look behind-the-scenes at Todd Snyder's New York showroom with @RyanPlett on Travel Well, we preview it, here: http://t.co/2mVJtgdH","RT @BrianCoatsBC: hey @juliakalach what's happening @GiveawayTable ? been a while.. we got a japanese fan, a summer scarf and season 3 M ...","Your Morning (Street) Shot: @Guerreisms snapped this photo of RL's John Wrazej at New York Fashion Week: http://t.co/NQnAJky1","Sean Sullivan of @impossiblecool gives us some background on his original pic of Wooster and why he'll be taking more: http://t.co/Spcb2J1D","@BrianCoatsBC loves these Alife Rivington Club x Warrior Footwear Classics. They're our Sneaker of the Week: http://t.co/JmUPFBAS","A motorcycle that charges in your wall outlet... what the F$&k?! Check out game changer @evolveelectric : http://t.co/aCEGQUSq","Our GQ.com managing editor cracked @carine_roitfeld 's new NSFW book, Irreverent, and it's meant to be shared: http://t.co/WhAtVksa","If you're in LA, you have to check out Band-alum Garrett Colton's new shop, Standard Goods: http://t.co/1jKyCilE","Why we'll be rocking less denim this fall... Closed's khakis and cargos are taking over the GQ offices: http://t.co/7CvDb0Ri","Still not convinced to rock a turtleneck this fall? DJ god Diplo makes a case for its comeback http://t.co/LaSQxT6q @diplo","RT @BrianCoatsBC: love this one-Sneaker of the Week: Alife Rivington Club x Warrior Footwear Classic: The GQ Eye: GQ http://t.co/HUiYVYO ...","Your Morning Shot: Prince Michael of Kent is a beast in a DB, and has some advice about shaking off the haters: http://t.co/wXdUmHgV","RT @Filson: We're proud of Filson guest blogger @mikaelkennedy on his new book \"Passport to Trespass.\" Great photo in @gqfashion! http:/ ...","Some of the coolest pocket squares and scarves we've seen recently? They're from NYC-based GREI: http://t.co/FWJiBxzd","This fall we recommend going gray. http://t.co/HGWOQE5i","This is really happening: Mike \"The Situation\" Sorrentino launching a formalwear line: http://t.co/r3B4GqCs @ItsTheSituation","RT @STANDARDGOODS: thanks @GQMagazine @GQfashion for the interview - http://t.co/y7PI7M7n","Original Penguin makes a car jump rope. http://t.co/B6eWBeYx @originalpenguin","RT @BrianCoatsBC: kids this is how we build a campfire in NYC.Tar smoke must be good for you. I'm sure the fruit vendor agrees. http://t ...","Find us tonight at the new Burberry Menswear and Womenswear shop opening at Bloomingdales http://t.co/jv5aoYPR @burberry @Bloomingdales","RT @gantrugger: Gentlemen Jim Moore and Michael Hainey talk NYFW via @GQfashion (video) http://t.co/IYLaAuDs","Jack Spade teams up with Coca Cola for a retro collection celebrating the brand's 125th anniversary. http://t.co/tITdOsW8","Some daily style inspiration, courtesy of Mr. Jude Law. http://t.co/vB2QMrJs","Cash money, baby wipes, and Hanes are on Mark McNairy's must-have list. http://t.co/v46RwSop @mmcnairy","Need a style upgrade? We're giving away a $10,000 fall wardrobe. Sign up here: http://t.co/xvH5pAGw","Like the fashion from our October issue? You can shop some of our favorite items right now on @parkandbond http://t.co/kAXeO6Tj","Fall is in full swing, but do you have the wardrobe to match? Get a crash course on this season's top trends at GQ Rules: http://gqrules.com","Up your fall wardrobe game with our picks from @BananaRepublic http://t.co/p653rdGG","that dude @StevenRojas shows us the proper form for @tedyounging and  @RugbyRL 's \"Tweed Run\" on October 15th: http://t.co/RsW5umBo","@plainjanehomme shows us how to \"Own the Night\"... A must for the modern playboy? The varsity jacket: http://t.co/Dd85RBVm","We talked to @Chromeo the boys from @Bdgastore and Bon Iver about drinking whisky: http://t.co/wevCMlIl (cc: BushmillsUSA)","A great way to get her in the sack? Make sure your bed looks just as sharp as your wardrobe. Get our guide here: http://t.co/wPwtvqlb","Providence Stand Up! @shopWharf presents their 2011 F/W Lookbook shot by @RyanPlett: http://t.co/1vH1sY0V","RT @sean_fennessey: Rap Nerds: An exclusive excerpt from the Def Jam 25 book on the rise of LL Cool J, at GQ.com. http://t.co/HP9DcvID","Your Morning Shot: Float like a butterfly, sting like a bee, and always rock Wayfarers at pressers: http://t.co/TtO91bO1","These boots are perfect for the office but don't look like you stole them from a longshoreman http://t.co/88wK2i79","RT @BrianCoatsBC: Cornflake-choc chip-marshmallow cookie. Holy shit thats good. Thanks #adamkimmel ! #momofuku  http://t.co/PR2RHFAL","Tommy Ton, the man behind the lens of our Fashion Week Street Scenes, shoots an ad campaign. http://t.co/C2M9GGRC","We're loving this campaign Tommy Ton (@JakandJilBlog) shot for Mr. B's Gentleman's Boutique/@aldo_shoes: http://t.co/YL4s0Ibu","Our Q&A with the dude behind FrenchTrotters. http://t.co/fWAxxY2y","WeSC and RZA have teamed up to create the perfect pair of headphones. http://t.co/CznIIxh0","The prolific Nike, Supreme, and Burton collaborator @Alex_Dymond shared with us his NYC-themed life essentials http://t.co/mWWqmUFv","Get a first look at the Ovadia & Sons Fall/Winter 2011 lookbook. http://t.co/YSaPUMeE","Thanks to dudes like @TheophilusL and @JayZ, snap-back hats are making a comeback. Here are five we like. http://t.co/ObQAYivJ","@ovadiaandsons Fall 2011 Lookbook featuring Ali of A Noble Savage and shot by @justinchung in BK: http://t.co/u9HKnfcS","Sorry guys: @AlanCumming, Penn Badgley, @KrisHumphries, and Hugh Laurie make our Worst-Dressed List. http://t.co/JdWpeyHe","Street Style, @WSJMag's first all-men's issue, @kanyewest's runway debut, and more in the morning roundup: http://t.co/WBDil9SJ","RT @BrianCoatsBC: This Food and Wine Festival is going pretty well so far. #thingsthatdontsuck  http://t.co/EfPAa4KK","RT @BrianCoatsBC: Another shoot pic of Ted- guarding the watches. #therewillbeflipflops http://t.co/ozsz9dIp","RT @BrianCoatsBC: To quote @richardblandino best thing about shooting on a weekend is seeing GQ's Ted Stafford's casual looks.  http://t ...","Chatting with Chad McQueen about his pops at the opening of the SoHo Barbour store: http://t.co/30PeE3yR (@barbourofficial)","Tommy Ton's Street Style: London http://t.co/T4xdfDGU","Those crazy mad-shoe-scientists at @FEITDirect have killed it again for next spring: http://t.co/PzoCIsQU","This month, a Gossip Girl star, the newly minted Mr. Kim Kardashian, and an Emmys attendee made the worst-dressed list: http://t.co/JdWpeyHe","Your Morning Street Style shot is this gem taken by @brentherrig for @houseofmcnairy: http://t.co/5Pncon4a (cc: @mmcnairy)","RT @SartoriallyInc: Check out a little @mmcnairy and @bpmw on @gqfashion as shot by @dr_tacomd - http://t.co/k3jzUvfA","GQ Eye Exclusive: Lebron James (@KingJames) drops his Holiday Collection for Nike Sportswear tomorrow, 10/1: http://t.co/jAGwRzSN","Look of the day: A.P.C. to open West Village store in December on Perry Street: http://t.co/RAZfjjup","Ryan Plett's Travel Well hits New York for the Alfred Sargent made-to-measure event at Leffot: http://t.co/Mj4l1m9P","@ryanplett takes us on another photographic journey to NYC, where he hits up @leffot aka shoe heaven (@alfredsargent): http://t.co/OFlA1wYu","Kid Cudi (@wizardcud) was on Conan last night in @NikeB4TF and showing off his @surfacetoair collaboration: killer! http://t.co/ScvfIto7","Tailored sweats and a camo vest are just a few of the must-grab items as @BurkmanBros launches e-commerce site today: http://t.co/lKBQ0uI3","Your Morning Shot: Dandy Andy Warhol discusses the details... sort of: http://t.co/at8GhK5C","Jay-Z and Adidas to design new unis for the Brooklyn Nets. Let us guess, \"all black everything?\" http://t.co/GveihmzQ","Going behind-the-scenes with a mohawk'd @mmcnairy for his first women's collection - footage by @isaaclikes: http://t.co/ELeT5NFf","GQ Eye @SHotchkissNYC represents his homestate of Maine with these Yuketan boots. http://t.co/FjZIniDq","Our obsession today? These handmade navy blue beauties from @yuketenfootwear  #wealth: http://t.co/WSaYGYUc","Our editors make fall style simple with our how-to video series, GQ Rules. http://t.co/kJbEjpj8","Sock it to 'em with this pair from Cali brand Stance. http://t.co/JWWd8nAc","\"American Apparel told me that I'm not in their internet budget.\" - @Sartorialist Scott Schuman. http://t.co/wrVB6VtI","Is Scott Schuman the Kanye West of fashion bloggers? Check out his interview with The Talks: http://t.co/2sb0R6qd","RT @GQMagazine: Now endorsing: the 'incredibly fly' bomber jacket. http://t.co/yrRBjbW0 @BLKDNM @dolcegabbana @dieselusa @JColeNC","Tommy Ton brings in the latest men's street style shots from London. http://t.co/T4xdfDGU","Entrepreneur and shoe designer Alex Dymond shows us his favorite hat, restaurant, and more. http://t.co/mWWqmUFv","Your Morning Shot: a killer Polaroid courtesy of Mikael Kennedy. http://t.co/vacXM5e7","@BrianCoatsBC hits us with his latest Sneaker of the Week, this one is from @Reebok, and perfect for the gym: http://t.co/dS4L7ElZ","@dsdundee killed it with their A/W 2011 collection and lookbook, here is proof: http://t.co/us3uG3Ux","Chatting with @BRERA_OROLOGI on their watch collab with Carlos Campos http://t.co/VA6oqFRe @CarlosCamposNYC","The best #menswear look of the day, courtesy of the @Sartorialist http://t.co/wSrxQCwv","Here's your first look at Bonobos Spring 2012 collection: http://t.co/y9Xohq21 @Bonobos","Want to smell ridiculously good this fall? Pick up one of these scents: http://t.co/XVoGQzBS","RT @BrianCoatsBC: Check out my custom shirt pic and those of some other super cool peeps. @nixcruz @DetailsEugene - http://t.co/uldzFqFs","Your Morning Shot: Bob Marley: who, among his other talents, could apparently predict the future: http://t.co/CFwWEv1a","RT @BrianCoatsBC: Wonder how Fiddy knew I needed a boost? No day off at least I have a new energy drink w a social conscience.  http://t ...","Rising hip-hop star J. Cole shows how to wear one of fall's biggest trends, the bomber jacket, four ways http://t.co/ats9K58i @JColeNC","Your wrist game needs to be as streamlined as your suiting. Check out @tateossian for some grown-ass-man bracelets: http://t.co/ac4dgMeW","Some must-see kicks from @Walkovershoes x @NicholasKStudio for NYFW:  http://t.co/d2GfU3w4","Hitting the high seas with @Bonobos on the Black Knight #denimiscoming SH http://t.co/pOTPW4tp","If you buy one of these jackets, you'll be helping Disaster Relief in Japan. And your wardrobe. http://t.co/HFuGZDD8","GQ Eye @SHotchkissNYC is wearing Ray-Ban's latest: The Signet. http://t.co/XoaeLTok","Teddy bear with Terry Richardson's face on it. Hilarious or creepy? http://t.co/NUjl8Sgg @terry_world","A new batch of Tommy Ton's Street Style photos, fresh from London. http://t.co/T4xdfDGU @JakandJilBlog","The perfect cure for the Monday blues: Lara Stone wearing next to nothing... on a beach. http://t.co/PWNc2mXp @inezandvinoodh","Emerging style guru Jesse Thorn takes us on a shopping tour of Los Angeles, from sneakers to suits. http://t.co/6UgbY8sR @JesseThorn","Muji's knit blazer, how-to-be-a-blogger, @Racked's interview with Jamie McCarthy and more in our style roundup: http://t.co/Oi1RzZsK","RT @BrianCoatsBC: @diplo at first I thought your car was hijacked...#misunderstood  http://t.co/xHRBGmRN","RT @BrianCoatsBC: Why is this sign on a refrigerator exactly?  http://t.co/8Rcjr985","Bieber is mad because Usher just copped a feel, and Selena didn't stop him. Allegedly. http://t.co/dx3A9WGa @justinbieber @selenagomez","Fashion Week may be over, but the men of New York never take a break. Ben Ferrari's got you covered for street style: http://t.co/kPtUyQPT","Onassis just sent half our staff a piece of leather. We have no idea what to do with it! Here, ten guesses: http://t.co/KGazVimk","Wooster's a hero. Possibly even an action hero: http://t.co/sHWUTBz2 @NickWooster","RT @BrianCoatsBC: Location van power outage- van driver blamed it on the mysterious curling irons. #umdonthaveany","Justin Theroux, Taylor Lautner, and David Arquette dressed like they were attending a masquerade ball. (They weren't.) http://t.co/HOlOFXUX","Check out these Benson corduroys. They fit perfectly—trim and tapered, but not crazy slim: http://t.co/imQr2Wq9","According to @womensweardaily Dolce & Gabbana is folding D&G. Does that make this their last men's collection? http://t.co/fnBeH65c","Soft cotton tees, henleys, and boxers are perfect for smoking in cracked leather chairs and acquiring shiners: http://t.co/gObQimTt","RT @BrianCoatsBC: Shoe- distressing 101 is happening.  http://t.co/GyloKR8A","If you like huge-ass machines, crazy gyrating dancers, and/or French people, you'll probably dig this video: http://t.co/gGxkg8iW @LACOSTE","Nudie Jeans is throwing down their cards at the LA denim table with a new outpost in West Hollywood: http://t.co/1ieP311F @nudiejeans","This Just In: Jack Spade is getting into the suiting game http://t.co/BFt15DVv","Remember that sexy semi-nude photo shoot we did with Lara Stone? Oh yeah, there's video too. http://t.co/O9bN0p3a","We shot sexy supermodel Lara Stone at the beach. Sorry we forgot the bathing suit. http://t.co/PWNc2mXp #semiNSFW","RT @BrianCoatsBC: Wow Norma Desmond called and she wants her location van back. #LA http://t.co/1akUtast","Whips, chains, and stripper poles: an afternoon affair with @jpgaultier at their secret spot in midtown Manhattan SH http://t.co/6inR1RUe","Meet the guys competing for New York's Golden Gloves boxing title. http://t.co/ZIDor2Z0","\"If you wear a polo + chinos to work every day, why shouldn't you have the best example of those pieces?\" @MBastianNYC http://t.co/zGaFwoH8","The GQ Eye scopes out Barneys' newest fragrance line, Arquiste. http://t.co/LzsW2fJc","Design maven Domenico Vacca shares his most essential items: from vino to espresso to... denim. http://t.co/RugPcpbg","@dolcegabbana 's D&G and @SkullCandy give you a killer, colorful way to blast beats: http://t.co/qpEyQKvy","A great new line of fragrances, \"Arquiste\" by Carlos Huber just dropped at @BarneysNY this week: http://t.co/54MAjnj2","Brands so cool almost nobody knows about them... at a discount. It's true. http://t.co/PyzdBLx5","Our \"Look of the Day\" yesterday came courtesy of @redwingheritage and their Puritan warhorse: http://t.co/hfv1K5sW","RT @juliakalach: The headset double kiss is the equivalent of the media alert cc: @BrianCoatsBC @LombardoTreena","RT @BrianCoatsBC: Dear publicists- \"hope you survived fashion week\" has been taken as a greeting already. It REALLY has. I mean it. Than ...","Get ready for fall style with our Creative Director Jim Moore's Rules of a Modern Gentleman. http://t.co/vxKTV7Vo","Our official guide to the most stylish directors of all time. And Woody Allen made the list. http://t.co/bk2XewPw","The @Sartorialist snaps our Deputy Editor, Margiela's new bags, touring with the Stones, and more: http://t.co/WxZ6o56j","Bastian: \"Thom Browne was the first guy several years back to rattle the cage and say \"Hey! Pay attention to American designers\" SH","Bastian on rules: \"The minute you say 'never do that' is the minute you're going to see someone doing it, and killing it\" SH","Basty on blogs and the web: \"every opinion and review is equal, some people just have a bigger microphone\" SH","\"If you wear a polo shirt and chinos to work every day, why shouldn't you have the best example of those pieces?\" says Bastian. SH","Michael Bastian says this female model's nip-slip during his runway show was unintentional. What do you think? http://t.co/jvG76zJ7 #NSFW","Michael Bastian says this female model's nip-slip during his runway show wasn't intentional. You be the judge: http://t.co/jvG76zJ7","2012 Basty nipplegate \"wasn't intentional\" SH","On my way to soho to watch @mbastiannyc preach. #guru SH","RT @BrianCoatsBC: love these K Swiss...BC  http://t.co/Ld9KqszV via @gqmagazine","Every man needs a good travel bag, and this line of luxurious leather goods is a wise investment: http://t.co/csBfoiJQ","Q&A with Sam Hubler of the Nick Wooster-approved label Raval & Knight http://t.co/AFpXzII0 @ravalandknight","Ryan Plett continues to share his travels with us. Next stop? Kansas City, Missouri: http://t.co/YMNn2pMw @RyanPlett","@TOMS and Trovata's John Whitledge teamed up on a line of sunglasses. Watch John and Blake Mycoskie discuss the collab http://t.co/XNEOX0Hh","Check out the most stylish cars (and one super-smart bike) at this year's Frankfurt Auto Show http://t.co/Y768m5Ey","Today's style inspiration comes courtesy of the always-dapper John Legend http://t.co/d3CRHLkt @johnlegend","In sad news, Kevin Willis debuted a clothing line. http://t.co/54dyNRog","Are you man enough to embrace the revival of the DB? (That's double-breasted jacket, for you amateurs.) http://t.co/t6Y9pySJ","RT @michaelb4jordan: Make sure you guys grab the Oct. issue of GQ..they blessed me with a fashion spread let me know what you think http ...","RT @SartoriallyInc: Shitty, but still more wearable than Galliano - http://t.co/iPzngumI","Ian Somerhalder, Adam Scott, and Jon Hamm play it safe, but cool, at the Emmys. http://t.co/2aw3oRjJ @iansomerhalder @mradamscott","@MODELLOUNGE x GQ: Model iD - Like the world's most outrageously awesome speed-dating session with NYFW's finest: http://t.co/rkk2l1bH","The only dude making gin in Brooklyn since Prohibition, and he's starting from scratch: http://t.co/atxqdkaz","Cory Monteith may have a GQ cover, but he was our pick for worst-dressed at the Emmys. http://t.co/0jaXxotA @corymonteith","The best (and worst) of men's fashion at the Emmy Awards, featuring Joel McHale in a @MBastianNYC tux. http://t.co/0jaXxotA @mbastiannyc","Our editors pick the best of New York's mens collections. http://t.co/5EY1MJG7 #nyfw","The latest in street style from Fashion Week, snapped by Tommy Ton. http://t.co/KgPiqPjr #nyfw @JakandJilBlog","Al Pacino's 'Serpico' and 70s swank inspired the look for our shoot with Justin Theroux. Check it out here: http://t.co/csXdYy8P","Supreme's first UK store, Banksy vs. Robbo, Common Projects Spring 2012, the new Timex, + more in our morning mashup: http://t.co/dXN7oeK8","@MOSCOT 's Terry now comes in sunglass form - get downtown dirty brown with it: http://t.co/H6kGZyEq","RT @BrianCoatsBC: Love these- BC Sneaker of the Week: Adidas for Yohji Yamamoto X Collection: The GQ Eye: GQ http://t.co/LzsuzDHx via @g ...","Sartorial skating through Paris with ASOS: http://t.co/tpog6boI","We go side-by-side with Justin Theroux and Al Pacino in our recent Serpico Shoot: http://t.co/eZLKmgF4","Ian Velardi's sharp and sexy F/W 2011 Video: http://t.co/u9ldLShO","RT @BrianCoatsBC: I mean I can really work a showroom. #5minappt #gqrules","Brad Goreski, a Week in Style regular, made the bold plaid look work in a dinner jacket: http://t.co/M0EbH2da","This season on the runways we saw a ton of hooded outerwear. See all the looks that will keep you dry in 2012: http://t.co/QGIMhxde","Check out the Ace Hotel x Wings + Horns x Beams Capsule Collection, and hell, why not get in the boxing ring yourself? http://t.co/j0PJxLgH","Disclaimer: Watching this film may lead to the purchase of fine tailored clothing, and/or shopping for new girlfriend. http://t.co/qkXSvsOg","The Week in Style: Jon Hamm tests the limits of his handsome, and the Amazing Jonah Hill is Shrinking Tour continues. http://t.co/96HOroGC","Your Morning (Street) Shot: Tumblr Boyz. http://t.co/BcCLeUj6","Not a high-top kinda guy? These sneakers from fashion legend Yohji Yamamoto just might change your mind: http://t.co/zWHTPuom","GQ favorite Philip Crangi let his presence at Fashion Week be known with a pop of color: http://t.co/NaUsKaBA","Introducing Travel Well by Ryan Plett, highlighting the elements of a well-lived life in any destination: http://t.co/r3omKHGt @RyanPlett","A few images from the UNIQLO Innovation Project. Because let's be honest, Uniqlo pretty much runs NYC these days: http://t.co/YS3Ty96Y","RT @BrianCoatsBC: The very secretive Ted and I continue to pick the same looks! GQ's Editor's http://t.co/lm7Uz1wl via @gqmagazine","Best couple of fashion week- Teresa and Anderson at Gant with their adorable baby Zaria. BC  http://t.co/TtEyxuiH","Did you miss all the mania of #nyfw? We recapped all the shows you need, right here http://t.co/2Tz7SLXB","Actor and Jennifer Aniston's man Justin Theroux channels Al Pacino in a new GQ fashion spread: http://t.co/V0vRNzda","Your Morning Shot: A kick-ass snap of Leonardo DiCaprio by Craig McDean from our October issue: http://t.co/g0dxq5hb","This just in: The full Yigal Azrouel Spring 2012 collection from New York Fashion Week http://t.co/KKLOyWqn #nyfw @YigalAzrouel","Creative Director Jim Moore on the things to buy right now, available from @ParkandBond. http://t.co/I81jx1AS","We chat Prouvé, furniture, and sex with G-Star's global brand director. http://t.co/2U92GJDH @gstarraw","RT @BrianCoatsBC: Love when Bill Cunningham looks at GQ's Madeline Weeks and says \" Good morning child.\" #nyfw","This just in: The full Michael Kors Spring 2012 collection from New York Fashion Week http://t.co/88uQwUFO #nyfw @michaelkors","Video: Yigal Azrouel Men's Spring 2012 http://t.co/A3uqXd2 #nyfw @YigalAzrouel","The GQ Eye @SHotchkissNYC snapped a pic of the great Richard Haines during the Fashion Week madness. http://t.co/YnOkhnO #nyfw","GQ's favorite party photos from New York Fashion Week. http://t.co/4YInqFJG #nyfw","@JakandJilBlog out on the street getting sunburned to bring us all awesome streetstyle. MH  http://t.co/sppCzCQN","some guys next to me were srsly bummed when they discovered this model is in fact hiding a speedo-AR #gantbybastian http://t.co/hiYnE7Vl","turtle time at gant by bastian -AR http://t.co/Y17OhpV","The tie bar you need. http://t.co/7ZMWJMn","In our Fashion Week Photo Journal, Backyard Bill presents Fashion Week's most dapper gentlemen. http://t.co/wAmxVdV @backyardbill #nyfw","The latest in Street Style from New York Fashion Week, courtesy of Tommy Ton. http://t.co/HKeuELi #nyfw"]