["\"I suggest that if you know history, then you might not be so easily fooled by the government when it tells you... http://t.co/NglOLdtb","Wars spring from unseen and generally insignificant causes, the first outbreak being often but an explosion of anger.-- \nThucydides","Histories are as perfect as the Historian is wise, and is gifted with an eye and a soul. - Thomas Carlyle","Hegel was right when he said that we learn from history that man can never learn anything from history. - George Bernard Shaw","RT @philosophytweet: “Every day of your life is a page of your history.”","Anyone who conducts an argument by appealing to authority is not using his intelligence; he is just using his memory.--Da Vinci","All our knowledge has its origins in our perceptions.--Da Vinci","Test","RT @economytweets: @iPocketComputer-- Brands create communities. Social media and networking facilitate multi-dimensional... http://t.co ...","“To omit Calvin from the forces of Western evolution is to read history with one eye shut.”\n\n— Lord John Morley","RT @ipocketcomputer: The new iPad will be available March 16, and Apple is taking orders starting today.","Alex Salmond, who runs Scotland’s semi-autonomous government, plans a vote on independence in the second half of... http://t.co/n1BUmsN2","@HawaiiTweets --Kajukenbo is a hybrid martial art that combines Western Boxing, Judo, Jujutsu, Kenpo Karate,... http://t.co/nBsqFgxz","How do you know the company you own will be worth anything when you retire?  It helps to know financial history.","Travel Destination\n\nCampaign Goals\n\nDrive site traffic, interaction with Travel Destination Web Site.\n\nSolution... http://t.co/MoBqPCPq","Success depends upon previous preparation, and without such preparation there is sure to be failure.-Confucius","Study the past, if you would divine the future.\n-Confucius","The days that are still to come are the wisest witnesses. \nPindar","Bohemianism is the practice of an unconventional lifestyle, often in the company of like-minded people, with few... http://t.co/rNo2dd4m","If you must break the law, do it to seize power: in all other cases observe it. -Caesar","Fortune, which has a great deal of power in other matters but especially in war, can bring about great changes in... http://t.co/LJ3gG6aa","It is not these well-fed long-haired men that I fear, but the pale and the hungry-looking. -Julius Caesar","The keystone of the Fascist doctrine is its conception of the State, of its essence, its functions, and its aims.... http://t.co/ee2vwLUQ","“When I look on you a moment, then I can speak no more, but my tongue falls silent, and at once a delicate flame... http://t.co/k9G3Xqm","Everybody and everything has a history.","Americans' confident belief in the uniqueness, yes the exceptionalism, of their country, rested on an essential... http://fb.me/S6Kbc4ai","History is probability too.....","http://earthquake.usgs.gov/regional/nca/wg02/results.php http://fb.me/ymT8WNEU","Aspasia was Pericles's \"Heitara\" who taught him oratory and wrote his speeches.","John Calvin did not create Predestination.  Augustine, Luther, Aquinas, and Jonathan Edwards all believed in Predestination.#Theology","To have another language is to possess a second soul. \nCharlemagne","You will never see the @Jetsetbohemian and @UnknownPhilosop on facebook.  Twitter and blogs only...Knowledge is power and money!","RT @certaindream: Dream Probability, Odds of dating a millionaire: 215 to 1","Practice what we preach? Think Big:  PhilosophyTweet Seminars The Ritz Paris -via @JetSetBohemian The Ritz Paris: http://ow.ly/5tNMF","I am promoting Twitter over faceBook, my firm considers the pocket computer to be the device of the future.-@ipocketcomputer","HootSuite http://ow.ly/5mvOE","RT @ipocketcomputer Try the HootSuite dashboard to manage and monitor your social profiles http://ow.ly/5lMiM","Manizales is a city and municipality in central Colombia, capital of Department of Caldas and part of the region... http://fb.me/145e7nwfS","RT @philosophytweet: To make a difference you have to see the difference.","Selfishness distorts history.  History is not any ones.","'The Beginner's American History' via @historytweets http://amzn.to/lthyga","101 Great American Poems: http://amzn.to/lpuAfl. @usahistory","@usahistory 'The Vintage Book of Contemporary American Poetry' by J.D. McClatchy (Paperback -... http://amzn.to/jfv58G","Check out 'The Illustrated Encyclopedia of Rifles and Machine Guns: An illustrat...' by William Fowler, Patrick Swe... http://amzn.to/letrZh","RT @europeanhistory: \"You cannot feed the hungry on statistics.\" \nHeine.","“Morals are in all countries the result of legislation and government; they are not African or Asian or European: they are good or bad.”","“On Hawaii: The loveliest fleet of islands that lies anchored in any ocean”-\n Mark Twain","RT @hawaiitweets: 'Sailing for the Sun: The Chinese in Hawaii, 1789-1989' by  (Hardcover - Jun 1990) http://amzn.to/ja8ksQ http://fb.me/ ...","history china: Books http://amzn.to/mzTW7G http://fb.me/tQSU7pao","The Oxford History of World Cinema http://fb.me/LxHZ2JhR","“Our love of what is beautiful does not lead to extravagance; our love of the things of the mind does not make us soft.”- Pericles","“Freedom is the sure possession of those alone who have the courage to defend it.”- Pericles","Pericles of Athens and The Birth of Democracy\nhttp://amzn.to/jmYBn2 http://fb.me/RzN54xff","Pericles of Athens and The Birth of Democracy\nhttp://amzn.to/jmYBn2 http://fb.me/12in5efYF","Pericles of Athens and The Birth of Democracy\nhttp://amzn.to/jmYBn2 http://fb.me/IK63SzNL","“Time is the king of all men, he is their parent and their grave, and gives them what he will and not what they crave.”- Pericles","“We do not imitate, but are a model to others”- Pericles","“Just because you do not take an interest in politics doesn't mean politics won't take an interest in you”- Pericles","Life on Mars: Poems\n\nhttp://t.co/RDwIM4p","The laptop is dead.  Long Live the pocket computer. -@iPocketComputer","A Pakistani provided live Twitter updates on the raid that killed Usama bin Laden, without realizing it.\nhttp://ow.ly/1sMP5S @EconomyTweets","@TMG_BARITONEX You think Bin Laden's philosophy had no impact?","Who is interested in meeting up with PhilosophyTweet in Amsterdam, Hong Kong, Santiago, Chile, Honolulu and Rio?\nWe are planning seminars.","The truth is in nature, and I shall prove it. -Cezanne","The artist makes things concrete and gives them individuality. -Cezanne","Genius is the ability to renew one's emotions in daily experience. -Cezanne","A short saying often contains much wisdom. -Sophocles   Twitter's Raison d'être. #TwitterViral via @PhilosophyTweet","Do not consider painful what is good for you. -Euripides","In this world we become who we are through our alliances.","RT @europeanhistory: \"All the knowledge I possess everyone else can acquire, but my heart is all my own.\" Goethe.","For most people money and religion is more important than education.-@tylerinvestment","RT @mssuzcatsilver: RT @SonicLogic: Tweet things that are important to you.  People want authenticity and interesting content.","“All Bills for raising Revenue shall originate in the House of Representatives…”  The Constitution, Article 1, Section 7.","RT @economytweets: Hire an adviser in the .005% category and you will be successful.","Did our ancestors get us to where we are?","RT @philosophytweet: @philosophytweet will be holding a seminar in Santiago, Chile in the spring along with Latin American History.","“We will either find a way, or make one.”-Hannibal","“Gladiator”-Hannibal","“ignorant, unwashed, insufficiently fed; but he had as good a heart as ever any boy had.”- Hannibal","The people to fear are not those who disagree with you, but those who disagree with you and are too cowardly to... http://fb.me/FP97av0a","The truest wisdom is a resolute determination.-Napoleon Bonaparte","The strong man is the one who is able to intercept at will the communication between the senses and the mind.-Napoleon Bonaparte","http://historytweets.blogspot.com/2011/01/guatamala.html http://fb.me/QuthCLuG","How much is a Colt 45 from the Battle of The Little Bighorn worth? http://fb.me/QwA675Rv","\"Jet Set\"-the lifestyle of traveling from one stylish or exotic place to another via jet airplanes.","\"Jet set\" is a journalistic term that was used to describe an international social group of wealthy people,... http://fb.me/PZYr96vU","\"They do not have clerics ready to mesmerise people and preach obedience to the rulers.\"- al-Nogaithan","“The revolution was possible in Tunisia because it is secular state,’’ Mr al-Nogaithan said. ``They do not have... http://fb.me/FkSwxdJN","The spirit of man is more important than mere physical strength, and the spiritual fiber of a nation than its wealth. -Eisenhower","The history of free men is never really written by chance but by choice; their choice! \n-Eisenhower","Anarchism is founded on the observation that since few men are wise enough to rule themselves, even fewer are wise enough to rule others","Very\n few things happen at the right time, and the rest do not happen at \nall:  the conscientious historian will... http://fb.me/Ple0q2AD","History is a cyclic poem written by Time upon the memories of man.  ~Percy Bysshe Shelley","Revolutions are not about trifles, but spring from trifles.- Aristotle","en.wikipedia.org/wiki/Black_Friday_(shopping) - Cached","History is a teaching tool","Hubris often indicates being out of touch with reality and overestimating one's own competence or capabilities,... http://fb.me/LpaVIV8F","Courage is rightly esteemed the first of human qualities... because it is the quality which guarantees all others.... http://fb.me/L0PVmb8u","A fanatic is one who can't change his mind and won't change the subject. -Winston Churchill","Europe was created by history. America was created by philosophy.- Margaret Thatcher","Jean-Michel Basquiat (December 22, 1960 – August 12, 1988) was an American artist and the first artist of African... http://fb.me/HBrszYfa","Basquiat worked on his paintings in Armani suits, and often appeared in public in the same paint-splattered $1,000 suits.","In 1981, Rene Ricard published \"The Radiant Child\" in Artforum magazine, which brought Basquiat to the attention of the wider art world.","On May 14, 2002, Basquiat's Profit I (a large piece measuring 86.5\"/220 cm by 157.5\"/400 cm), owned by drummer... http://fb.me/DpZt5FsT","I posted a new photo to Facebook http://fb.me/M8DZc4qD","Untitled Painting by Jean-Michel Basquiat http://fb.me/Hz1Uy1Bq","Artist Jean-Michel Basquiat briefly dated then-aspiring performer Madonna in September 1982.","Sera esta la tierra donde puedo encontrar la Fuente De La Juventud.-Ponce de Leon","History is Philosophy teaching by examples. -Thucydides","Generals and statesmen loved him: the world he drew was theirs, an exclusive power-brokers' club. It is no... http://fb.me/J5blLffi","Blind and immoderate behavior leads to one's downfall-@UnknownPhilosop","Tragedy advances a counter-intuitive thesis: that efforts to limit suffering through the accumulation of knowledge... http://fb.me/Irc9mNyk","Tragedy confronts us with our frailties and limits and the disastrous consequences of trying to exceed them.-Lebow","Greek tragedy was rooted in the empirical observation that there is no relationship between justice and suffering.","Thucydides had a deeply ambivalent view about democracy: on one hand, Thucydides' own \"wisdom was made possible\"... http://fb.me/KcoKmZfk","Golf was clearly becoming popular in the middle ages, as the game was banned in 1457 by King James II of Scotland... http://fb.me/sI4FV0Kx","Great article by John Kay:  http://www.ft.com/cms/s/0/902fc3d8-d0b0-11df-8667-00144feabdc0.html http://fb.me/InD6lyvG","The Christian religion began with a few people breaking bread in a back room. By the time the Roman Catholic... http://fb.me/IZ59GAQr","The defining characteristic of civilisation is the complexity of its organisation. But complexity breeds... http://fb.me/z5CPmlV7","The trouble with our times is that the future is not what it used to be. Paul Valery","Cynicism:The original cynics were Greek philosophers in the 4th century BC. \nThey believed in rejecting... http://fb.me/vvghS2Rv","Benjamin Franklin: A place for everything, everything in its place.","History is written daily... and \"rewritten\".","The term ‘history’ is derived from the Greek word ‘historia’ which means ‘information’ or ‘an enquiry designed to... http://fb.me/GMPT5MaK","To understand the actions of today, understand the history of yesterday","http://www.patagonia-argentina.com/i/content/parques/parques9.php http://fb.me/ELTzCAQ6","He who is fixed to a star does not change his mind. -Leonardo da Vinci","\"Democracy is the \nbest form of the worst type of government\"\n- Winston Churchill","I have never had much sympathy for the point of view, \"it isn't whether you win or lose that counts, but how you... http://fb.me/GbLBJksA","We all become history at some point in our lives...","Iraq arms inspector Blix warned of weak war evidence http://bit.ly/d1tkx2","“The supreme excellence is not to win a hundred victories in a hundred \nbattles. The supreme excellence is to... http://fb.me/Fhx6MyCV","History is taught to give us insights why it is being repeated over and over again","Napoleon Bonaparte: Corsican by birth, french by choice","\"When small men begin to \ncast big shadows, it means that the sun is about to set.\" Lin Yutang","Vodka  is a clear, typically colorless liquor, \nusually distilled from fermented grain \nExcept for insignificant... http://fb.me/D4VUAbYL","Poland lays claims to having distilled vodka even \nearlier in the 8th century, but as this was a distillation of... http://fb.me/yI3HtDii","The word «vodka» has been known since the 17th century and is most \nlikely a derivative of «voda» (water). In the... http://fb.me/CN327FwP","Nothing endures but\nchange.\n- Heraclitus, \n500\nB.C.","\"America is much more than a geographical fact. It \nis a political and moral fact - the first community in which... http://fb.me/APtkQw2q","“Where liberty dwells, there is my country.”\n\n ~ Benjamin Franklin","It is not worthwhile to try to keep history from repeating itself, for \n        man's character will always make... http://fb.me/vYwDD9LC","A small body of determined spirits fired by an \nunquenchable faith in their mission can alter the course of... http://fb.me/CFaSal2Q","Revelation can be more perilous than Revolution. -Vladimir Nabokov http://fb.me/ChUfa6OG","\"History is philosophy teaching by examples.\"-Thucydides. http://fb.me/DtLTAuBc","History Tweets is now on Facebook and on HistoryTweets.BlogSpot.com. http://fb.me/C9CebYcF","Thucydides: http://HistoryTweets.BlogSpot.com","Political Realism views the relations between nations as based on might rather than right.","Thucydides has also been called the father of the school of political realism, .","Nicolas Poussin was a French painter in the classical style. His work features clarity, logic, and order, and favors line over color.","Inspiration of the Poet by Poussin: http://en.wikipedia.org/wiki/File:Nicolas_Poussin_055.jpg","History is Philosophy teaching by examples. -\nThucydides","The secret to happiness is freedom... And the secret to freedom is courage. -\nThucydides","Thucydides has been dubbed the father of \"scientific history.\"","Few things are brought to a successful issue by impetuous desire, but most by calm and prudent forethought. -\nThucydides","The strong do what they have to do and the weak accept what they have to accept. -Thucydides","The bravest are those who have the clearest vision of what is before them, glory & danger alike & yet notwithstanding, go out to meet it.","We Greeks are lovers of the beautiful, yet simple in our tastes, and we cultivate the mind without loss of manliness. -Thucydides","Accumulated capital, not forced exactions, is what sustains wars.-Thucydides, The Peloponnesian War (1.141.5)","I am reading the book Churchill was reading for inspiration before the Boer war?","John Locke, George Berkeley, and David Hume were the primary exponents of British empiricism.","Empiricism is a theory of knowledge that asserts that knowledge arises from sense experience.","The Scottish Enlightenment was the period in 18th century Scotland characterised by intellectual & scientific accomplishments.","The Babylonians, Indians and Chinese appear to have been aware of the Pythagorean theorem several centuries before Pythagoras & the Greeks.","Japan moved towards modernization,Meiji Reformation, viewing China as an antiquated civilization, unable to defend itself against the West.","China has strongly influenced Japan with its writing system, architecture, culture, religion, philosophy, and law.","China and Japan are separated by only a narrow strip of water.","2005- Japan & and the United States issued a statement: \"the peaceful resolution of issues concerning the Taiwan Strait through dialogue\"","The Japanese govt. on July 16, 2008 decides to teach Japanese children that their country has sovereignty over the Kuril Islands","RT @SonicLogic: World's Largest Earthquakes: http://www.guardian.co.uk/world/2010/feb/27/biggest-earthquakes","RT @europeanhistory: Sir Isaac Newton's intellectual synthesis was advanced in Principia, the theory of Space-Time Continuum.","History is Philosophy teaching by examples.-Thucydides","RT @philosophytweet: Educate and inform the whole mass of the people... They are the only sure reliance for the preservation of our libe ...","\"Superstition sets the whole world in flames; philosophy quenches them\".-Voltaire","Voltaire was an Enlightenment writer known for his wit and his defense of civil liberties including both freedom of religion and free trade.","Voltaire's ideas influenced important thinkers of both the American and French Revolutions.","#FF @literalmagazine @EconomyTweets @HistoryTweets @HawaiiTweets @TylerInvestment @BankHawaii @HawaiiGolf @GolfTweets","HistoryTweets will have Tweets that will prepare you for College exams.","@krystal_xo15 People create history to achieve their ends.","History is the only laboratory we have in which to test the consequences of thought.","False history gets made all day, any day,\nthe truth of the new is never on the news.-Adrienne Rich","“There is a history in all men's lives.” \n William Shakespeare","“History is written by the victors.” \n Winston Churchill","History is a guide to navigation in perilous times. History is who we are and why we are the way we are.","In mass societies, myth takes the place of history.\rWilliam Bosenbrook","History is a myth that men agree to believe.\rNapoleon","Herodotos was a Greek historian who lived in the 5th century BC (c. 484 BC–c. 425 BC) and is regarded as the \"Father of History.\" i","\"We make war that we may live in peace.\" -Aristotle","Race for a first draft of history: http://is.gd/qHhf","Man is the measure of all things. \rProtagoras","RT @hawaiitravelorg: USS ARIZONA MEMORIAL http://is.gd/oTb4","Everything that exists is in a manner the seed of that which will be. \rMarcus Aurelius","RT @italytweets: The Grotta Palazzese is one of the most unique and interesting hotels in the South of Italy.  http://tinyurl.com/dh4gj5","Everything we hear is an opinion, not a fact. Everything we see is a perspective, not the truth. \rMarcus Aurelius","RT @europeanhistory: European History is the home of Julius Caesar, Da Vinci, Aristotle, Einstein, Mozart, Napoleon, Adam Smith, Jean Ca ...","RT @usahistory: Nietzsche said that he never traveled anywhere without a volume of Emerson's essays in his pocket.","RT @usahistory: His central doctrine was \"the infinitude of the private man.\"","RT @usahistory: Ralph Waldo Emerson May 25, 1803 – April 27, 1882 was an American essayist, philosopher, poet, and  transcendentalist.","historytweets is now following twitter.com/usahistory","historytweets is now following twitter.com/asianhistory, twitter.com/europeanhistory","She initiated a revival of the English sonnet, helped establish the conventions of Gothic fiction, and wrote political novels of sensibi ...","Charlotte Turner Smith (4 May 1749 – 28 October 1806) was a popular English poet and novelist during the last quarter of the eighteenth  ...","... that novelist Charlotte Turner Smith condemned her father for forcing her to marry and turning her into a \"legal prostitute\"?","Hemingway, Steinbeck, and Shakespeare on Twitterhttp://tinyurl.com/c96m2p","Known for his biting wit, he became one of the most successful playwrights of the late Victorian era in London,","...stories and one novel.","Oscar Fingal O'Flahertie Wills Wilde (16 October 1854 – 30 November 1900) was an Irish playwright, poet and author of numerous short...","Candide is the most widely read of Voltaire's many works, and it is considered one of the great achievements of Western literature.","\"all is for the best in the best of all possible worlds\". -Pangloss, in Voltaire's Candide.","....known for his wit, and defense of civil liberties, including freedom of religion and free trade.","Voltaire, was a French Enlightenment writer, essayist, and philosopher ...","based on self-governance, central emphasis on liberty, individual rights, reason, common sense, and the principles of deism.","The intellectual and philosophical developments of that age aspired toward more freedom.","in which reason was advocated as the primary source and legitimacy for authority.","The Enlightenment is a term used to describe a phase in Western philosophy and cultural life centered upon the eighteenth century","The background on HistoryTweets is \"The death of socrates\" by David"]