["Wreckage of 16th Century Spanish Ship Discovered off the Coast of Brazil: http://t.co/Wfu04smf","Artefact dug up on the Isle of Skye may be part of the oldest known stringed instrument in Europe: http://t.co/EvRgfIzJ","Collapse of Mayan Civilization Traced to Dry Spells: http://t.co/e96SgnJh","Archaeologists uncover 4,500 year old temple at the Sumerian city of Ur: http://t.co/PcylmpoW","'Little Horny Man' rock carving may shed new light on when the New World was first settled: http://t.co/U2ZrSJEa","How Much Would It Cost to Build the Great Pyramid of Giza Today?  http://t.co/Ny4MNMK5","Cave Excavation Reveals Water Management and Climate Change in Ancient Maya City: http://t.co/YIdAW53N","Researchers decipher several previously unknown Old Irish words from the Stowe Missal: http://t.co/OsEDCsZZ","Archaeologists on Sardinia re-assemble 2700 year old army of sculpted stone warriors:  http://t.co/OpQEGdOZ","Scientist proposes that Stonehenge's layout was based upon an auditory illusion:  http://t.co/aouxIZ8P","Artifacts from 8000 year old 'boat yard' shed new light on life in Stone Age Britain (video): http://t.co/Q30e5QnS","'Unique' coin from the reign of William the Conqueror discovered near Gloucester: http://t.co/fd08IxRW","550 Year-Old Stone Carvings Depicting Aztec Myths Found in Mexico City: http://t.co/yc7r1Q43","Archaeological discoveries are revealing the secrets of the Egyptian 'Terrace of the Great God': http://t.co/X489XcLc","Rare colour photos of U.S. troops before and after D-Day show World War II in a new light: \nhttp://t.co/dig0YPRU","Iron Age burial site discovered in India: http://t.co/Gh3fW0en","French archaeologists stumble upon perfectly preserved German World War One shelter: http://t.co/oEp5Q4eM","Team racing to dig up Waterfront ship in Cape Town: http://t.co/chHKtDY8","Dozens of Artifacts found in Chichen Itza Sinkhole: http://t.co/ZDxXvtcR","Archaeologists Uncover 4,000 Year Old Indus Seal: http://t.co/VHe49kGi","Jade mask found inside Pyramid of the Sun : http://t.co/H4cfCgT2","Viking Axe Head Discovery May Be Evidence of Battle: http://t.co/CTO9wnJZ","Only Known Sound Recording of Otto von Bismarck Unearthed: http://t.co/R71Q7PqO","Shipwreck hunters stumble across mysterious object in the Baltic (video): http://t.co/1k9bRMTF","Origin of 3,300 Year Old Jade Tool Baffles Scientists: http://t.co/ElJ5VefP","Meroe Period Temple Discovered in Sudan: http://t.co/fhmApOKP","Archaeologists Uncover 7,500 Year Old Fishing Equipment in Russia: http://t.co/ZgniJ6t9","Construction Workers Find Maya Artifacts Under Street In Belize: http://t.co/P06SBtQ7","Mysterious Roman Structure in Norfolk Puzzles Archaeologists: http://t.co/akjVRK2O","HMS Victory 'set to be recovered' from seabed: http://t.co/ym69TyOr","Arctic Canada caught on 1919 silent film: http://t.co/pigjtClq","Archaeologists unearth ancient Zapotec kiln: http://t.co/hy6soNt1","Ancient popcorn discovered in Peru:  http://t.co/sQ7xmtTD","2,200 Year old Astrologer's Board Discovered in Croatia: http://t.co/XvSILtun","Tomb containing treasured collection of ancient Egyptian artefacts found in Valley of the Kings: http://t.co/6lFuzNny","Bronze Age boat to be recreated in order to see how effective it was: http://t.co/SwUc92RV","Ancient image of Thracian horseman found in Bulgaria : http://t.co/hPOtTnLI","Island boatman may have found medieval fishing village in the Outer Hebrides:  http://t.co/7EcxkgXz","Divers find wreck of British submarine used in second world war : http://t.co/S9XURovY","200 Stone Age graves found in Yemen: http://t.co/TVo6ToVd","Unique Roman cavalry helmet pieced together 10 years after discovery: http://t.co/meGxzh6Y","Discovery of jade necklace from ancient Mayan ruler at Tak’alik Ab’aj: http://t.co/BhlO1IqN","Scientists crack medieval bone code:  http://t.co/fkD45wXD","2,000-year-old relief bust found in Turkey: http://t.co/Kbnm2pgL","Drought May Have Led to the Demise of the Ancient City of Angkor http://t.co/6yzfH1Xm","Shipwreck graveyard found beneath Australian carpark (video): http://t.co/EFUwa77V","Team uses high-tech optical technique to pull sound from 125 year old recordings: http://t.co/NR199aBd","San Francisco gold rush artefacts unearthed: http://t.co/KbgyiUhd","\"Golden Chief\" Tomb Treasure Yields Clues to Unnamed Civilization: http://t.co/unXvCXG4","New Excavations Provide Insights to the Rise of Pueblos of the American Southwest: http://t.co/Quc2rnqe","Deciphered Ancient Tablet Reveals Curse of Greengrocer: http://t.co/9JZZBv41","Well-preserved Tang Dynasty pottery kilns found in Xi'an: http://t.co/5PRQVG3r","Byzantine period bathhouse uncovered in Israel:  http://t.co/kfybQyPZ","Five shipwrecks from the 1500s to the 1700s discovered during renovation work in Stockholm: http://t.co/FIsZLDKy","Rio Cemetery sheds new light on horrors of slave trade: http://t.co/dWzWor70","Prehistoric settlement discovered in Serbia: http://t.co/ljiYyGLz","'Bronze Age' artefacts found at Anglesey Abbey: http://t.co/LDWhPOwe","Scientists discover source of rock used in Stonehenge's first stone circle: http://t.co/oYzEf44S","Archaeologists suggest that Ohio’s earthworks were created for more than farming: http://t.co/kiIUje2x","Peruvian mass grave unearthed where 60 people were sacrificed 1,100 years ago:  http://t.co/Izyf2GJb","Researchers Sequence Mongolian Genome Using DNA Of Genghis Khan Descendant: http://t.co/NYWQvCxL","Medieval knights feared post-traumatic stress: http://t.co/FqC3U7Tj","Newly translated Cuneiform texts reveal accounts of war and the use of beer tabs:  http://t.co/CCM1dClM","Football and bell ringing were deadly activities during Tudor times: http://t.co/f51AHmH5","Remains of Jane Austen's Steventon home unearthed: http://t.co/aiECGp24","Cockerel figurine found in Cirencester Roman dig: http://t.co/6lOyg7sE","London was built with the blood of British slaves: http://t.co/wBQCmfab","Archaeological digs help to shape picture of early St. Augustine, Florida: http://t.co/PEcaLRF9","Preliminary work to unearth ancient city of Isos begins: http://t.co/6Qhs9qQm","Original Ceremonial Offering Found At Teotihuacan's Pyramid of the Sun: http://t.co/Q581vkXp","Chinese Archaeologists Find 3,600 Year Old Palace: http://t.co/bcAx3WgQ","Divers retrieve prehistoric wood from Lake Huron: http://t.co/BgE5NcOC","Archaeologists excavate sculpture workshop in Angkor: http://t.co/oqdLO68x","Archaeologists Hoping To Reveal Secrets of Edinburgh Old Town: http://t.co/roNFMzIR","Bronze / Iron Age Skeletons Uncovered in Burma: http://t.co/TcTrCVzw","Archaeologists Find Earthenware from Heian Period Japan: http://t.co/D0N52Fdh","5,000-year-old burial sites discovered in Oman: http://t.co/msp8zsz7","Neolithic \"Earth Mother\" Discovered by French Archaeologists: http://t.co/2dT7Wd08","Evidence of Stone Age camp discovered in Staffordshire: http://t.co/JOCj7v29","Bronze Age hoard unearthed: http://t.co/kPG6EEQg","Kaiser Willhelm's urinal found at the bottom of the Baltic: http://t.co/9UlJlw68","Part of ancient fortress wall of Philippolis uncovered: http://t.co/6aT6tHQE","Earliest Human Beds Found in South Africa:  http://t.co/l2dTomCS","'Witch's cottage' unearthed in Lancashire: http://t.co/Zv4090Fy","Viking Treasure Hoard Unearthed in Furness Countryside http://bit.ly/k7ONVG","Mystery of Suffolk's Prehistoric Wooden Posts Deepens http://bit.ly/m98T8i","Archaeologists Pull RAF Spitfire From Irish Peat Bog http://bit.ly/jPvgBb","Is This the Oldest Art in the Americas? http://bit.ly/mwsFnM","Dig Finds Treasured Tools of Leading 18th Century Scientist http://bit.ly/k48DzO","Video Camera Reveals Secrets of Ancient Mayan Tomb http://bit.ly/mHyVRe","Sewer Sheds Light On Secrets Of Roman Life: http://t.co/2aTQjnH","The ’Property Boom’ of 3700 BC: http://bit.ly/iFRVnJ","Anthropologists Investigate The Battle of Stoney Creek: http://bit.ly/iIULqj","Marlborough Mound Mystery Solved – After 4,400 Years: http://bit.ly/jNgJ94","Statue of Ancient Egyptian King Found: http://bit.ly/l3tzjK","Did Roman Ship Have an On-Board Fish Tank? http://bit.ly/lXklER","Pirate Blackbeard's Anchor Recovered Off US Coast: http://bit.ly/lMuY0Y","The Grim Reality of Stirling Castle Skeletons: http://bit.ly/lByWPw","#archaeology Archaeologists Set To Unveil Secrets of Dorset Barrows: http://bit.ly/lhIISI","Lost Egyptian Pyramids Spotted From Space: http://bit.ly/kdjxcO","#Archaeology Anthropologists Investigate Ancient Hawaiian Farming Methods: http://bit.ly/jWawxs","Torn Painting To Be Rejoined After 360 Years: http://bit.ly/luJHJ8","#archaeology Remains of Medieval Village Uncovered in North West England http://bit.ly/iR5tmV","#archaeology Relics Recovered From Ming Galleon: http://bit.ly/lBipem","Bronze Age Battle Site Unearthed: http://bit.ly/iUcjRE","#history Italian builders find 700-year-old fresco hidden behind a wall: http://bit.ly/jADI1F","Workers Stumble Upon Ancient Roman Ruins: http://bit.ly/jIRheC  #archaeology","2,000 Year Old Murder Discovered in Kent, England: http://bit.ly/kGJMVm","#archaeology Scottish Site May Have Been Occupied For 1,000 Years: http://bit.ly/lRoBb6","Recreating the sound of Tutankhamun's trumpets: http://bbc.in/hLkoHI","Ancient Tablet Found: Oldest Readable Writing in Europe http://bit.ly/dNqJAj","Archaeologists Conduct an Iron Age Communication Experiment in Wales http://bit.ly/e6lgMZ","10,000 Year Old Spear Found in Tampa, Florida http://bit.ly/f7CQAq","Archaeologists Uncover Historic Mexican Settlement Near the Presidio - The Bay Citizen http://bit.ly/fA6gRT","What made Stephenson's Rocket so special? (video) http://bit.ly/gQECdd","#archaeology #history Third Century Roman Sculptures Discovered http://bit.ly/e4NMX4","#history Photos taken by the enemy in Second World War shows lost #Tudor garden http://bit.ly/dVZlgn","#history Finns to Revive #Beer from 19th Century Shipwreck http://bit.ly/fNKU0U","Archaeological trove found on Google Earth http://bit.ly/fc7xd8","#archaeology #history Stone Age Settlement Unearthed near Carlisle http://bit.ly/gaCfCO","#archaeology #history Over 500 Artefacts unearthed in NE Iran http://bit.ly/hUPtwb","Picasso's La Lecture up for Auction http://bit.ly/h0mofx","#history Roman Shipwreck Reveals Ancient Secrets of Medicine http://bit.ly/gnk6mm","#archaeology #history New monument found at Stonehenge  http://goo.gl/61W4j","#archaeology #history Norman Cathedral Unearthed in Bath http://bit.ly/hDfSQ0","#archaeology #history Bronze Age rock engravings found in Norway http://bit.ly/h9ygUR","Saturday's #history news round up: http://bit.ly/hnyCPr","#archaeology #history Roman Road Found in Puddletown Forest http://bit.ly/ewFN0Z","Viking fortress Discovered in NE Ireland http://bit.ly/hRB0s0","#archaeology #history 9 Year Old Cub Scout Finds Neolithic Axe http://bit.ly/dTzyIz","#history #Egypt Great Pyramid may have Two Secret Rooms http://bit.ly/fuxdzn","#history Mural of King Henry VIII Uncovered http://bit.ly/fhIZDd","King is most Dangerous Job in #History http://bit.ly/gLAwfq","#archaeology #history Largest Stone Age building found in NW China http://bit.ly/dMtL9P","#history Space Age Technology used to Analyse Tudor Tombs http://bit.ly/fCrtg4","#archaeology #history Ancient Sewer Discovered in Jerusalem http://bit.ly/ik4Mw0","#archaeology #history Archaeologists survey Churchill's secret headquarters:  http://bit.ly/gvybyQ","#archaeology #history Archaeologists Discover Ruins in Tanzania http://bit.ly/gSdrHn","#history 'Electric Lamp' turns out to be 2000 year old #Roman Urn http://bit.ly/h1UFP9","#history 15th century inscription discovered in #India http://bit.ly/gNldf5","#archaeology #history More Evidence of #Roman 'Shanty Town' Unearthed http://bit.ly/emxU6e","#archaeology #history Original Ibiza Town Uncovered http://bit.ly/eLvtfm","@IndyInTheClass no problem & thanks for the re-tweet!","#archaeology #history Archaeologists Search for legendary Maya City: http://goo.gl/wythH","@historypeoples new World History site: http://bit.ly/gmZNVI   take a look!","#history #archaeology Saxon skeletons found in Oxfordshire http://bit.ly/fi4tNQ","#history #archaeology Megalithic site found in South Sumatra http://bit.ly/eEWx2m","#history #russia No Proof that Lenin ordered the last Tsar's Murder http://bit.ly/hvcAeU","#history 100 Year Old Whisky Comes Home http://bit.ly/fLCuXK","#roman #history Has Caligula's tomb been found? http://bit.ly/ew3rD3","#history Was gunpowder's rise due to ease of training? http://bit.ly/fBCFit","#history New Discoveries at Roman Baths in Bosra, Syria: http://bit.ly/i3lEU3","#history #archaeology Fort uncovered in St. Augustine, Florida: http://bit.ly/f0Jr9s","#history Reviving the taste of an Iron Age Beer http://bit.ly/gRiPR1","#history #art Medieval Painting at Tower of London Investigated http://bit.ly/dI3IXw","#history #archaeology \"Golden Year\" for Archaeologists in Turkey http://bit.ly/h7ZK5R","#history Leaning Tower of Pisa's Kaleidoscope to be Restored http://bit.ly/dNoIWP","#history #archaeology Tourism hangs in balance at Babylon http://bit.ly/eGTtTa","#history #pirates Is This Blackbeard's Sword? http://bit.ly/esng8S","#history #archaeology Maya Pyramid Restored http://bit.ly/dJPD7t","#archaeology #history China: Shang city ruins found http://bit.ly/eJ7yUH","@LorcanDesperado Very true. There were undoubtedly many factors that led to the fall of the west, but its an interesting idea nonetheless.","RT: @dfrankstone Fall of Roman Empire linked to wild shifts in climate: http://bit.ly/fZJ1cT","#history Neolithic village discovered in Derbyshire http://bit.ly/hSdYdw","#history Researcher finds oldest known domesticated dog in Americas:  http://bit.ly/ggJr2c","@David73277 oops, i'm not sure why that is happening...i'll have to take a look at it tomorrow.  Thanks for letting me know!","#archaeology #history archaeologists embark on survey of Buddha's birthplace http://bit.ly/eayWl3","On this day in #history (January 11) The Anglo-Zulu War began (1879)","#history Earliest known winery found in Armenian cave: http://wapo.st/g6UeGV","#history Remains of Gupta period temple, stupa found http://bit.ly/fO2THx","#history Ancient Farmers Swiftly Spread into Europe  http://bit.ly/gOuCSS","The 10 deadliest riots in #history http://bit.ly/frOaio","#history On this day in history (January 10) Julius Caesar crossed the Rubicon river and began his civil war with Rome","#art #history Art Historian claims that Mona Lisa backdrop depicts Italian town of Bobbio http://bit.ly/gnaLFo","Missing pieces of colossal statue unearthed in Egypt: http://wapo.st/hsDV80","#archaeology #history House expected to reveal hidden secrets of an ancient city: http://bit.ly/fx0FrB","#archaeology #history New archeological discoveries in Taima: http://bit.ly/gVgH9y","Man's first clothes now 170,000 years out of style:  http://goo.gl/NFQG6","#history Off with the head of the Tower of London: http://goo.gl/bMR84","#history Japan rebuilds ancient castle: http://goo.gl/VdCQs","#archaeology Two tons of ancient coins unearthed in Zhejiang: http://goo.gl/MbdNW","#history  Archaeologists Unearthed Byzantine Mosaic Painting in Syria http://goo.gl/qtzyQ","#history  7,000-year-old timbers found beneath MI6 headquarters:  http://goo.gl/kmPhN","#history New revelations about slaves and slave trade: http://goo.gl/sW59M","#Archaeology Ancient tombs spanning three dynasties unearthed in Chengdu: http://goo.gl/mqTGI","Prehistoric birds 'tried jousting':  http://goo.gl/HLTJ3","#history #archaeology 5000 year old site found in Iran:   http://goo.gl/GwUGY","#history Mosaics provide missing pieces to popular ancient plays: http://goo.gl/kn9Fn","#history Ancient Greek drinking games: http://goo.gl/dWm8I","@Fictional100 Glad you enjoyed it & thanks for the welcome!","#history Celestial computers of ancient Greece: http://goo.gl/GgIl7","#history Will the tomb of King Tut's Queen turn up in 2011?  http://goo.gl/nTV6e","#history Archaeologists have found evidence that humans could navigate across water earlier than previously thought http://goo.gl/IDYsR","#history Was Robin Hood Scottish? http://goo.gl/6J4bT","#history Jamestown dig unearths 400-year-old tobacco pipes: http://goo.gl/3CGJ2","#history The land where Greek's ancient language survives: http://goo.gl/cyWNO","#history An ancient game that is still going strong http://goo.gl/Mn4sW","#history The makings of a hero in ancient Greek history http://goo.gl/zPqjD","#history Archaeologists uncover ancient city in Socotra Island   http://goo.gl/xBAvG","#history was this the location of Britain's first gun fight? http://goo.gl/cmIfI","#history Tunnel found at Lincoln Castle.  http://goo.gl/0kQgg","#history Was Stonehenge built using wicker baskets? http://goo.gl/OhR9N","Just added myself to the http://wefollow.com twitter directory under:  #bingley_bradford_united_kingdom #history #archaeology #mediev"]